[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:8:51
 let currentMismatches: any[] = [];
 
 // ── Safe DOM text setter (replaces innerHTML to prevent XSS) ─────────────────
-function setText(el: Element, text: string): void {
-  el.textContent = text;
-}
+function setText(el: Element, text: string): void {}
 
 function createEl<K extends keyof HTMLElementTagNameMap>(

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:16:29
   tag: K,
   attrs: Record<string, string> = {},
   text?: string
-): HTMLElementTagNameMap[K] {
-  const el = document.createElement(tag);
-  for (const [k, v] of Object.entries(attrs)) el.setAttribute(k, v);
-  if (text !== undefined) el.textContent = text;
-  return el;
-}
+): HTMLElementTagNameMap[K] {}
 
 // ── Render ────────────────────────────────────────────────────────────────────

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:19:7
 ): HTMLElementTagNameMap[K] {
   const el = document.createElement(tag);
   for (const [k, v] of Object.entries(attrs)) el.setAttribute(k, v);
-  if (text !== undefined) el.textContent = text;
+  if (true) el.textContent = text;
   return el;
 }

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:19:7
 ): HTMLElementTagNameMap[K] {
   const el = document.createElement(tag);
   for (const [k, v] of Object.entries(attrs)) el.setAttribute(k, v);
-  if (text !== undefined) el.textContent = text;
+  if (false) el.textContent = text;
   return el;
 }

[NoCoverage] EqualityOperator
extension/src/devtools/panel.ts:29:5
   container.innerHTML = "";
 
   const filtered =
-    filter === "all"
+    filter !== "all"
       ? currentMismatches
       : filter === "critical"

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:29:5
   container.innerHTML = "";
 
   const filtered =
-    filter === "all"
+    false
       ? currentMismatches
       : filter === "critical"

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:31:9
   const filtered =
     filter === "all"
       ? currentMismatches
-      : filter === "critical"
+      : true
       ? currentMismatches.filter((m) => ["critical", "security"].includes(m.severity))
       : currentMismatches.filter((m) => m.severity === filter);

[NoCoverage] EqualityOperator
extension/src/devtools/panel.ts:31:9
   const filtered =
     filter === "all"
       ? currentMismatches
-      : filter === "critical"
+      : filter !== "critical"
       ? currentMismatches.filter((m) => ["critical", "security"].includes(m.severity))
       : currentMismatches.filter((m) => m.severity === filter);

[NoCoverage] MethodExpression
extension/src/devtools/panel.ts:32:9
     filter === "all"
       ? currentMismatches
       : filter === "critical"
-      ? currentMismatches.filter((m) => ["critical", "security"].includes(m.severity))
+      ? currentMismatches
       : currentMismatches.filter((m) => m.severity === filter);
 

[NoCoverage] ArrowFunction
extension/src/devtools/panel.ts:32:34
     filter === "all"
       ? currentMismatches
       : filter === "critical"
-      ? currentMismatches.filter((m) => ["critical", "security"].includes(m.severity))
+      ? currentMismatches.filter(() => undefined)
       : currentMismatches.filter((m) => m.severity === filter);
 

[NoCoverage] MethodExpression
extension/src/devtools/panel.ts:33:9
       ? currentMismatches
       : filter === "critical"
       ? currentMismatches.filter((m) => ["critical", "security"].includes(m.severity))
-      : currentMismatches.filter((m) => m.severity === filter);
+      : currentMismatches;
 
   if (filtered.length === 0) {

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:33:41
       ? currentMismatches
       : filter === "critical"
       ? currentMismatches.filter((m) => ["critical", "security"].includes(m.severity))
-      : currentMismatches.filter((m) => m.severity === filter);
+      : currentMismatches.filter((m) => false);
 
   if (filtered.length === 0) {

[NoCoverage] EqualityOperator
extension/src/devtools/panel.ts:35:7
       ? currentMismatches.filter((m) => ["critical", "security"].includes(m.severity))
       : currentMismatches.filter((m) => m.severity === filter);
 
-  if (filtered.length === 0) {
+  if (filtered.length !== 0) {
     container.appendChild(createEl("div", {}, "No issues found."));
     return;

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:35:7
       ? currentMismatches.filter((m) => ["critical", "security"].includes(m.severity))
       : currentMismatches.filter((m) => m.severity === filter);
 
-  if (filtered.length === 0) {
+  if (true) {
     container.appendChild(createEl("div", {}, "No issues found."));
     return;

[NoCoverage] ObjectLiteral
extension/src/devtools/panel.ts:43:34
   for (const m of filtered) {
     // FIX: build DOM nodes instead of using innerHTML to prevent XSS from
     //      crafted mismatch payloads injected via chrome.runtime.sendMessage
-    const card = createEl("div", { class: `issue ${m.severity}` });
+    const card = createEl("div", {});
 
     const header = createEl("strong");

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:43:27
   for (const m of filtered) {
     // FIX: build DOM nodes instead of using innerHTML to prevent XSS from
     //      crafted mismatch payloads injected via chrome.runtime.sendMessage
-    const card = createEl("div", { class: `issue ${m.severity}` });
+    const card = createEl("", { class: `issue ${m.severity}` });
 
     const header = createEl("strong");

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:45:29
     //      crafted mismatch payloads injected via chrome.runtime.sendMessage
     const card = createEl("div", { class: `issue ${m.severity}` });
 
-    const header = createEl("strong");
+    const header = createEl("");
     header.textContent = `[${m.severity.toUpperCase()}] ${m.componentName || "Unknown"}`;
     card.appendChild(header);

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:46:59
     const card = createEl("div", { class: `issue ${m.severity}` });
 
     const header = createEl("strong");
-    header.textContent = `[${m.severity.toUpperCase()}] ${m.componentName || "Unknown"}`;
+    header.textContent = `[${m.severity.toUpperCase()}] ${false}`;
     card.appendChild(header);
     card.appendChild(createEl("br"));

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:46:59
     const card = createEl("div", { class: `issue ${m.severity}` });
 
     const header = createEl("strong");
-    header.textContent = `[${m.severity.toUpperCase()}] ${m.componentName || "Unknown"}`;
+    header.textContent = `[${m.severity.toUpperCase()}] ${true}`;
     card.appendChild(header);
     card.appendChild(createEl("br"));

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:48:31
     const header = createEl("strong");
     header.textContent = `[${m.severity.toUpperCase()}] ${m.componentName || "Unknown"}`;
     card.appendChild(header);
-    card.appendChild(createEl("br"));
+    card.appendChild(createEl(""));
 
     const selectorLine = createEl("span");

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:51:39
     card.appendChild(createEl("br"));
 
     const selectorLine = createEl("span");
-    selectorLine.appendChild(createEl("em", {}, "Selector: "));
+    selectorLine.appendChild(createEl("", {}, "Selector: "));
     selectorLine.appendChild(document.createTextNode(m.selector));
     card.appendChild(selectorLine);

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:61:32
     reasonLine.appendChild(document.createTextNode(m.severityReason));
     card.appendChild(reasonLine);
 
-    const adviceBox = createEl("div", {
+    const adviceBox = createEl("", {
       style: "margin-top:5px;padding:5px;background:#111;",
     });

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:62:14
     card.appendChild(reasonLine);
 
     const adviceBox = createEl("div", {
-      style: "margin-top:5px;padding:5px;background:#111;",
+      style: "",
     });
     const adviceLabel = createEl("strong", {}, "Advice: ");

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:64:48
     const adviceBox = createEl("div", {
       style: "margin-top:5px;padding:5px;background:#111;",
     });
-    const adviceLabel = createEl("strong", {}, "Advice: ");
+    const adviceLabel = createEl("strong", {}, "");
     adviceBox.appendChild(adviceLabel);
     adviceBox.appendChild(document.createTextNode(m.advice));

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:64:34
     const adviceBox = createEl("div", {
       style: "margin-top:5px;padding:5px;background:#111;",
     });
-    const adviceLabel = createEl("strong", {}, "Advice: ");
+    const adviceLabel = createEl("", {}, "Advice: ");
     adviceBox.appendChild(adviceLabel);
     adviceBox.appendChild(document.createTextNode(m.advice));

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:67:36
     const adviceLabel = createEl("strong", {}, "Advice: ");
     adviceBox.appendChild(adviceLabel);
     adviceBox.appendChild(document.createTextNode(m.advice));
-    adviceBox.appendChild(createEl("br"));
+    adviceBox.appendChild(createEl(""));
     adviceBox.appendChild(createEl("code", {}, m.fixSnippet));
     card.appendChild(adviceBox);

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:71:32
     adviceBox.appendChild(createEl("code", {}, m.fixSnippet));
     card.appendChild(adviceBox);
 
-    const ignoreBtn = createEl("button", {
+    const ignoreBtn = createEl("", {
       "data-selector": m.selector,
       style: "margin-top:8px;background:#444;",

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:73:14
 
     const ignoreBtn = createEl("button", {
       "data-selector": m.selector,
-      style: "margin-top:8px;background:#444;",
+      style: "",
     }, "Ignore Selector");
     ignoreBtn.addEventListener("click", (e) => {

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:75:48
       "data-selector": m.selector,
       style: "margin-top:8px;background:#444;",
     }, "Ignore Selector");
-    ignoreBtn.addEventListener("click", (e) => {
-      const selector = (e.target as HTMLElement).getAttribute("data-selector");
-      chrome.storage.local.get(["ignoredSelectors"], (res) => {
-        const ignored: string[] = res.ignoredSelectors ?? [];
-        if (selector && !ignored.includes(selector)) ignored.push(selector);
-        chrome.storage.local.set({ ignoredSelectors: ignored }, () => {
-          (e.target as HTMLElement).textContent = "Ignored";
-        });
-      });
-    });
+    ignoreBtn.addEventListener("click", (e) => {});
     card.appendChild(ignoreBtn);
 

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:77:63
     }, "Ignore Selector");
     ignoreBtn.addEventListener("click", (e) => {
       const selector = (e.target as HTMLElement).getAttribute("data-selector");
-      chrome.storage.local.get(["ignoredSelectors"], (res) => {
-        const ignored: string[] = res.ignoredSelectors ?? [];
-        if (selector && !ignored.includes(selector)) ignored.push(selector);
-        chrome.storage.local.set({ ignoredSelectors: ignored }, () => {
-          (e.target as HTMLElement).textContent = "Ignored";
-        });
-      });
+      chrome.storage.local.get(["ignoredSelectors"], (res) => {});
     });
     card.appendChild(ignoreBtn);

[NoCoverage] ArrayDeclaration
extension/src/devtools/panel.ts:77:32
     }, "Ignore Selector");
     ignoreBtn.addEventListener("click", (e) => {
       const selector = (e.target as HTMLElement).getAttribute("data-selector");
-      chrome.storage.local.get(["ignoredSelectors"], (res) => {
+      chrome.storage.local.get([], (res) => {
         const ignored: string[] = res.ignoredSelectors ?? [];
         if (selector && !ignored.includes(selector)) ignored.push(selector);

[NoCoverage] LogicalOperator
extension/src/devtools/panel.ts:79:13
       const selector = (e.target as HTMLElement).getAttribute("data-selector");
       chrome.storage.local.get(["ignoredSelectors"], (res) => {
         const ignored: string[] = res.ignoredSelectors ?? [];
-        if (selector && !ignored.includes(selector)) ignored.push(selector);
+        if (selector || !ignored.includes(selector)) ignored.push(selector);
         chrome.storage.local.set({ ignoredSelectors: ignored }, () => {
           (e.target as HTMLElement).textContent = "Ignored";

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:79:13
       const selector = (e.target as HTMLElement).getAttribute("data-selector");
       chrome.storage.local.get(["ignoredSelectors"], (res) => {
         const ignored: string[] = res.ignoredSelectors ?? [];
-        if (selector && !ignored.includes(selector)) ignored.push(selector);
+        if (false) ignored.push(selector);
         chrome.storage.local.set({ ignoredSelectors: ignored }, () => {
           (e.target as HTMLElement).textContent = "Ignored";

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:80:71
       chrome.storage.local.get(["ignoredSelectors"], (res) => {
         const ignored: string[] = res.ignoredSelectors ?? [];
         if (selector && !ignored.includes(selector)) ignored.push(selector);
-        chrome.storage.local.set({ ignoredSelectors: ignored }, () => {
-          (e.target as HTMLElement).textContent = "Ignored";
-        });
+        chrome.storage.local.set({ ignoredSelectors: ignored }, () => {});
       });
     });

[NoCoverage] ObjectLiteral
extension/src/devtools/panel.ts:80:34
       chrome.storage.local.get(["ignoredSelectors"], (res) => {
         const ignored: string[] = res.ignoredSelectors ?? [];
         if (selector && !ignored.includes(selector)) ignored.push(selector);
-        chrome.storage.local.set({ ignoredSelectors: ignored }, () => {
+        chrome.storage.local.set({}, () => {
           (e.target as HTMLElement).textContent = "Ignored";
         });

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:92:47
 }
 
 // ── Persist & restore results across DevTools open/close ─────────────────────
-function saveResults(mismatches: any[]): void {
-  // chrome.storage.session is cleared when the browser session ends (tab close / browser restart)
-  chrome.storage.session.set({ [STORAGE_KEY]: mismatches });
-}
+function saveResults(mismatches: any[]): void {}
 
 function restoreResults(): void {

[NoCoverage] ObjectLiteral
extension/src/devtools/panel.ts:94:30
 // ── Persist & restore results across DevTools open/close ─────────────────────
 function saveResults(mismatches: any[]): void {
   // chrome.storage.session is cleared when the browser session ends (tab close / browser restart)
-  chrome.storage.session.set({ [STORAGE_KEY]: mismatches });
+  chrome.storage.session.set({});
 }
 

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:97:33
   chrome.storage.session.set({ [STORAGE_KEY]: mismatches });
 }
 
-function restoreResults(): void {
-  chrome.storage.session.get([STORAGE_KEY], (res) => {
-    if (res[STORAGE_KEY]?.length) {
-      currentMismatches = res[STORAGE_KEY];
-      renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);
-    }
-  });
-}
+function restoreResults(): void {}
 
 // ── Message listener ──────────────────────────────────────────────────────────

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:98:54
 }
 
 function restoreResults(): void {
-  chrome.storage.session.get([STORAGE_KEY], (res) => {
-    if (res[STORAGE_KEY]?.length) {
-      currentMismatches = res[STORAGE_KEY];
-      renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);
-    }
-  });
+  chrome.storage.session.get([STORAGE_KEY], (res) => {});
 }
 

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:99:9
 
 function restoreResults(): void {
   chrome.storage.session.get([STORAGE_KEY], (res) => {
-    if (res[STORAGE_KEY]?.length) {
+    if (true) {
       currentMismatches = res[STORAGE_KEY];
       renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:99:9
 
 function restoreResults(): void {
   chrome.storage.session.get([STORAGE_KEY], (res) => {
-    if (res[STORAGE_KEY]?.length) {
+    if (false) {
       currentMismatches = res[STORAGE_KEY];
       renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:107:47
 }
 
 // ── Message listener ──────────────────────────────────────────────────────────
-chrome.runtime.onMessage.addListener((msg) => {
-  if (msg.type === "HYDRALENS_RESULTS") {
-    currentMismatches = msg.payload.mismatches;
-    saveResults(currentMismatches);
-    renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);
-  }
-  if (msg.type === "HYDRALENS_ERROR") {
-    const container = document.getElementById("results")!;
-    container.innerHTML = "";
-    container.appendChild(createEl("div", { style: "color:#ef4444;" }, `Error: ${msg.payload.message}`));
-  }
-});
+chrome.runtime.onMessage.addListener((msg) => {});
 
 // ── Toolbar event listeners ───────────────────────────────────────────────────

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:108:7
 
 // ── Message listener ──────────────────────────────────────────────────────────
 chrome.runtime.onMessage.addListener((msg) => {
-  if (msg.type === "HYDRALENS_RESULTS") {
+  if (false) {
     currentMismatches = msg.payload.mismatches;
     saveResults(currentMismatches);

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:113:39
     saveResults(currentMismatches);
     renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);
   }
-  if (msg.type === "HYDRALENS_ERROR") {
-    const container = document.getElementById("results")!;
-    container.innerHTML = "";
-    container.appendChild(createEl("div", { style: "color:#ef4444;" }, `Error: ${msg.payload.message}`));
-  }
+  if (msg.type === "HYDRALENS_ERROR") {}
 });
 

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:113:7
     saveResults(currentMismatches);
     renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);
   }
-  if (msg.type === "HYDRALENS_ERROR") {
+  if (false) {
     const container = document.getElementById("results")!;
     container.innerHTML = "";

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:114:47
     renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);
   }
   if (msg.type === "HYDRALENS_ERROR") {
-    const container = document.getElementById("results")!;
+    const container = document.getElementById("")!;
     container.innerHTML = "";
     container.appendChild(createEl("div", { style: "color:#ef4444;" }, `Error: ${msg.payload.message}`));

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:115:27
   }
   if (msg.type === "HYDRALENS_ERROR") {
     const container = document.getElementById("results")!;
-    container.innerHTML = "";
+    container.innerHTML = "Stryker was here!";
     container.appendChild(createEl("div", { style: "color:#ef4444;" }, `Error: ${msg.payload.message}`));
   }

[NoCoverage] ObjectLiteral
extension/src/devtools/panel.ts:116:43
   if (msg.type === "HYDRALENS_ERROR") {
     const container = document.getElementById("results")!;
     container.innerHTML = "";
-    container.appendChild(createEl("div", { style: "color:#ef4444;" }, `Error: ${msg.payload.message}`));
+    container.appendChild(createEl("div", {}, `Error: ${msg.payload.message}`));
   }
 });

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:116:36
   if (msg.type === "HYDRALENS_ERROR") {
     const container = document.getElementById("results")!;
     container.innerHTML = "";
-    container.appendChild(createEl("div", { style: "color:#ef4444;" }, `Error: ${msg.payload.message}`));
+    container.appendChild(createEl("", { style: "color:#ef4444;" }, `Error: ${msg.payload.message}`));
   }
 });

[NoCoverage] OptionalChaining
extension/src/devtools/panel.ts:121:1
 });
 
 // ── Toolbar event listeners ───────────────────────────────────────────────────
-document.getElementById("refreshBtn")?.addEventListener("click", () => {
+document.getElementById("refreshBtn").addEventListener("click", () => {
   chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
     if (tabs[0]?.id) chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:121:72
 });
 
 // ── Toolbar event listeners ───────────────────────────────────────────────────
-document.getElementById("refreshBtn")?.addEventListener("click", () => {
-  chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
-    if (tabs[0]?.id) chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });
-  });
-});
+document.getElementById("refreshBtn")?.addEventListener("click", () => {});
 
 document.getElementById("severityFilter")?.addEventListener("change", (e) => {

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:122:70
 
 // ── Toolbar event listeners ───────────────────────────────────────────────────
 document.getElementById("refreshBtn")?.addEventListener("click", () => {
-  chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
-    if (tabs[0]?.id) chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });
-  });
+  chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {});
 });
 

[NoCoverage] BooleanLiteral
extension/src/devtools/panel.ts:122:31
 
 // ── Toolbar event listeners ───────────────────────────────────────────────────
 document.getElementById("refreshBtn")?.addEventListener("click", () => {
-  chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
+  chrome.tabs.query({ active: false, currentWindow: true }, (tabs) => {
     if (tabs[0]?.id) chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });
   });

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:123:9
 // ── Toolbar event listeners ───────────────────────────────────────────────────
 document.getElementById("refreshBtn")?.addEventListener("click", () => {
   chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
-    if (tabs[0]?.id) chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });
+    if (false) chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });
   });
 });

[NoCoverage] OptionalChaining
extension/src/devtools/panel.ts:123:9
 // ── Toolbar event listeners ───────────────────────────────────────────────────
 document.getElementById("refreshBtn")?.addEventListener("click", () => {
   chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
-    if (tabs[0]?.id) chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });
+    if (tabs[0].id) chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });
   });
 });

[NoCoverage] OptionalChaining
extension/src/devtools/panel.ts:127:1
   });
 });
 
-document.getElementById("severityFilter")?.addEventListener("change", (e) => {
+document.getElementById("severityFilter").addEventListener("change", (e) => {
   renderResults((e.target as HTMLSelectElement).value);
 });

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:127:78
   });
 });
 
-document.getElementById("severityFilter")?.addEventListener("change", (e) => {
-  renderResults((e.target as HTMLSelectElement).value);
-});
+document.getElementById("severityFilter")?.addEventListener("change", (e) => {});
 
 document.getElementById("clearIgnoreBtn")?.addEventListener("click", () => {

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:131:76
   renderResults((e.target as HTMLSelectElement).value);
 });
 
-document.getElementById("clearIgnoreBtn")?.addEventListener("click", () => {
-  chrome.storage.local.set({ ignoredSelectors: [] }, () => alert("Ignore list cleared!"));
-});
+document.getElementById("clearIgnoreBtn")?.addEventListener("click", () => {});
 
 // FIX: restore last scan results when the panel mounts (fixes blank-panel-on-open)

[NoCoverage] OptionalChaining
extension/src/devtools/panel.ts:131:1
   renderResults((e.target as HTMLSelectElement).value);
 });
 
-document.getElementById("clearIgnoreBtn")?.addEventListener("click", () => {
+document.getElementById("clearIgnoreBtn").addEventListener("click", () => {
   chrome.storage.local.set({ ignoredSelectors: [] }, () => alert("Ignore list cleared!"));
 });

[NoCoverage] ArrowFunction
extension/src/devtools/panel.ts:132:54
 });
 
 document.getElementById("clearIgnoreBtn")?.addEventListener("click", () => {
-  chrome.storage.local.set({ ignoredSelectors: [] }, () => alert("Ignore list cleared!"));
+  chrome.storage.local.set({ ignoredSelectors: [] }, () => undefined);
 });
 

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:132:66
 });
 
 document.getElementById("clearIgnoreBtn")?.addEventListener("click", () => {
-  chrome.storage.local.set({ ignoredSelectors: [] }, () => alert("Ignore list cleared!"));
+  chrome.storage.local.set({ ignoredSelectors: [] }, () => alert(""));
 });
 
