[Timeout] ObjectLiteral
packages/core/src/index.ts:25:19
 
 // ── ADVICE DATABASE ───────────────────────────────────────────────────────────
 const ADVICE_DATABASE: Record<string, Record<string, { advice: string; snippet: string }>> = {
-  ReactComponent: {
-    "text-mismatch": {
-      advice: "State mismatch detected. Use 'useEffect' to set initial client state only AFTER mounting.",
-      snippet: "const [isClient, setIsClient] = useState(false);\nuseEffect(() => setIsClient(true), []);\nreturn <div>{isClient ? clientValue : serverValue}</div>;",
-    },
-    "attribute-mismatch": {
-      advice: "Use 'suppressHydrationWarning' if this dynamic attribute is intentional.",
-      snippet: "<div suppressHydrationWarning={true} className={dynamicClass} />",
-    },
-  },
+  ReactComponent: {},
   VueComponent: {
     "text-mismatch": {

[Timeout] ObjectLiteral
packages/core/src/index.ts:26:22
 // ── ADVICE DATABASE ───────────────────────────────────────────────────────────
 const ADVICE_DATABASE: Record<string, Record<string, { advice: string; snippet: string }>> = {
   ReactComponent: {
-    "text-mismatch": {
-      advice: "State mismatch detected. Use 'useEffect' to set initial client state only AFTER mounting.",
-      snippet: "const [isClient, setIsClient] = useState(false);\nuseEffect(() => setIsClient(true), []);\nreturn <div>{isClient ? clientValue : serverValue}</div>;",
-    },
+    "text-mismatch": {},
     "attribute-mismatch": {
       advice: "Use 'suppressHydrationWarning' if this dynamic attribute is intentional.",

[Timeout] StringLiteral
packages/core/src/index.ts:31:15
       snippet: "const [isClient, setIsClient] = useState(false);\nuseEffect(() => setIsClient(true), []);\nreturn <div>{isClient ? clientValue : serverValue}</div>;",
     },
     "attribute-mismatch": {
-      advice: "Use 'suppressHydrationWarning' if this dynamic attribute is intentional.",
+      advice: "",
       snippet: "<div suppressHydrationWarning={true} className={dynamicClass} />",
     },

[Timeout] StringLiteral
packages/core/src/index.ts:41:15
       snippet: "const value = ref('');\nonMounted(() => { value.value = localStorage.getItem('key') ?? ''; });",
     },
     "attribute-mismatch": {
-      advice: "Use v-if with a client-only flag to prevent SSR/CSR attribute mismatches.",
+      advice: "",
       snippet: "const isClient = ref(false);\nonMounted(() => { isClient.value = true; });",
     },

[Timeout] ObjectLiteral
packages/core/src/index.ts:45:20
       snippet: "const isClient = ref(false);\nonMounted(() => { isClient.value = true; });",
     },
   },
-  SvelteComponent: {
-    "text-mismatch": {
-      advice: "Use onMount() to defer browser-only logic and avoid SSR mismatches.",
-      snippet: "import { onMount } from 'svelte';\nlet value = '';\nonMount(() => { value = localStorage.getItem('key') ?? ''; });",
-    },
-    "attribute-mismatch": {
-      advice: "Use a mounted flag to suppress SSR attribute differences.",
-      snippet: "let mounted = false;\nonMount(() => { mounted = true; });",
-    },
-  },
+  SvelteComponent: {},
   SolidComponent: {
     "text-mismatch": {

[Timeout] StringLiteral
packages/core/src/index.ts:48:16
   SvelteComponent: {
     "text-mismatch": {
       advice: "Use onMount() to defer browser-only logic and avoid SSR mismatches.",
-      snippet: "import { onMount } from 'svelte';\nlet value = '';\nonMount(() => { value = localStorage.getItem('key') ?? ''; });",
+      snippet: "",
     },
     "attribute-mismatch": {

[Timeout] StringLiteral
packages/core/src/index.ts:51:15
       snippet: "import { onMount } from 'svelte';\nlet value = '';\nonMount(() => { value = localStorage.getItem('key') ?? ''; });",
     },
     "attribute-mismatch": {
-      advice: "Use a mounted flag to suppress SSR attribute differences.",
+      advice: "",
       snippet: "let mounted = false;\nonMount(() => { mounted = true; });",
     },

[Timeout] ObjectLiteral
packages/core/src/index.ts:56:22
     },
   },
   SolidComponent: {
-    "text-mismatch": {
-      advice: "Use createEffect or isServer to guard browser-only logic in SolidJS.",
-      snippet: "import { isServer } from 'solid-js/web';\nconst value = isServer ? '' : localStorage.getItem('key') ?? '';",
-    },
+    "text-mismatch": {},
     "attribute-mismatch": {
       advice: "Wrap dynamic attributes in createEffect to run only on the client.",

[Timeout] StringLiteral
packages/core/src/index.ts:62:16
     },
     "attribute-mismatch": {
       advice: "Wrap dynamic attributes in createEffect to run only on the client.",
-      snippet: "createEffect(() => { el.setAttribute('data-val', computedValue()); });",
+      snippet: "",
     },
   },

[Timeout] StringLiteral
packages/core/src/index.ts:68:16
   AngularComponent: {
     "text-mismatch": {
       advice: "Use isPlatformBrowser() to guard browser-only code and avoid SSR mismatches.",
-      snippet: "constructor(@Inject(PLATFORM_ID) private platformId: Object) {}\nngOnInit() { if (isPlatformBrowser(this.platformId)) { /* client only */ } }",
+      snippet: "",
     },
     "attribute-mismatch": {

[Timeout] ObjectLiteral
packages/core/src/index.ts:70:27
       advice: "Use isPlatformBrowser() to guard browser-only code and avoid SSR mismatches.",
       snippet: "constructor(@Inject(PLATFORM_ID) private platformId: Object) {}\nngOnInit() { if (isPlatformBrowser(this.platformId)) { /* client only */ } }",
     },
-    "attribute-mismatch": {
-      advice: "Move dynamic bindings into ngAfterViewInit or use TransferState to sync SSR data.",
-      snippet: "// Use TransferState to pass server data to the client without re-fetching.",
-    },
+    "attribute-mismatch": {},
   },
   Unknown: {

[Timeout] StringLiteral
packages/core/src/index.ts:71:15
       snippet: "constructor(@Inject(PLATFORM_ID) private platformId: Object) {}\nngOnInit() { if (isPlatformBrowser(this.platformId)) { /* client only */ } }",
     },
     "attribute-mismatch": {
-      advice: "Move dynamic bindings into ngAfterViewInit or use TransferState to sync SSR data.",
+      advice: "",
       snippet: "// Use TransferState to pass server data to the client without re-fetching.",
     },

[Timeout] ObjectLiteral
packages/core/src/index.ts:75:12
       snippet: "// Use TransferState to pass server data to the client without re-fetching.",
     },
   },
-  Unknown: {
-    "text-mismatch": {
-      advice: "Text content differs between server and client. Check for dates, locales, or random values rendered at build time.",
-      snippet: "// Ensure dynamic values are deferred to client-side or made deterministic.",
-    },
-    "attribute-mismatch": {
-      advice: "An attribute value differs between SSR and CSR. Common causes: timestamps, nonces, or session-based values.",
-      snippet: "// Review initialization logic and defer non-deterministic attributes to client mount.",
-    },
-  },
+  Unknown: {},
 };
 

[Timeout] StringLiteral
packages/core/src/index.ts:78:16
   Unknown: {
     "text-mismatch": {
       advice: "Text content differs between server and client. Check for dates, locales, or random values rendered at build time.",
-      snippet: "// Ensure dynamic values are deferred to client-side or made deterministic.",
+      snippet: "",
     },
     "attribute-mismatch": {

[Timeout] ObjectLiteral
packages/core/src/index.ts:80:27
       advice: "Text content differs between server and client. Check for dates, locales, or random values rendered at build time.",
       snippet: "// Ensure dynamic values are deferred to client-side or made deterministic.",
     },
-    "attribute-mismatch": {
-      advice: "An attribute value differs between SSR and CSR. Common causes: timestamps, nonces, or session-based values.",
-      snippet: "// Review initialization logic and defer non-deterministic attributes to client mount.",
-    },
+    "attribute-mismatch": {},
   },
 };

[Killed] BlockStatement
packages/core/src/index.ts:87:107
   },
 };
 
-export function getFix(componentName: string | null, reason: string): { advice: string; snippet: string } {
-  const key = componentName ?? "Unknown";
-  const db = ADVICE_DATABASE[key] ?? ADVICE_DATABASE["Unknown"];
-  const type = reason.toLowerCase().includes("text") ? "text-mismatch" : "attribute-mismatch";
-  return db[type] ?? { advice: "Review your initialization logic.", snippet: "// No specific snippet available." };
-}
+export function getFix(componentName: string | null, reason: string): { advice: string; snippet: string } {}
 
 // ── SECRET PATTERNS ───────────────────────────────────────────────────────────
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: Cannot read properties of undefined (reading 'advice')

[Survived] LogicalOperator
packages/core/src/index.ts:88:15
 };
 
 export function getFix(componentName: string | null, reason: string): { advice: string; snippet: string } {
-  const key = componentName ?? "Unknown";
+  const key = componentName && "Unknown";
   const db = ADVICE_DATABASE[key] ?? ADVICE_DATABASE["Unknown"];
   const type = reason.toLowerCase().includes("text") ? "text-mismatch" : "attribute-mismatch";

[Survived] StringLiteral
packages/core/src/index.ts:88:32
 };
 
 export function getFix(componentName: string | null, reason: string): { advice: string; snippet: string } {
-  const key = componentName ?? "Unknown";
+  const key = componentName ?? "";
   const db = ADVICE_DATABASE[key] ?? ADVICE_DATABASE["Unknown"];
   const type = reason.toLowerCase().includes("text") ? "text-mismatch" : "attribute-mismatch";

[Survived] LogicalOperator
packages/core/src/index.ts:89:14
 
 export function getFix(componentName: string | null, reason: string): { advice: string; snippet: string } {
   const key = componentName ?? "Unknown";
-  const db = ADVICE_DATABASE[key] ?? ADVICE_DATABASE["Unknown"];
+  const db = ADVICE_DATABASE[key] && ADVICE_DATABASE["Unknown"];
   const type = reason.toLowerCase().includes("text") ? "text-mismatch" : "attribute-mismatch";
   return db[type] ?? { advice: "Review your initialization logic.", snippet: "// No specific snippet available." };

[Survived] MethodExpression
packages/core/src/index.ts:90:16
 export function getFix(componentName: string | null, reason: string): { advice: string; snippet: string } {
   const key = componentName ?? "Unknown";
   const db = ADVICE_DATABASE[key] ?? ADVICE_DATABASE["Unknown"];
-  const type = reason.toLowerCase().includes("text") ? "text-mismatch" : "attribute-mismatch";
+  const type = reason.toUpperCase().includes("text") ? "text-mismatch" : "attribute-mismatch";
   return db[type] ?? { advice: "Review your initialization logic.", snippet: "// No specific snippet available." };
 }

[Survived] StringLiteral
packages/core/src/index.ts:90:56
 export function getFix(componentName: string | null, reason: string): { advice: string; snippet: string } {
   const key = componentName ?? "Unknown";
   const db = ADVICE_DATABASE[key] ?? ADVICE_DATABASE["Unknown"];
-  const type = reason.toLowerCase().includes("text") ? "text-mismatch" : "attribute-mismatch";
+  const type = reason.toLowerCase().includes("text") ? "" : "attribute-mismatch";
   return db[type] ?? { advice: "Review your initialization logic.", snippet: "// No specific snippet available." };
 }

[Survived] LogicalOperator
packages/core/src/index.ts:91:10
   const key = componentName ?? "Unknown";
   const db = ADVICE_DATABASE[key] ?? ADVICE_DATABASE["Unknown"];
   const type = reason.toLowerCase().includes("text") ? "text-mismatch" : "attribute-mismatch";
-  return db[type] ?? { advice: "Review your initialization logic.", snippet: "// No specific snippet available." };
+  return db[type] && {
+  advice: "Review your initialization logic.",
+  snippet: "// No specific snippet available."
+};
 }
 

[Killed] Regex
packages/core/src/index.ts:98:14
 // NOTE: The catch-all high-entropy pattern is intentionally removed — it produced
 // massive false-positive noise on base64 image data, font hashes, and minified JS.
 const SECRET_PATTERNS: { pattern: RegExp; label: string }[] = [
-  { pattern: /eyJ[a-zA-Z0-9_-]{10,}\.[a-zA-Z0-9_-]{10,}/, label: "JWT Token" },
+  { pattern: /eyJ[a-zA-Z0-9_-]\.[a-zA-Z0-9_-]{10,}/, label: "JWT Token" },
   { pattern: /AKIA[0-9A-Z]{16}/, label: "AWS Access Key" },
   { pattern: /sk_(live|test)_[a-zA-Z0-9]{24,}/, label: "Stripe Secret Key" },
killedBy: Heuristics: classifyAttributeMismatch should detect exposed JWT tokens as security severity
statusReason: expected 'warning' to be 'security' // Object.is equality

[Killed] ObjectLiteral
packages/core/src/index.ts:99:3
 // massive false-positive noise on base64 image data, font hashes, and minified JS.
 const SECRET_PATTERNS: { pattern: RegExp; label: string }[] = [
   { pattern: /eyJ[a-zA-Z0-9_-]{10,}\.[a-zA-Z0-9_-]{10,}/, label: "JWT Token" },
-  { pattern: /AKIA[0-9A-Z]{16}/, label: "AWS Access Key" },
+  {},
   { pattern: /sk_(live|test)_[a-zA-Z0-9]{24,}/, label: "Stripe Secret Key" },
   { pattern: /ghp_[a-zA-Z0-9]{36}/, label: "GitHub Personal Access Token" },
killedBy: Heuristics: classifyAttributeMismatch should detect exposed AWS keys as security severity
statusReason: Cannot read properties of undefined (reading 'test')

[Timeout] StringLiteral
packages/core/src/index.ts:100:56
 const SECRET_PATTERNS: { pattern: RegExp; label: string }[] = [
   { pattern: /eyJ[a-zA-Z0-9_-]{10,}\.[a-zA-Z0-9_-]{10,}/, label: "JWT Token" },
   { pattern: /AKIA[0-9A-Z]{16}/, label: "AWS Access Key" },
-  { pattern: /sk_(live|test)_[a-zA-Z0-9]{24,}/, label: "Stripe Secret Key" },
+  { pattern: /sk_(live|test)_[a-zA-Z0-9]{24,}/, label: "" },
   { pattern: /ghp_[a-zA-Z0-9]{36}/, label: "GitHub Personal Access Token" },
   { pattern: /AIza[0-9A-Za-z_-]{35}/, label: "Google API Key" },

[Timeout] Regex
packages/core/src/index.ts:102:14
   { pattern: /AKIA[0-9A-Z]{16}/, label: "AWS Access Key" },
   { pattern: /sk_(live|test)_[a-zA-Z0-9]{24,}/, label: "Stripe Secret Key" },
   { pattern: /ghp_[a-zA-Z0-9]{36}/, label: "GitHub Personal Access Token" },
-  { pattern: /AIza[0-9A-Za-z_-]{35}/, label: "Google API Key" },
+  { pattern: /AIza[^0-9A-Za-z_-]{35}/, label: "Google API Key" },
   { pattern: /xox[baprs]-[0-9A-Za-z-]{10,}/, label: "Slack Token" },
   { pattern: /AC[a-z0-9]{32}/, label: "Twilio Account SID" },

[Killed] ObjectLiteral
packages/core/src/index.ts:103:3
   { pattern: /sk_(live|test)_[a-zA-Z0-9]{24,}/, label: "Stripe Secret Key" },
   { pattern: /ghp_[a-zA-Z0-9]{36}/, label: "GitHub Personal Access Token" },
   { pattern: /AIza[0-9A-Za-z_-]{35}/, label: "Google API Key" },
-  { pattern: /xox[baprs]-[0-9A-Za-z-]{10,}/, label: "Slack Token" },
+  {},
   { pattern: /AC[a-z0-9]{32}/, label: "Twilio Account SID" },
   { pattern: /SK[a-z0-9]{32}/, label: "SendGrid API Key" },
killedBy: Heuristics: classifyAttributeMismatch should classify ARIA attribute mismatches as critical
statusReason: Cannot read properties of undefined (reading 'test')

[Timeout] Regex
packages/core/src/index.ts:103:14
   { pattern: /sk_(live|test)_[a-zA-Z0-9]{24,}/, label: "Stripe Secret Key" },
   { pattern: /ghp_[a-zA-Z0-9]{36}/, label: "GitHub Personal Access Token" },
   { pattern: /AIza[0-9A-Za-z_-]{35}/, label: "Google API Key" },
-  { pattern: /xox[baprs]-[0-9A-Za-z-]{10,}/, label: "Slack Token" },
+  { pattern: /xox[baprs]-[^0-9A-Za-z-]{10,}/, label: "Slack Token" },
   { pattern: /AC[a-z0-9]{32}/, label: "Twilio Account SID" },
   { pattern: /SK[a-z0-9]{32}/, label: "SendGrid API Key" },

[Timeout] Regex
packages/core/src/index.ts:105:14
   { pattern: /AIza[0-9A-Za-z_-]{35}/, label: "Google API Key" },
   { pattern: /xox[baprs]-[0-9A-Za-z-]{10,}/, label: "Slack Token" },
   { pattern: /AC[a-z0-9]{32}/, label: "Twilio Account SID" },
-  { pattern: /SK[a-z0-9]{32}/, label: "SendGrid API Key" },
+  { pattern: /SK[^a-z0-9]{32}/, label: "SendGrid API Key" },
   { pattern: /-----BEGIN (RSA |EC |DSA )?PRIVATE KEY-----/, label: "Private Key (PEM)" },
 ];

[Timeout] Regex
packages/core/src/index.ts:111:3
 
 // ── TIMESTAMP / DATE PATTERNS TO AUTO-IGNORE ─────────────────────────────────
 const TIMESTAMP_PATTERNS: RegExp[] = [
-  /^\d{4}-\d{2}-\d{2}(T\d{2}:\d{2}(:\d{2}(\.\d+)?)?(Z|[+-]\d{2}:?\d{2})?)?$/,
+  /^\d{4}-\d{2}-\d(T\d{2}:\d{2}(:\d{2}(\.\d+)?)?(Z|[+-]\d{2}:?\d{2})?)?$/,
   /^\d{10,13}$/,
   /^(Mon|Tue|Wed|Thu|Fri|Sat|Sun),\s/i,

[Timeout] Regex
packages/core/src/index.ts:111:3
 
 // ── TIMESTAMP / DATE PATTERNS TO AUTO-IGNORE ─────────────────────────────────
 const TIMESTAMP_PATTERNS: RegExp[] = [
-  /^\d{4}-\d{2}-\d{2}(T\d{2}:\d{2}(:\d{2}(\.\d+)?)?(Z|[+-]\d{2}:?\d{2})?)?$/,
+  /^\d{4}-\d{2}-\D{2}(T\d{2}:\d{2}(:\d{2}(\.\d+)?)?(Z|[+-]\d{2}:?\d{2})?)?$/,
   /^\d{10,13}$/,
   /^(Mon|Tue|Wed|Thu|Fri|Sat|Sun),\s/i,

[Timeout] Regex
packages/core/src/index.ts:112:3
 // ── TIMESTAMP / DATE PATTERNS TO AUTO-IGNORE ─────────────────────────────────
 const TIMESTAMP_PATTERNS: RegExp[] = [
   /^\d{4}-\d{2}-\d{2}(T\d{2}:\d{2}(:\d{2}(\.\d+)?)?(Z|[+-]\d{2}:?\d{2})?)?$/,
-  /^\d{10,13}$/,
+  /\d{10,13}$/,
   /^(Mon|Tue|Wed|Thu|Fri|Sat|Sun),\s/i,
 ];

[Timeout] Regex
packages/core/src/index.ts:113:3
 const TIMESTAMP_PATTERNS: RegExp[] = [
   /^\d{4}-\d{2}-\d{2}(T\d{2}:\d{2}(:\d{2}(\.\d+)?)?(Z|[+-]\d{2}:?\d{2})?)?$/,
   /^\d{10,13}$/,
-  /^(Mon|Tue|Wed|Thu|Fri|Sat|Sun),\s/i,
+  /^(Mon|Tue|Wed|Thu|Fri|Sat|Sun),\S/i,
 ];
 

[Survived] BlockStatement
packages/core/src/index.ts:116:49
   /^(Mon|Tue|Wed|Thu|Fri|Sat|Sun),\s/i,
 ];
 
-function isTimestampValue(val: string): boolean {
-  return TIMESTAMP_PATTERNS.some((p) => p.test(val.trim()));
-}
+function isTimestampValue(val: string): boolean {}
 
 // ── FRAMEWORK-INTERNAL ATTRIBUTE PREFIXES TO IGNORE ──────────────────────────

[Survived] ArrowFunction
packages/core/src/index.ts:117:34
 ];
 
 function isTimestampValue(val: string): boolean {
-  return TIMESTAMP_PATTERNS.some((p) => p.test(val.trim()));
+  return TIMESTAMP_PATTERNS.some(() => undefined);
 }
 

[Survived] MethodExpression
packages/core/src/index.ts:117:48
 ];
 
 function isTimestampValue(val: string): boolean {
-  return TIMESTAMP_PATTERNS.some((p) => p.test(val.trim()));
+  return TIMESTAMP_PATTERNS.some((p) => p.test(val));
 }
 

[Killed] StringLiteral
packages/core/src/index.ts:122:3
 
 // ── FRAMEWORK-INTERNAL ATTRIBUTE PREFIXES TO IGNORE ──────────────────────────
 const IGNORED_ATTR_PREFIXES = [
-  "data-reactid",
+  "",
   "data-react-",
   "data-v-",
killedBy: detectMismatches (integration) flags an attribute mismatch
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
packages/core/src/index.ts:128:3
   "data-sveltekit-",
   "data-n-",
   "__ng",
-  "ng-version",
+  "",
 ];
 
killedBy: detectMismatches (integration) flags an attribute mismatch
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
packages/core/src/index.ts:131:57
   "ng-version",
 ];
 
-function isFrameworkInternalAttr(name: string): boolean {
-  return IGNORED_ATTR_PREFIXES.some((prefix) => name.startsWith(prefix));
-}
+function isFrameworkInternalAttr(name: string): boolean {}
 
 // ── FUZZY SIMILARITY (Levenshtein-based) ─────────────────────────────────────

[Survived] MethodExpression
packages/core/src/index.ts:132:10
 ];
 
 function isFrameworkInternalAttr(name: string): boolean {
-  return IGNORED_ATTR_PREFIXES.some((prefix) => name.startsWith(prefix));
+  return IGNORED_ATTR_PREFIXES.every(prefix => name.startsWith(prefix));
 }
 

[Survived] ArrowFunction
packages/core/src/index.ts:132:37
 ];
 
 function isFrameworkInternalAttr(name: string): boolean {
-  return IGNORED_ATTR_PREFIXES.some((prefix) => name.startsWith(prefix));
+  return IGNORED_ATTR_PREFIXES.some(() => undefined);
 }
 

[Killed] BlockStatement
packages/core/src/index.ts:136:53
 }
 
 // ── FUZZY SIMILARITY (Levenshtein-based) ─────────────────────────────────────
-function editDistance(a: string, b: string): number {
-  const m = a.length, n = b.length;
-  const dp: number[][] = Array.from({ length: m + 1 }, (_, i) =>
-    Array.from({ length: n + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
-  );
-  for (let i = 1; i <= m; i++)
-    for (let j = 1; j <= n; j++)
-      dp[i][j] = a[i - 1] === b[j - 1]
-        ? dp[i - 1][j - 1]
-        : 1 + Math.min(dp[i - 1][j], dp[i][j - 1], dp[i - 1][j - 1]);
-  return dp[m][n];
-}
+function editDistance(a: string, b: string): number {}
 
 function similarityScore(a: string, b: string): number {
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
packages/core/src/index.ts:138:56
 // ── FUZZY SIMILARITY (Levenshtein-based) ─────────────────────────────────────
 function editDistance(a: string, b: string): number {
   const m = a.length, n = b.length;
-  const dp: number[][] = Array.from({ length: m + 1 }, (_, i) =>
-    Array.from({ length: n + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
+  const dp: number[][] = Array.from({ length: m + 1 }, () => undefined
   );
   for (let i = 1; i <= m; i++)
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArithmeticOperator
packages/core/src/index.ts:138:47
 // ── FUZZY SIMILARITY (Levenshtein-based) ─────────────────────────────────────
 function editDistance(a: string, b: string): number {
   const m = a.length, n = b.length;
-  const dp: number[][] = Array.from({ length: m + 1 }, (_, i) =>
+  const dp: number[][] = Array.from({ length: m - 1 }, (_, i) =>
     Array.from({ length: n + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
   );
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArithmeticOperator
packages/core/src/index.ts:139:26
 function editDistance(a: string, b: string): number {
   const m = a.length, n = b.length;
   const dp: number[][] = Array.from({ length: m + 1 }, (_, i) =>
-    Array.from({ length: n + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
+    Array.from({ length: n - 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
   );
   for (let i = 1; i <= m; i++)
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
packages/core/src/index.ts:139:35
 function editDistance(a: string, b: string): number {
   const m = a.length, n = b.length;
   const dp: number[][] = Array.from({ length: m + 1 }, (_, i) =>
-    Array.from({ length: n + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
+    Array.from({ length: n + 1 }, () => undefined)
   );
   for (let i = 1; i <= m; i++)
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
packages/core/src/index.ts:141:19
   const dp: number[][] = Array.from({ length: m + 1 }, (_, i) =>
     Array.from({ length: n + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
   );
-  for (let i = 1; i <= m; i++)
+  for (let i = 1; i < m; i++)
     for (let j = 1; j <= n; j++)
       dp[i][j] = a[i - 1] === b[j - 1]
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] UpdateOperator
packages/core/src/index.ts:141:27
   const dp: number[][] = Array.from({ length: m + 1 }, (_, i) =>
     Array.from({ length: n + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
   );
-  for (let i = 1; i <= m; i++)
+  for (let i = 1; i <= m; i--)
     for (let j = 1; j <= n; j++)
       dp[i][j] = a[i - 1] === b[j - 1]
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: Cannot read properties of undefined (reading '1')

[Killed] EqualityOperator
packages/core/src/index.ts:142:21
     Array.from({ length: n + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
   );
   for (let i = 1; i <= m; i++)
-    for (let j = 1; j <= n; j++)
+    for (let j = 1; j < n; j++)
       dp[i][j] = a[i - 1] === b[j - 1]
         ? dp[i - 1][j - 1]
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:142:21
     Array.from({ length: n + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
   );
   for (let i = 1; i <= m; i++)
-    for (let j = 1; j <= n; j++)
+    for (let j = 1; false; j++)
       dp[i][j] = a[i - 1] === b[j - 1]
         ? dp[i - 1][j - 1]
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:143:18
   );
   for (let i = 1; i <= m; i++)
     for (let j = 1; j <= n; j++)
-      dp[i][j] = a[i - 1] === b[j - 1]
+      dp[i][j] = true
         ? dp[i - 1][j - 1]
         : 1 + Math.min(dp[i - 1][j], dp[i][j - 1], dp[i - 1][j - 1]);
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
packages/core/src/index.ts:143:18
   );
   for (let i = 1; i <= m; i++)
     for (let j = 1; j <= n; j++)
-      dp[i][j] = a[i - 1] === b[j - 1]
+      dp[i][j] = a[i - 1] !== b[j - 1]
         ? dp[i - 1][j - 1]
         : 1 + Math.min(dp[i - 1][j], dp[i][j - 1], dp[i - 1][j - 1]);
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
packages/core/src/index.ts:144:14
   for (let i = 1; i <= m; i++)
     for (let j = 1; j <= n; j++)
       dp[i][j] = a[i - 1] === b[j - 1]
-        ? dp[i - 1][j - 1]
+        ? dp[i + 1][j - 1]
         : 1 + Math.min(dp[i - 1][j], dp[i][j - 1], dp[i - 1][j - 1]);
   return dp[m][n];
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
packages/core/src/index.ts:144:21
   for (let i = 1; i <= m; i++)
     for (let j = 1; j <= n; j++)
       dp[i][j] = a[i - 1] === b[j - 1]
-        ? dp[i - 1][j - 1]
+        ? dp[i - 1][j + 1]
         : 1 + Math.min(dp[i - 1][j], dp[i][j - 1], dp[i - 1][j - 1]);
   return dp[m][n];

[Killed] ArithmeticOperator
packages/core/src/index.ts:145:11
     for (let j = 1; j <= n; j++)
       dp[i][j] = a[i - 1] === b[j - 1]
         ? dp[i - 1][j - 1]
-        : 1 + Math.min(dp[i - 1][j], dp[i][j - 1], dp[i - 1][j - 1]);
+        : 1 - Math.min(dp[i - 1][j], dp[i][j - 1], dp[i - 1][j - 1]);
   return dp[m][n];
 }
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
packages/core/src/index.ts:145:55
     for (let j = 1; j <= n; j++)
       dp[i][j] = a[i - 1] === b[j - 1]
         ? dp[i - 1][j - 1]
-        : 1 + Math.min(dp[i - 1][j], dp[i][j - 1], dp[i - 1][j - 1]);
+        : 1 + Math.min(dp[i - 1][j], dp[i][j - 1], dp[i + 1][j - 1]);
   return dp[m][n];
 }
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
packages/core/src/index.ts:149:56
   return dp[m][n];
 }
 
-function similarityScore(a: string, b: string): number {
-  if (!a && !b) return 1;
-  if (a.length > 1500 || b.length > 1500) return a === b ? 1 : 0;
-  const maxLen = Math.max(a.length, b.length);
-  if (maxLen === 0) return 1;
-  return 1 - editDistance(a, b) / maxLen;
-}
+function similarityScore(a: string, b: string): number {}
 
 // ── FRAMEWORK DETECTION ───────────────────────────────────────────────────────
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:150:7
 }
 
 function similarityScore(a: string, b: string): number {
-  if (!a && !b) return 1;
+  if (true) return 1;
   if (a.length > 1500 || b.length > 1500) return a === b ? 1 : 0;
   const maxLen = Math.max(a.length, b.length);
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
packages/core/src/index.ts:150:7
 }
 
 function similarityScore(a: string, b: string): number {
-  if (!a && !b) return 1;
+  if (a && !b) return 1;
   if (a.length > 1500 || b.length > 1500) return a === b ? 1 : 0;
   const maxLen = Math.max(a.length, b.length);

[Survived] ConditionalExpression
packages/core/src/index.ts:151:7
 
 function similarityScore(a: string, b: string): number {
   if (!a && !b) return 1;
-  if (a.length > 1500 || b.length > 1500) return a === b ? 1 : 0;
+  if (true) return a === b ? 1 : 0;
   const maxLen = Math.max(a.length, b.length);
   if (maxLen === 0) return 1;

[NoCoverage] ConditionalExpression
packages/core/src/index.ts:151:50
 
 function similarityScore(a: string, b: string): number {
   if (!a && !b) return 1;
-  if (a.length > 1500 || b.length > 1500) return a === b ? 1 : 0;
+  if (a.length > 1500 || b.length > 1500) return false ? 1 : 0;
   const maxLen = Math.max(a.length, b.length);
   if (maxLen === 0) return 1;
