[Survived] MethodExpression
packages/core/src/index.ts:152:18
 function similarityScore(a: string, b: string): number {
   if (!a && !b) return 1;
   if (a.length > 1500 || b.length > 1500) return a === b ? 1 : 0;
-  const maxLen = Math.max(a.length, b.length);
+  const maxLen = Math.min(a.length, b.length);
   if (maxLen === 0) return 1;
   return 1 - editDistance(a, b) / maxLen;

[Killed] EqualityOperator
packages/core/src/index.ts:153:7
   if (!a && !b) return 1;
   if (a.length > 1500 || b.length > 1500) return a === b ? 1 : 0;
   const maxLen = Math.max(a.length, b.length);
-  if (maxLen === 0) return 1;
+  if (maxLen !== 0) return 1;
   return 1 - editDistance(a, b) / maxLen;
 }
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:153:7
   if (!a && !b) return 1;
   if (a.length > 1500 || b.length > 1500) return a === b ? 1 : 0;
   const maxLen = Math.max(a.length, b.length);
-  if (maxLen === 0) return 1;
+  if (true) return 1;
   return 1 - editDistance(a, b) / maxLen;
 }
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
packages/core/src/index.ts:154:10
   if (a.length > 1500 || b.length > 1500) return a === b ? 1 : 0;
   const maxLen = Math.max(a.length, b.length);
   if (maxLen === 0) return 1;
-  return 1 - editDistance(a, b) / maxLen;
+  return 1 + editDistance(a, b) / maxLen;
 }
 
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
packages/core/src/index.ts:154:14
   if (a.length > 1500 || b.length > 1500) return a === b ? 1 : 0;
   const maxLen = Math.max(a.length, b.length);
   if (maxLen === 0) return 1;
-  return 1 - editDistance(a, b) / maxLen;
+  return 1 - editDistance(a, b) * maxLen;
 }
 

[Killed] BlockStatement
packages/core/src/index.ts:158:62
 }
 
 // ── FRAMEWORK DETECTION ───────────────────────────────────────────────────────
-export function getComponentName(el: Element): string | null {
-  if (el.hasAttribute("data-reactroot") || el.closest("[data-reactroot]")) return "ReactComponent";
-  const keys = Object.keys(el as any);
-  if (keys.some((k) => k.startsWith("__reactFiber") || k.startsWith("__reactInternalInstance"))) return "ReactComponent";
-  if ((el as any).__vue_app__ || keys.some((k) => k.startsWith("__vue"))) return "VueComponent";
-  if ((el as any).__ngContext__ || el.hasAttribute("ng-version") || el.closest("[ng-version]")) return "AngularComponent";
-  // Svelte: components leave a __svelte property on the DOM node
-  if (keys.some((k) => k.startsWith("__svelte"))) return "SvelteComponent";
-  // SolidJS: leaves _$owner on reactive nodes
-  if ((el as any)._$owner !== undefined) return "SolidComponent";
-  return null;
-}
+export function getComponentName(el: Element): string | null {}
 
 export function getCssPath(el: Element): string {
killedBy: Heuristics: getComponentName (Framework Detection) should detect React roots
statusReason: expected undefined to be 'ReactComponent' // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:159:7
 
 // ── FRAMEWORK DETECTION ───────────────────────────────────────────────────────
 export function getComponentName(el: Element): string | null {
-  if (el.hasAttribute("data-reactroot") || el.closest("[data-reactroot]")) return "ReactComponent";
+  if (false) return "ReactComponent";
   const keys = Object.keys(el as any);
   if (keys.some((k) => k.startsWith("__reactFiber") || k.startsWith("__reactInternalInstance"))) return "ReactComponent";
killedBy: Heuristics: getComponentName (Framework Detection) should detect React roots
statusReason: expected null to be 'ReactComponent' // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:159:7
 
 // ── FRAMEWORK DETECTION ───────────────────────────────────────────────────────
 export function getComponentName(el: Element): string | null {
-  if (el.hasAttribute("data-reactroot") || el.closest("[data-reactroot]")) return "ReactComponent";
+  if (true) return "ReactComponent";
   const keys = Object.keys(el as any);
   if (keys.some((k) => k.startsWith("__reactFiber") || k.startsWith("__reactInternalInstance"))) return "ReactComponent";
killedBy: Heuristics: getComponentName (Framework Detection) should detect Vue applications
statusReason: expected 'ReactComponent' to be 'VueComponent' // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:161:24
 export function getComponentName(el: Element): string | null {
   if (el.hasAttribute("data-reactroot") || el.closest("[data-reactroot]")) return "ReactComponent";
   const keys = Object.keys(el as any);
-  if (keys.some((k) => k.startsWith("__reactFiber") || k.startsWith("__reactInternalInstance"))) return "ReactComponent";
+  if (keys.some((k) => false)) return "ReactComponent";
   if ((el as any).__vue_app__ || keys.some((k) => k.startsWith("__vue"))) return "VueComponent";
   if ((el as any).__ngContext__ || el.hasAttribute("ng-version") || el.closest("[ng-version]")) return "AngularComponent";
killedBy: Heuristics: getComponentName (Framework Detection) should detect React internal fibers
statusReason: expected null to be 'ReactComponent' // Object.is equality

[Killed] MethodExpression
packages/core/src/index.ts:161:7
 export function getComponentName(el: Element): string | null {
   if (el.hasAttribute("data-reactroot") || el.closest("[data-reactroot]")) return "ReactComponent";
   const keys = Object.keys(el as any);
-  if (keys.some((k) => k.startsWith("__reactFiber") || k.startsWith("__reactInternalInstance"))) return "ReactComponent";
+  if (keys.every(k => k.startsWith("__reactFiber") || k.startsWith("__reactInternalInstance"))) return "ReactComponent";
   if ((el as any).__vue_app__ || keys.some((k) => k.startsWith("__vue"))) return "VueComponent";
   if ((el as any).__ngContext__ || el.hasAttribute("ng-version") || el.closest("[ng-version]")) return "AngularComponent";
killedBy: Heuristics: getComponentName (Framework Detection) should detect Angular contexts
statusReason: expected 'ReactComponent' to be 'AngularComponent' // Object.is equality

[Killed] ArrowFunction
packages/core/src/index.ts:162:44
   if (el.hasAttribute("data-reactroot") || el.closest("[data-reactroot]")) return "ReactComponent";
   const keys = Object.keys(el as any);
   if (keys.some((k) => k.startsWith("__reactFiber") || k.startsWith("__reactInternalInstance"))) return "ReactComponent";
-  if ((el as any).__vue_app__ || keys.some((k) => k.startsWith("__vue"))) return "VueComponent";
+  if ((el as any).__vue_app__ || keys.some(() => undefined)) return "VueComponent";
   if ((el as any).__ngContext__ || el.hasAttribute("ng-version") || el.closest("[ng-version]")) return "AngularComponent";
   // Svelte: components leave a __svelte property on the DOM node
killedBy: Framework detection edge cases detects Vue via __vue prefix on property keys
statusReason: expected null to be 'VueComponent' // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:162:7
   if (el.hasAttribute("data-reactroot") || el.closest("[data-reactroot]")) return "ReactComponent";
   const keys = Object.keys(el as any);
   if (keys.some((k) => k.startsWith("__reactFiber") || k.startsWith("__reactInternalInstance"))) return "ReactComponent";
-  if ((el as any).__vue_app__ || keys.some((k) => k.startsWith("__vue"))) return "VueComponent";
+  if (true) return "VueComponent";
   if ((el as any).__ngContext__ || el.hasAttribute("ng-version") || el.closest("[ng-version]")) return "AngularComponent";
   // Svelte: components leave a __svelte property on the DOM node
killedBy: Heuristics: getComponentName (Framework Detection) should detect Angular contexts
statusReason: expected 'VueComponent' to be 'AngularComponent' // Object.is equality

[Killed] LogicalOperator
packages/core/src/index.ts:163:7
   const keys = Object.keys(el as any);
   if (keys.some((k) => k.startsWith("__reactFiber") || k.startsWith("__reactInternalInstance"))) return "ReactComponent";
   if ((el as any).__vue_app__ || keys.some((k) => k.startsWith("__vue"))) return "VueComponent";
-  if ((el as any).__ngContext__ || el.hasAttribute("ng-version") || el.closest("[ng-version]")) return "AngularComponent";
+  if ((el as any).__ngContext__ && el.hasAttribute("ng-version") || el.closest("[ng-version]")) return "AngularComponent";
   // Svelte: components leave a __svelte property on the DOM node
   if (keys.some((k) => k.startsWith("__svelte"))) return "SvelteComponent";
killedBy: Framework detection edge cases detects Angular via __ngContext__
statusReason: expected null to be 'AngularComponent' // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:163:7
   const keys = Object.keys(el as any);
   if (keys.some((k) => k.startsWith("__reactFiber") || k.startsWith("__reactInternalInstance"))) return "ReactComponent";
   if ((el as any).__vue_app__ || keys.some((k) => k.startsWith("__vue"))) return "VueComponent";
-  if ((el as any).__ngContext__ || el.hasAttribute("ng-version") || el.closest("[ng-version]")) return "AngularComponent";
+  if (false) return "AngularComponent";
   // Svelte: components leave a __svelte property on the DOM node
   if (keys.some((k) => k.startsWith("__svelte"))) return "SvelteComponent";
killedBy: Heuristics: getComponentName (Framework Detection) should detect Angular contexts
statusReason: expected null to be 'AngularComponent' // Object.is equality

[Killed] MethodExpression
packages/core/src/index.ts:165:7
   if ((el as any).__vue_app__ || keys.some((k) => k.startsWith("__vue"))) return "VueComponent";
   if ((el as any).__ngContext__ || el.hasAttribute("ng-version") || el.closest("[ng-version]")) return "AngularComponent";
   // Svelte: components leave a __svelte property on the DOM node
-  if (keys.some((k) => k.startsWith("__svelte"))) return "SvelteComponent";
+  if (keys.every(k => k.startsWith("__svelte"))) return "SvelteComponent";
   // SolidJS: leaves _$owner on reactive nodes
   if ((el as any)._$owner !== undefined) return "SolidComponent";
killedBy: Framework detection edge cases returns null for a plain div with no framework fingerprints
statusReason: expected 'SvelteComponent' to be null

[Killed] ConditionalExpression
packages/core/src/index.ts:165:7
   if ((el as any).__vue_app__ || keys.some((k) => k.startsWith("__vue"))) return "VueComponent";
   if ((el as any).__ngContext__ || el.hasAttribute("ng-version") || el.closest("[ng-version]")) return "AngularComponent";
   // Svelte: components leave a __svelte property on the DOM node
-  if (keys.some((k) => k.startsWith("__svelte"))) return "SvelteComponent";
+  if (true) return "SvelteComponent";
   // SolidJS: leaves _$owner on reactive nodes
   if ((el as any)._$owner !== undefined) return "SolidComponent";
killedBy: Heuristics: getComponentName (Framework Detection) should detect SolidJS components
statusReason: expected 'SvelteComponent' to be 'SolidComponent' // Object.is equality

[Killed] EqualityOperator
packages/core/src/index.ts:167:7
   // Svelte: components leave a __svelte property on the DOM node
   if (keys.some((k) => k.startsWith("__svelte"))) return "SvelteComponent";
   // SolidJS: leaves _$owner on reactive nodes
-  if ((el as any)._$owner !== undefined) return "SolidComponent";
+  if ((el as any)._$owner === undefined) return "SolidComponent";
   return null;
 }
killedBy: Framework detection edge cases detects SolidJS via _$owner
statusReason: expected null to be 'SolidComponent' // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:167:7
   // Svelte: components leave a __svelte property on the DOM node
   if (keys.some((k) => k.startsWith("__svelte"))) return "SvelteComponent";
   // SolidJS: leaves _$owner on reactive nodes
-  if ((el as any)._$owner !== undefined) return "SolidComponent";
+  if (true) return "SolidComponent";
   return null;
 }
killedBy: Heuristics: getComponentName (Framework Detection) should return null for vanilla elements
statusReason: expected 'SolidComponent' to be null

[Survived] BlockStatement
packages/core/src/index.ts:171:49
   return null;
 }
 
-export function getCssPath(el: Element): string {
-  if (el.hasAttribute("data-testid")) return `[data-testid="${el.getAttribute("data-testid")}"]`;
-  if (el.id) return `#${el.id}`;
-  const parent = el.parentElement;
-  if (!parent) return el.tagName.toLowerCase();
-  const siblings = Array.from(parent.children);
-  const index = siblings.indexOf(el) + 1;
-  return `${getCssPath(parent)} > ${el.tagName.toLowerCase()}:nth-child(${index})`;
-}
+export function getCssPath(el: Element): string {}
 
 export function classifyAttributeMismatch(

[Survived] ConditionalExpression
packages/core/src/index.ts:172:7
 }
 
 export function getCssPath(el: Element): string {
-  if (el.hasAttribute("data-testid")) return `[data-testid="${el.getAttribute("data-testid")}"]`;
+  if (false) return `[data-testid="${el.getAttribute("data-testid")}"]`;
   if (el.id) return `#${el.id}`;
   const parent = el.parentElement;

[Survived] ConditionalExpression
packages/core/src/index.ts:172:7
 }
 
 export function getCssPath(el: Element): string {
-  if (el.hasAttribute("data-testid")) return `[data-testid="${el.getAttribute("data-testid")}"]`;
+  if (true) return `[data-testid="${el.getAttribute("data-testid")}"]`;
   if (el.id) return `#${el.id}`;
   const parent = el.parentElement;

[Survived] ConditionalExpression
packages/core/src/index.ts:173:7
 
 export function getCssPath(el: Element): string {
   if (el.hasAttribute("data-testid")) return `[data-testid="${el.getAttribute("data-testid")}"]`;
-  if (el.id) return `#${el.id}`;
+  if (true) return `#${el.id}`;
   const parent = el.parentElement;
   if (!parent) return el.tagName.toLowerCase();

[Survived] ConditionalExpression
packages/core/src/index.ts:173:7
 
 export function getCssPath(el: Element): string {
   if (el.hasAttribute("data-testid")) return `[data-testid="${el.getAttribute("data-testid")}"]`;
-  if (el.id) return `#${el.id}`;
+  if (false) return `#${el.id}`;
   const parent = el.parentElement;
   if (!parent) return el.tagName.toLowerCase();

[Killed] ConditionalExpression
packages/core/src/index.ts:175:7
   if (el.hasAttribute("data-testid")) return `[data-testid="${el.getAttribute("data-testid")}"]`;
   if (el.id) return `#${el.id}`;
   const parent = el.parentElement;
-  if (!parent) return el.tagName.toLowerCase();
+  if (false) return el.tagName.toLowerCase();
   const siblings = Array.from(parent.children);
   const index = siblings.indexOf(el) + 1;
killedBy: detectMismatches (integration) flags an attribute mismatch
statusReason: Cannot read properties of null (reading 'children')

[Survived] MethodExpression
packages/core/src/index.ts:175:23
   if (el.hasAttribute("data-testid")) return `[data-testid="${el.getAttribute("data-testid")}"]`;
   if (el.id) return `#${el.id}`;
   const parent = el.parentElement;
-  if (!parent) return el.tagName.toLowerCase();
+  if (!parent) return el.tagName.toUpperCase();
   const siblings = Array.from(parent.children);
   const index = siblings.indexOf(el) + 1;

[Survived] ArithmeticOperator
packages/core/src/index.ts:177:17
   const parent = el.parentElement;
   if (!parent) return el.tagName.toLowerCase();
   const siblings = Array.from(parent.children);
-  const index = siblings.indexOf(el) + 1;
+  const index = siblings.indexOf(el) - 1;
   return `${getCssPath(parent)} > ${el.tagName.toLowerCase()}:nth-child(${index})`;
 }

[Survived] MethodExpression
packages/core/src/index.ts:178:37
   if (!parent) return el.tagName.toLowerCase();
   const siblings = Array.from(parent.children);
   const index = siblings.indexOf(el) + 1;
-  return `${getCssPath(parent)} > ${el.tagName.toLowerCase()}:nth-child(${index})`;
+  return `${getCssPath(parent)} > ${el.tagName.toUpperCase()}:nth-child(${index})`;
 }
 

[Killed] BlockStatement
packages/core/src/index.ts:185:43
   attrName: string,
   serverVal: string,
   clientVal: string
-): { severity: Severity; reason: string } {
-  for (const { pattern, label } of SECRET_PATTERNS) {
-    if (pattern.test(serverVal) || pattern.test(clientVal)) {
-      return { severity: "security", reason: `Potential ${label} exposed in attribute` };
-    }
-  }
-  if (attrName.startsWith("aria-") || attrName === "role") {
-    return { severity: "critical", reason: "Accessibility attribute mismatch may break screen readers" };
-  }
-  if (attrName === "src" || attrName === "href") {
-    const isCacheBust = /[?&](v|version|hash|t|ts|cb)=/.test(serverVal) || /[?&](v|version|hash|t|ts|cb)=/.test(clientVal);
-    if (isCacheBust) return { severity: "info", reason: "Cache-busting parameter differs (expected)" };
-  }
-  if (isTimestampValue(serverVal) || isTimestampValue(clientVal)) {
-    return { severity: "info", reason: "Timestamp or date value differs between SSR and CSR (expected)" };
-  }
-  return { severity: "warning", reason: `Attribute '${attrName}' differs between SSR and CSR` };
-}
+): { severity: Severity; reason: string } {}
 
 const IGNORED_TAGS = new Set(["script", "style", "noscript", "link"]);
killedBy: Heuristics: classifyAttributeMismatch should detect exposed AWS keys as security severity
statusReason: Cannot read properties of undefined (reading 'severity')

[Killed] BlockStatement
packages/core/src/index.ts:186:53
   serverVal: string,
   clientVal: string
 ): { severity: Severity; reason: string } {
-  for (const { pattern, label } of SECRET_PATTERNS) {
-    if (pattern.test(serverVal) || pattern.test(clientVal)) {
-      return { severity: "security", reason: `Potential ${label} exposed in attribute` };
-    }
-  }
+  for (const { pattern, label } of SECRET_PATTERNS) {}
   if (attrName.startsWith("aria-") || attrName === "role") {
     return { severity: "critical", reason: "Accessibility attribute mismatch may break screen readers" };
killedBy: Heuristics: classifyAttributeMismatch should detect exposed AWS keys as security severity
statusReason: expected 'warning' to be 'security' // Object.is equality

[Killed] BlockStatement
packages/core/src/index.ts:187:61
   clientVal: string
 ): { severity: Severity; reason: string } {
   for (const { pattern, label } of SECRET_PATTERNS) {
-    if (pattern.test(serverVal) || pattern.test(clientVal)) {
-      return { severity: "security", reason: `Potential ${label} exposed in attribute` };
-    }
+    if (pattern.test(serverVal) || pattern.test(clientVal)) {}
   }
   if (attrName.startsWith("aria-") || attrName === "role") {
killedBy: Heuristics: classifyAttributeMismatch should detect exposed AWS keys as security severity
statusReason: expected 'warning' to be 'security' // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:187:9
   clientVal: string
 ): { severity: Severity; reason: string } {
   for (const { pattern, label } of SECRET_PATTERNS) {
-    if (pattern.test(serverVal) || pattern.test(clientVal)) {
+    if (false) {
       return { severity: "security", reason: `Potential ${label} exposed in attribute` };
     }
killedBy: Heuristics: classifyAttributeMismatch should detect exposed AWS keys as security severity
statusReason: expected 'warning' to be 'security' // Object.is equality

[Killed] EqualityOperator
packages/core/src/index.ts:191:39
       return { severity: "security", reason: `Potential ${label} exposed in attribute` };
     }
   }
-  if (attrName.startsWith("aria-") || attrName === "role") {
+  if (attrName.startsWith("aria-") || attrName !== "role") {
     return { severity: "critical", reason: "Accessibility attribute mismatch may break screen readers" };
   }
killedBy: Heuristics: classifyAttributeMismatch should ignore cache-busting timestamps on src attributes (info severity)
statusReason: expected 'critical' to be 'info' // Object.is equality

[Killed] LogicalOperator
packages/core/src/index.ts:191:7
       return { severity: "security", reason: `Potential ${label} exposed in attribute` };
     }
   }
-  if (attrName.startsWith("aria-") || attrName === "role") {
+  if (attrName.startsWith("aria-") && attrName === "role") {
     return { severity: "critical", reason: "Accessibility attribute mismatch may break screen readers" };
   }
killedBy: Heuristics: classifyAttributeMismatch should classify ARIA attribute mismatches as critical
statusReason: expected 'warning' to be 'critical' // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:194:7
   if (attrName.startsWith("aria-") || attrName === "role") {
     return { severity: "critical", reason: "Accessibility attribute mismatch may break screen readers" };
   }
-  if (attrName === "src" || attrName === "href") {
+  if (false) {
     const isCacheBust = /[?&](v|version|hash|t|ts|cb)=/.test(serverVal) || /[?&](v|version|hash|t|ts|cb)=/.test(clientVal);
     if (isCacheBust) return { severity: "info", reason: "Cache-busting parameter differs (expected)" };
killedBy: Heuristics: classifyAttributeMismatch should ignore cache-busting timestamps on src attributes (info severity)
statusReason: expected 'warning' to be 'info' // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:194:7
   if (attrName.startsWith("aria-") || attrName === "role") {
     return { severity: "critical", reason: "Accessibility attribute mismatch may break screen readers" };
   }
-  if (attrName === "src" || attrName === "href") {
+  if (false || attrName === "href") {
     const isCacheBust = /[?&](v|version|hash|t|ts|cb)=/.test(serverVal) || /[?&](v|version|hash|t|ts|cb)=/.test(clientVal);
     if (isCacheBust) return { severity: "info", reason: "Cache-busting parameter differs (expected)" };
killedBy: Heuristics: classifyAttributeMismatch should ignore cache-busting timestamps on src attributes (info severity)
statusReason: expected 'warning' to be 'info' // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:195:25
     return { severity: "critical", reason: "Accessibility attribute mismatch may break screen readers" };
   }
   if (attrName === "src" || attrName === "href") {
-    const isCacheBust = /[?&](v|version|hash|t|ts|cb)=/.test(serverVal) || /[?&](v|version|hash|t|ts|cb)=/.test(clientVal);
+    const isCacheBust = false;
     if (isCacheBust) return { severity: "info", reason: "Cache-busting parameter differs (expected)" };
   }
killedBy: Heuristics: classifyAttributeMismatch should ignore cache-busting timestamps on src attributes (info severity)
statusReason: expected 'warning' to be 'info' // Object.is equality

[Survived] ConditionalExpression
packages/core/src/index.ts:195:25
     return { severity: "critical", reason: "Accessibility attribute mismatch may break screen readers" };
   }
   if (attrName === "src" || attrName === "href") {
-    const isCacheBust = /[?&](v|version|hash|t|ts|cb)=/.test(serverVal) || /[?&](v|version|hash|t|ts|cb)=/.test(clientVal);
+    const isCacheBust = true;
     if (isCacheBust) return { severity: "info", reason: "Cache-busting parameter differs (expected)" };
   }

[Killed] ConditionalExpression
packages/core/src/index.ts:196:9
   }
   if (attrName === "src" || attrName === "href") {
     const isCacheBust = /[?&](v|version|hash|t|ts|cb)=/.test(serverVal) || /[?&](v|version|hash|t|ts|cb)=/.test(clientVal);
-    if (isCacheBust) return { severity: "info", reason: "Cache-busting parameter differs (expected)" };
+    if (false) return { severity: "info", reason: "Cache-busting parameter differs (expected)" };
   }
   if (isTimestampValue(serverVal) || isTimestampValue(clientVal)) {
killedBy: Heuristics: classifyAttributeMismatch should ignore cache-busting timestamps on src attributes (info severity)
statusReason: expected 'warning' to be 'info' // Object.is equality

[Survived] ConditionalExpression
packages/core/src/index.ts:196:9
   }
   if (attrName === "src" || attrName === "href") {
     const isCacheBust = /[?&](v|version|hash|t|ts|cb)=/.test(serverVal) || /[?&](v|version|hash|t|ts|cb)=/.test(clientVal);
-    if (isCacheBust) return { severity: "info", reason: "Cache-busting parameter differs (expected)" };
+    if (true) return { severity: "info", reason: "Cache-busting parameter differs (expected)" };
   }
   if (isTimestampValue(serverVal) || isTimestampValue(clientVal)) {

[Killed] ConditionalExpression
packages/core/src/index.ts:198:7
     const isCacheBust = /[?&](v|version|hash|t|ts|cb)=/.test(serverVal) || /[?&](v|version|hash|t|ts|cb)=/.test(clientVal);
     if (isCacheBust) return { severity: "info", reason: "Cache-busting parameter differs (expected)" };
   }
-  if (isTimestampValue(serverVal) || isTimestampValue(clientVal)) {
+  if (true) {
     return { severity: "info", reason: "Timestamp or date value differs between SSR and CSR (expected)" };
   }
killedBy: Heuristics: classifyAttributeMismatch should classify generic attribute mismatches as warning
statusReason: expected 'info' to be 'warning' // Object.is equality

[Survived] LogicalOperator
packages/core/src/index.ts:198:7
     const isCacheBust = /[?&](v|version|hash|t|ts|cb)=/.test(serverVal) || /[?&](v|version|hash|t|ts|cb)=/.test(clientVal);
     if (isCacheBust) return { severity: "info", reason: "Cache-busting parameter differs (expected)" };
   }
-  if (isTimestampValue(serverVal) || isTimestampValue(clientVal)) {
+  if (isTimestampValue(serverVal) && isTimestampValue(clientVal)) {
     return { severity: "info", reason: "Timestamp or date value differs between SSR and CSR (expected)" };
   }

[NoCoverage] StringLiteral
packages/core/src/index.ts:199:40
     if (isCacheBust) return { severity: "info", reason: "Cache-busting parameter differs (expected)" };
   }
   if (isTimestampValue(serverVal) || isTimestampValue(clientVal)) {
-    return { severity: "info", reason: "Timestamp or date value differs between SSR and CSR (expected)" };
+    return { severity: "info", reason: "" };
   }
   return { severity: "warning", reason: `Attribute '${attrName}' differs between SSR and CSR` };

[Timeout] StringLiteral
packages/core/src/index.ts:204:62
   return { severity: "warning", reason: `Attribute '${attrName}' differs between SSR and CSR` };
 }
 
-const IGNORED_TAGS = new Set(["script", "style", "noscript", "link"]);
+const IGNORED_TAGS = new Set(["script", "style", "noscript", ""]);
 const IGNORED_SRC_PATTERNS = [/_next\/static/, /__webpack/, /chunk\.[a-z0-9]+\.js/];
 

[Killed] BooleanLiteral
packages/core/src/index.ts:217:7
   options: Required<DetectOptions>,
   push: (m: Mismatch) => void
 ): Array<{ serverEl: Element; clientEl: Element | null; depth: number }> {
-  if (!clientEl || depth > options.maxDepth || IGNORED_TAGS.has(serverEl.tagName.toLowerCase())) return [];
+  if (clientEl || depth > options.maxDepth || IGNORED_TAGS.has(serverEl.tagName.toLowerCase())) return [];
 
   const componentName = getComponentName(clientEl);
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:217:7
   options: Required<DetectOptions>,
   push: (m: Mismatch) => void
 ): Array<{ serverEl: Element; clientEl: Element | null; depth: number }> {
-  if (!clientEl || depth > options.maxDepth || IGNORED_TAGS.has(serverEl.tagName.toLowerCase())) return [];
+  if (true) return [];
 
   const componentName = getComponentName(clientEl);
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
packages/core/src/index.ts:222:7
   const componentName = getComponentName(clientEl);
 
   // Text mismatch
-  if (!options.securityOnly) {
+  if (options.securityOnly) {
     const serverText = Array.from(serverEl.childNodes)
       .filter((n) => n.nodeType === Node.TEXT_NODE)
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:222:7
   const componentName = getComponentName(clientEl);
 
   // Text mismatch
-  if (!options.securityOnly) {
+  if (false) {
     const serverText = Array.from(serverEl.childNodes)
       .filter((n) => n.nodeType === Node.TEXT_NODE)
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
packages/core/src/index.ts:223:24
 
   // Text mismatch
   if (!options.securityOnly) {
-    const serverText = Array.from(serverEl.childNodes)
-      .filter((n) => n.nodeType === Node.TEXT_NODE)
+    const serverText = Array.from(serverEl.childNodes)
       .map((n) => n.textContent?.trim() ?? "")
       .join("")

[Survived] MethodExpression
packages/core/src/index.ts:223:24
 
   // Text mismatch
   if (!options.securityOnly) {
-    const serverText = Array.from(serverEl.childNodes)
-      .filter((n) => n.nodeType === Node.TEXT_NODE)
-      .map((n) => n.textContent?.trim() ?? "")
-      .join("")
-      .trim();
+    const serverText = Array.from(serverEl.childNodes).filter(n => n.nodeType === Node.TEXT_NODE).map(n => n.textContent?.trim() ?? "").join("");
     const clientText = Array.from(clientEl.childNodes)
       .filter((n) => n.nodeType === Node.TEXT_NODE)
