[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:8:52
 let currentMismatches: any[] = [];
 
 // ?? Safe DOM text setter (replaces innerHTML to prevent XSS) ?????????????????
-function _setText(el: Element, text: string): void {
-  el.textContent = text;
-}
+function _setText(el: Element, text: string): void {}
 
 function createEl<K extends keyof HTMLElementTagNameMap>(

[NoCoverage] ArrowFunction
extension/src/devtools/panel.ts:33:36
       ? currentMismatches
       : filter === "critical"
         ? currentMismatches.filter((m) => ["critical", "security"].includes(m.severity))
-        : currentMismatches.filter((m) => m.severity === filter);
+        : currentMismatches.filter(() => undefined);
 
   if (filtered.length === 0) {

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:79:48
       },
       "Ignore Selector"
     );
-    ignoreBtn.addEventListener("click", (e) => {
-      const selector = (e.target as HTMLElement).getAttribute("data-selector");
-      chrome.storage.local.get(["ignoredSelectors"], (res) => {
-        const ignored: string[] = (res.ignoredSelectors as string[]) ?? [];
-        if (selector && !ignored.includes(selector)) ignored.push(selector);
-        chrome.storage.local.set({ ignoredSelectors: ignored }, () => {
-          currentMismatches = currentMismatches.filter((m) => m.selector !== selector);
-          renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);
-        });
-      });
-    });
+    ignoreBtn.addEventListener("click", (e) => {});
     card.appendChild(ignoreBtn);
 

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:79:32
       },
       "Ignore Selector"
     );
-    ignoreBtn.addEventListener("click", (e) => {
+    ignoreBtn.addEventListener("", (e) => {
       const selector = (e.target as HTMLElement).getAttribute("data-selector");
       chrome.storage.local.get(["ignoredSelectors"], (res) => {

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:81:63
     );
     ignoreBtn.addEventListener("click", (e) => {
       const selector = (e.target as HTMLElement).getAttribute("data-selector");
-      chrome.storage.local.get(["ignoredSelectors"], (res) => {
-        const ignored: string[] = (res.ignoredSelectors as string[]) ?? [];
-        if (selector && !ignored.includes(selector)) ignored.push(selector);
-        chrome.storage.local.set({ ignoredSelectors: ignored }, () => {
-          currentMismatches = currentMismatches.filter((m) => m.selector !== selector);
-          renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);
-        });
-      });
+      chrome.storage.local.get(["ignoredSelectors"], (res) => {});
     });
     card.appendChild(ignoreBtn);

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:81:33
     );
     ignoreBtn.addEventListener("click", (e) => {
       const selector = (e.target as HTMLElement).getAttribute("data-selector");
-      chrome.storage.local.get(["ignoredSelectors"], (res) => {
+      chrome.storage.local.get([""], (res) => {
         const ignored: string[] = (res.ignoredSelectors as string[]) ?? [];
         if (selector && !ignored.includes(selector)) ignored.push(selector);

[NoCoverage] ArrayDeclaration
extension/src/devtools/panel.ts:82:73
     ignoreBtn.addEventListener("click", (e) => {
       const selector = (e.target as HTMLElement).getAttribute("data-selector");
       chrome.storage.local.get(["ignoredSelectors"], (res) => {
-        const ignored: string[] = (res.ignoredSelectors as string[]) ?? [];
+        const ignored: string[] = (res.ignoredSelectors as string[]) ?? ["Stryker was here"];
         if (selector && !ignored.includes(selector)) ignored.push(selector);
         chrome.storage.local.set({ ignoredSelectors: ignored }, () => {

[NoCoverage] BooleanLiteral
extension/src/devtools/panel.ts:83:25
       const selector = (e.target as HTMLElement).getAttribute("data-selector");
       chrome.storage.local.get(["ignoredSelectors"], (res) => {
         const ignored: string[] = (res.ignoredSelectors as string[]) ?? [];
-        if (selector && !ignored.includes(selector)) ignored.push(selector);
+        if (selector && ignored.includes(selector)) ignored.push(selector);
         chrome.storage.local.set({ ignoredSelectors: ignored }, () => {
           currentMismatches = currentMismatches.filter((m) => m.selector !== selector);

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:83:13
       const selector = (e.target as HTMLElement).getAttribute("data-selector");
       chrome.storage.local.get(["ignoredSelectors"], (res) => {
         const ignored: string[] = (res.ignoredSelectors as string[]) ?? [];
-        if (selector && !ignored.includes(selector)) ignored.push(selector);
+        if (false) ignored.push(selector);
         chrome.storage.local.set({ ignoredSelectors: ignored }, () => {
           currentMismatches = currentMismatches.filter((m) => m.selector !== selector);

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:84:71
       chrome.storage.local.get(["ignoredSelectors"], (res) => {
         const ignored: string[] = (res.ignoredSelectors as string[]) ?? [];
         if (selector && !ignored.includes(selector)) ignored.push(selector);
-        chrome.storage.local.set({ ignoredSelectors: ignored }, () => {
-          currentMismatches = currentMismatches.filter((m) => m.selector !== selector);
-          renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);
-        });
+        chrome.storage.local.set({ ignoredSelectors: ignored }, () => {});
       });
     });

[NoCoverage] MethodExpression
extension/src/devtools/panel.ts:85:31
         const ignored: string[] = (res.ignoredSelectors as string[]) ?? [];
         if (selector && !ignored.includes(selector)) ignored.push(selector);
         chrome.storage.local.set({ ignoredSelectors: ignored }, () => {
-          currentMismatches = currentMismatches.filter((m) => m.selector !== selector);
+          currentMismatches = currentMismatches;
           renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);
         });

[NoCoverage] EqualityOperator
extension/src/devtools/panel.ts:85:63
         const ignored: string[] = (res.ignoredSelectors as string[]) ?? [];
         if (selector && !ignored.includes(selector)) ignored.push(selector);
         chrome.storage.local.set({ ignoredSelectors: ignored }, () => {
-          currentMismatches = currentMismatches.filter((m) => m.selector !== selector);
+          currentMismatches = currentMismatches.filter((m) => m.selector === selector);
           renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);
         });

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:97:47
 }
 
 // ?? Persist & restore results across DevTools open/close ?????????????????????
-function saveResults(mismatches: any[]): void {
-  // chrome.storage.session is cleared when the browser session ends (tab close / browser restart)
-  chrome.storage.session.set({ [STORAGE_KEY]: mismatches });
-}
+function saveResults(mismatches: any[]): void {}
 
 function restoreResults(): void {

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:102:33
   chrome.storage.session.set({ [STORAGE_KEY]: mismatches });
 }
 
-function restoreResults(): void {
-  chrome.storage.session.get([STORAGE_KEY], (res) => {
-    if ((res[STORAGE_KEY] as any[])?.length) {
-      currentMismatches = res[STORAGE_KEY] as any[];
-      renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);
-    }
-  });
-}
+function restoreResults(): void {}
 
 // ?? Message listener ??????????????????????????????????????????????????????????

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:103:54
 }
 
 function restoreResults(): void {
-  chrome.storage.session.get([STORAGE_KEY], (res) => {
-    if ((res[STORAGE_KEY] as any[])?.length) {
-      currentMismatches = res[STORAGE_KEY] as any[];
-      renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);
-    }
-  });
+  chrome.storage.session.get([STORAGE_KEY], (res) => {});
 }
 

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:104:9
 
 function restoreResults(): void {
   chrome.storage.session.get([STORAGE_KEY], (res) => {
-    if ((res[STORAGE_KEY] as any[])?.length) {
+    if (false) {
       currentMismatches = res[STORAGE_KEY] as any[];
       renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:104:9
 
 function restoreResults(): void {
   chrome.storage.session.get([STORAGE_KEY], (res) => {
-    if ((res[STORAGE_KEY] as any[])?.length) {
+    if (true) {
       currentMismatches = res[STORAGE_KEY] as any[];
       renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:112:47
 }
 
 // ?? Message listener ??????????????????????????????????????????????????????????
-chrome.runtime.onMessage.addListener((msg) => {
-  if (msg.type === "HYDRALENS_PROGRESS") {
-    const container = document.getElementById("results")!;
-    container.innerHTML = "";
-    const status = createEl("div", { style: "color:#60a5fa;font-style:italic;" }, msg.payload.status);
-    container.appendChild(status);
-  }
-  if (msg.type === "HYDRALENS_RESULTS") {
-    currentMismatches = msg.payload.mismatches;
-    saveResults(currentMismatches);
-    renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);
-  }
-  if (msg.type === "HYDRALENS_ERROR") {
-    const container = document.getElementById("results")!;
-    container.innerHTML = "";
-    container.appendChild(
-      createEl("div", { style: "color:#ef4444;" }, `Error: ${msg.payload.message}`)
-    );
-  }
-});
+chrome.runtime.onMessage.addListener((msg) => {});
 
 // ?? Toolbar event listeners ???????????????????????????????????????????????????

[NoCoverage] EqualityOperator
extension/src/devtools/panel.ts:113:7
 
 // ?? Message listener ??????????????????????????????????????????????????????????
 chrome.runtime.onMessage.addListener((msg) => {
-  if (msg.type === "HYDRALENS_PROGRESS") {
+  if (msg.type !== "HYDRALENS_PROGRESS") {
     const container = document.getElementById("results")!;
     container.innerHTML = "";

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:113:7
 
 // ?? Message listener ??????????????????????????????????????????????????????????
 chrome.runtime.onMessage.addListener((msg) => {
-  if (msg.type === "HYDRALENS_PROGRESS") {
+  if (false) {
     const container = document.getElementById("results")!;
     container.innerHTML = "";

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:114:47
 // ?? Message listener ??????????????????????????????????????????????????????????
 chrome.runtime.onMessage.addListener((msg) => {
   if (msg.type === "HYDRALENS_PROGRESS") {
-    const container = document.getElementById("results")!;
+    const container = document.getElementById("")!;
     container.innerHTML = "";
     const status = createEl("div", { style: "color:#60a5fa;font-style:italic;" }, msg.payload.status);

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:116:45
   if (msg.type === "HYDRALENS_PROGRESS") {
     const container = document.getElementById("results")!;
     container.innerHTML = "";
-    const status = createEl("div", { style: "color:#60a5fa;font-style:italic;" }, msg.payload.status);
+    const status = createEl("div", { style: "" }, msg.payload.status);
     container.appendChild(status);
   }

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:116:29
   if (msg.type === "HYDRALENS_PROGRESS") {
     const container = document.getElementById("results")!;
     container.innerHTML = "";
-    const status = createEl("div", { style: "color:#60a5fa;font-style:italic;" }, msg.payload.status);
+    const status = createEl("", { style: "color:#60a5fa;font-style:italic;" }, msg.payload.status);
     container.appendChild(status);
   }

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:119:41
     const status = createEl("div", { style: "color:#60a5fa;font-style:italic;" }, msg.payload.status);
     container.appendChild(status);
   }
-  if (msg.type === "HYDRALENS_RESULTS") {
-    currentMismatches = msg.payload.mismatches;
-    saveResults(currentMismatches);
-    renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);
-  }
+  if (msg.type === "HYDRALENS_RESULTS") {}
   if (msg.type === "HYDRALENS_ERROR") {
     const container = document.getElementById("results")!;

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:119:7
     const status = createEl("div", { style: "color:#60a5fa;font-style:italic;" }, msg.payload.status);
     container.appendChild(status);
   }
-  if (msg.type === "HYDRALENS_RESULTS") {
+  if (true) {
     currentMismatches = msg.payload.mismatches;
     saveResults(currentMismatches);

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:124:39
     saveResults(currentMismatches);
     renderResults((document.getElementById("severityFilter") as HTMLSelectElement).value);
   }
-  if (msg.type === "HYDRALENS_ERROR") {
-    const container = document.getElementById("results")!;
-    container.innerHTML = "";
-    container.appendChild(
-      createEl("div", { style: "color:#ef4444;" }, `Error: ${msg.payload.message}`)
-    );
-  }
+  if (msg.type === "HYDRALENS_ERROR") {}
 });
 

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:128:32
     const container = document.getElementById("results")!;
     container.innerHTML = "";
     container.appendChild(
-      createEl("div", { style: "color:#ef4444;" }, `Error: ${msg.payload.message}`)
+      createEl("div", { style: "" }, `Error: ${msg.payload.message}`)
     );
   }

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:128:16
     const container = document.getElementById("results")!;
     container.innerHTML = "";
     container.appendChild(
-      createEl("div", { style: "color:#ef4444;" }, `Error: ${msg.payload.message}`)
+      createEl("", { style: "color:#ef4444;" }, `Error: ${msg.payload.message}`)
     );
   }

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:134:72
 });
 
 // ?? Toolbar event listeners ???????????????????????????????????????????????????
-document.getElementById("refreshBtn")?.addEventListener("click", () => {
-  chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
-    if (tabs[0]?.id) chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });
-  });
-});
+document.getElementById("refreshBtn")?.addEventListener("click", () => {});
 
 document.getElementById("severityFilter")?.addEventListener("change", (e) => {

[NoCoverage] OptionalChaining
extension/src/devtools/panel.ts:134:1
 });
 
 // ?? Toolbar event listeners ???????????????????????????????????????????????????
-document.getElementById("refreshBtn")?.addEventListener("click", () => {
+document.getElementById("refreshBtn").addEventListener("click", () => {
   chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
     if (tabs[0]?.id) chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });

[NoCoverage] BooleanLiteral
extension/src/devtools/panel.ts:135:52
 
 // ?? Toolbar event listeners ???????????????????????????????????????????????????
 document.getElementById("refreshBtn")?.addEventListener("click", () => {
-  chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
+  chrome.tabs.query({ active: true, currentWindow: false }, (tabs) => {
     if (tabs[0]?.id) chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });
   });

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:136:9
 // ?? Toolbar event listeners ???????????????????????????????????????????????????
 document.getElementById("refreshBtn")?.addEventListener("click", () => {
   chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
-    if (tabs[0]?.id) chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });
+    if (true) chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });
   });
 });

[NoCoverage] OptionalChaining
extension/src/devtools/panel.ts:144:1
   renderResults((e.target as HTMLSelectElement).value);
 });
 
-document.getElementById("copyMdBtn")?.addEventListener("click", () => {
+document.getElementById("copyMdBtn").addEventListener("click", () => {
   if (currentMismatches.length === 0) { alert("No results to copy."); return; }
   const lines = ["# HydraLens Report\n", "| Severity | Component | Selector | Reason | Advice |", "|---|---|---|---|---|"];

[NoCoverage] BlockStatement
extension/src/devtools/panel.ts:144:71
   renderResults((e.target as HTMLSelectElement).value);
 });
 
-document.getElementById("copyMdBtn")?.addEventListener("click", () => {
-  if (currentMismatches.length === 0) { alert("No results to copy."); return; }
-  const lines = ["# HydraLens Report\n", "| Severity | Component | Selector | Reason | Advice |", "|---|---|---|---|---|"];
-  for (const m of currentMismatches)
-    lines.push(`| ${m.severity} | ${m.componentName ?? "Unknown"} | \`${m.selector}\` | ${m.severityReason} | ${m.advice} |`);
-  navigator.clipboard.writeText(lines.join("\n")).then(() => alert("Markdown copied to clipboard!"));
-});
+document.getElementById("copyMdBtn")?.addEventListener("click", () => {});
 
 document.getElementById("clearIgnoreBtn")?.addEventListener("click", () => {

[NoCoverage] EqualityOperator
extension/src/devtools/panel.ts:145:7
 });
 
 document.getElementById("copyMdBtn")?.addEventListener("click", () => {
-  if (currentMismatches.length === 0) { alert("No results to copy."); return; }
+  if (currentMismatches.length !== 0) { alert("No results to copy."); return; }
   const lines = ["# HydraLens Report\n", "| Severity | Component | Selector | Reason | Advice |", "|---|---|---|---|---|"];
   for (const m of currentMismatches)

[NoCoverage] ConditionalExpression
extension/src/devtools/panel.ts:145:7
 });
 
 document.getElementById("copyMdBtn")?.addEventListener("click", () => {
-  if (currentMismatches.length === 0) { alert("No results to copy."); return; }
+  if (false) { alert("No results to copy."); return; }
   const lines = ["# HydraLens Report\n", "| Severity | Component | Selector | Reason | Advice |", "|---|---|---|---|---|"];
   for (const m of currentMismatches)

[NoCoverage] LogicalOperator
extension/src/devtools/panel.ts:148:37
   if (currentMismatches.length === 0) { alert("No results to copy."); return; }
   const lines = ["# HydraLens Report\n", "| Severity | Component | Selector | Reason | Advice |", "|---|---|---|---|---|"];
   for (const m of currentMismatches)
-    lines.push(`| ${m.severity} | ${m.componentName ?? "Unknown"} | \`${m.selector}\` | ${m.severityReason} | ${m.advice} |`);
+    lines.push(`| ${m.severity} | ${m.componentName && "Unknown"} | \`${m.selector}\` | ${m.severityReason} | ${m.advice} |`);
   navigator.clipboard.writeText(lines.join("\n")).then(() => alert("Markdown copied to clipboard!"));
 });

[NoCoverage] StringLiteral
extension/src/devtools/panel.ts:148:56
   if (currentMismatches.length === 0) { alert("No results to copy."); return; }
   const lines = ["# HydraLens Report\n", "| Severity | Component | Selector | Reason | Advice |", "|---|---|---|---|---|"];
   for (const m of currentMismatches)
-    lines.push(`| ${m.severity} | ${m.componentName ?? "Unknown"} | \`${m.selector}\` | ${m.severityReason} | ${m.advice} |`);
+    lines.push(`| ${m.severity} | ${m.componentName ?? ""} | \`${m.selector}\` | ${m.severityReason} | ${m.advice} |`);
   navigator.clipboard.writeText(lines.join("\n")).then(() => alert("Markdown copied to clipboard!"));
 });

[NoCoverage] ArrowFunction
extension/src/devtools/panel.ts:149:56
   const lines = ["# HydraLens Report\n", "| Severity | Component | Selector | Reason | Advice |", "|---|---|---|---|---|"];
   for (const m of currentMismatches)
     lines.push(`| ${m.severity} | ${m.componentName ?? "Unknown"} | \`${m.selector}\` | ${m.severityReason} | ${m.advice} |`);
-  navigator.clipboard.writeText(lines.join("\n")).then(() => alert("Markdown copied to clipboard!"));
+  navigator.clipboard.writeText(lines.join("\n")).then(() => undefined);
 });
 
