[Killed] EqualityOperator
packages/core/src/index.ts:224:22
   // Text mismatch
   if (!options.securityOnly) {
     const serverText = Array.from(serverEl.childNodes)
-      .filter((n) => n.nodeType === Node.TEXT_NODE)
+      .filter((n) => n.nodeType !== Node.TEXT_NODE)
       .map((n) => n.textContent?.trim() ?? "")
       .join("")
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:224:22
   // Text mismatch
   if (!options.securityOnly) {
     const serverText = Array.from(serverEl.childNodes)
-      .filter((n) => n.nodeType === Node.TEXT_NODE)
+      .filter((n) => false)
       .map((n) => n.textContent?.trim() ?? "")
       .join("")
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
packages/core/src/index.ts:225:19
   if (!options.securityOnly) {
     const serverText = Array.from(serverEl.childNodes)
       .filter((n) => n.nodeType === Node.TEXT_NODE)
-      .map((n) => n.textContent?.trim() ?? "")
+      .map((n) => n.textContent?.trim() && "")
       .join("")
       .trim();
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
packages/core/src/index.ts:225:12
   if (!options.securityOnly) {
     const serverText = Array.from(serverEl.childNodes)
       .filter((n) => n.nodeType === Node.TEXT_NODE)
-      .map((n) => n.textContent?.trim() ?? "")
+      .map(() => undefined)
       .join("")
       .trim();
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
packages/core/src/index.ts:226:13
     const serverText = Array.from(serverEl.childNodes)
       .filter((n) => n.nodeType === Node.TEXT_NODE)
       .map((n) => n.textContent?.trim() ?? "")
-      .join("")
+      .join("Stryker was here!")
       .trim();
     const clientText = Array.from(clientEl.childNodes)

[Survived] MethodExpression
packages/core/src/index.ts:228:24
       .map((n) => n.textContent?.trim() ?? "")
       .join("")
       .trim();
-    const clientText = Array.from(clientEl.childNodes)
-      .filter((n) => n.nodeType === Node.TEXT_NODE)
-      .map((n) => n.textContent?.trim() ?? "")
-      .join("")
-      .trim();
+    const clientText = Array.from(clientEl.childNodes).filter(n => n.nodeType === Node.TEXT_NODE).map(n => n.textContent?.trim() ?? "").join("");
 
     if (serverText && clientText && serverText !== clientText) {

[Survived] MethodExpression
packages/core/src/index.ts:228:24
       .map((n) => n.textContent?.trim() ?? "")
       .join("")
       .trim();
-    const clientText = Array.from(clientEl.childNodes)
-      .filter((n) => n.nodeType === Node.TEXT_NODE)
+    const clientText = Array.from(clientEl.childNodes)
       .map((n) => n.textContent?.trim() ?? "")
       .join("")

[Killed] EqualityOperator
packages/core/src/index.ts:229:22
       .join("")
       .trim();
     const clientText = Array.from(clientEl.childNodes)
-      .filter((n) => n.nodeType === Node.TEXT_NODE)
+      .filter((n) => n.nodeType !== Node.TEXT_NODE)
       .map((n) => n.textContent?.trim() ?? "")
       .join("")
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:229:22
       .join("")
       .trim();
     const clientText = Array.from(clientEl.childNodes)
-      .filter((n) => n.nodeType === Node.TEXT_NODE)
+      .filter((n) => false)
       .map((n) => n.textContent?.trim() ?? "")
       .join("")
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
packages/core/src/index.ts:234:37
       .join("")
       .trim();
 
-    if (serverText && clientText && serverText !== clientText) {
+    if (serverText && clientText && serverText === clientText) {
       const score = similarityScore(serverText, clientText);
       if (score < options.similarityThreshold) {
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
packages/core/src/index.ts:234:64
       .join("")
       .trim();
 
-    if (serverText && clientText && serverText !== clientText) {
-      const score = similarityScore(serverText, clientText);
-      if (score < options.similarityThreshold) {
-        const fix = getFix(componentName, "Text content mismatch");
-        push({
-          selector: getCssPath(clientEl),
-          serverText,
-          clientText,
-          severity: "critical",
-          severityReason: "Text content mismatch",
-          componentName,
-          advice: fix.advice,
-          fixSnippet: fix.snippet,
-          similarityScore: Math.round(score * 100) / 100,
-        });
-      }
-    }
+    if (serverText && clientText && serverText !== clientText) {}
   }
 
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
packages/core/src/index.ts:236:48
 
     if (serverText && clientText && serverText !== clientText) {
       const score = similarityScore(serverText, clientText);
-      if (score < options.similarityThreshold) {
-        const fix = getFix(componentName, "Text content mismatch");
-        push({
-          selector: getCssPath(clientEl),
-          serverText,
-          clientText,
-          severity: "critical",
-          severityReason: "Text content mismatch",
-          componentName,
-          advice: fix.advice,
-          fixSnippet: fix.snippet,
-          similarityScore: Math.round(score * 100) / 100,
-        });
-      }
+      if (score < options.similarityThreshold) {}
     }
   }
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
packages/core/src/index.ts:236:11
 
     if (serverText && clientText && serverText !== clientText) {
       const score = similarityScore(serverText, clientText);
-      if (score < options.similarityThreshold) {
+      if (score >= options.similarityThreshold) {
         const fix = getFix(componentName, "Text content mismatch");
         push({
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
packages/core/src/index.ts:237:43
     if (serverText && clientText && serverText !== clientText) {
       const score = similarityScore(serverText, clientText);
       if (score < options.similarityThreshold) {
-        const fix = getFix(componentName, "Text content mismatch");
+        const fix = getFix(componentName, "");
         push({
           selector: getCssPath(clientEl),

[Survived] ArithmeticOperator
packages/core/src/index.ts:247:28
           componentName,
           advice: fix.advice,
           fixSnippet: fix.snippet,
-          similarityScore: Math.round(score * 100) / 100,
+          similarityScore: Math.round(score * 100) * 100,
         });
       }

[Survived] ArithmeticOperator
packages/core/src/index.ts:247:39
           componentName,
           advice: fix.advice,
           fixSnippet: fix.snippet,
-          similarityScore: Math.round(score * 100) / 100,
+          similarityScore: Math.round(score / 100) / 100,
         });
       }

[Killed] BlockStatement
packages/core/src/index.ts:254:55
   }
 
   // Attribute mismatches
-  for (const attr of Array.from(serverEl.attributes)) {
-    const serverVal = attr.value;
-    const clientVal = clientEl.getAttribute(attr.name);
-    if (clientVal === null || serverVal === clientVal) continue;
-    if (isFrameworkInternalAttr(attr.name)) continue;
-    if (attr.name === "src" && IGNORED_SRC_PATTERNS.some((p) => p.test(serverVal))) continue;
-
-    const { severity, reason } = classifyAttributeMismatch(attr.name, serverVal, clientVal);
-    if (options.securityOnly && severity !== "security") continue;
-
-    const fix = getFix(componentName, reason);
-    push({
-      selector: getCssPath(clientEl),
-      serverText: "",
-      clientText: "",
-      serverAttrValue: serverVal,
-      attributeName: attr.name,
-      severity,
-      severityReason: reason,
-      componentName,
-      advice: fix.advice,
-      fixSnippet: fix.snippet,
-    });
-  }
+  for (const attr of Array.from(serverEl.attributes)) {}
 
   // Return children in forward order (consistent left-to-right DFS for both sync & async)
killedBy: detectMismatches (integration) flags an attribute mismatch
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:257:31
   for (const attr of Array.from(serverEl.attributes)) {
     const serverVal = attr.value;
     const clientVal = clientEl.getAttribute(attr.name);
-    if (clientVal === null || serverVal === clientVal) continue;
+    if (clientVal === null || false) continue;
     if (isFrameworkInternalAttr(attr.name)) continue;
     if (attr.name === "src" && IGNORED_SRC_PATTERNS.some((p) => p.test(serverVal))) continue;
killedBy: detectMismatches (integration) does not flag identical content
statusReason: expected 1 to be +0 // Object.is equality

[Killed] LogicalOperator
packages/core/src/index.ts:257:9
   for (const attr of Array.from(serverEl.attributes)) {
     const serverVal = attr.value;
     const clientVal = clientEl.getAttribute(attr.name);
-    if (clientVal === null || serverVal === clientVal) continue;
+    if (clientVal === null && serverVal === clientVal) continue;
     if (isFrameworkInternalAttr(attr.name)) continue;
     if (attr.name === "src" && IGNORED_SRC_PATTERNS.some((p) => p.test(serverVal))) continue;
killedBy: detectMismatches (integration) does not flag identical content
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:258:9
     const serverVal = attr.value;
     const clientVal = clientEl.getAttribute(attr.name);
     if (clientVal === null || serverVal === clientVal) continue;
-    if (isFrameworkInternalAttr(attr.name)) continue;
+    if (true) continue;
     if (attr.name === "src" && IGNORED_SRC_PATTERNS.some((p) => p.test(serverVal))) continue;
 
killedBy: detectMismatches (integration) flags an attribute mismatch
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
packages/core/src/index.ts:258:9
     const serverVal = attr.value;
     const clientVal = clientEl.getAttribute(attr.name);
     if (clientVal === null || serverVal === clientVal) continue;
-    if (isFrameworkInternalAttr(attr.name)) continue;
+    if (false) continue;
     if (attr.name === "src" && IGNORED_SRC_PATTERNS.some((p) => p.test(serverVal))) continue;
 

[Killed] ConditionalExpression
packages/core/src/index.ts:259:9
     const clientVal = clientEl.getAttribute(attr.name);
     if (clientVal === null || serverVal === clientVal) continue;
     if (isFrameworkInternalAttr(attr.name)) continue;
-    if (attr.name === "src" && IGNORED_SRC_PATTERNS.some((p) => p.test(serverVal))) continue;
+    if (true) continue;
 
     const { severity, reason } = classifyAttributeMismatch(attr.name, serverVal, clientVal);
killedBy: detectMismatches (integration) flags an attribute mismatch
statusReason: expected false to be true // Object.is equality

[Survived] LogicalOperator
packages/core/src/index.ts:259:9
     const clientVal = clientEl.getAttribute(attr.name);
     if (clientVal === null || serverVal === clientVal) continue;
     if (isFrameworkInternalAttr(attr.name)) continue;
-    if (attr.name === "src" && IGNORED_SRC_PATTERNS.some((p) => p.test(serverVal))) continue;
+    if (attr.name === "src" || IGNORED_SRC_PATTERNS.some(p => p.test(serverVal))) continue;
 
     const { severity, reason } = classifyAttributeMismatch(attr.name, serverVal, clientVal);

[Killed] LogicalOperator
packages/core/src/index.ts:262:9
     if (attr.name === "src" && IGNORED_SRC_PATTERNS.some((p) => p.test(serverVal))) continue;
 
     const { severity, reason } = classifyAttributeMismatch(attr.name, serverVal, clientVal);
-    if (options.securityOnly && severity !== "security") continue;
+    if (options.securityOnly || severity !== "security") continue;
 
     const fix = getFix(componentName, reason);
killedBy: detectMismatches (integration) flags an attribute mismatch
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
packages/core/src/index.ts:262:33
     if (attr.name === "src" && IGNORED_SRC_PATTERNS.some((p) => p.test(serverVal))) continue;
 
     const { severity, reason } = classifyAttributeMismatch(attr.name, serverVal, clientVal);
-    if (options.securityOnly && severity !== "security") continue;
+    if (options.securityOnly && severity === "security") continue;
 
     const fix = getFix(componentName, reason);
killedBy: detectMismatches (integration) respects securityOnly option — skips non-security findings
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArrowFunction
packages/core/src/index.ts:282:29
   // Return children in forward order (consistent left-to-right DFS for both sync & async)
   const serverChildren = Array.from(serverEl.children);
   const clientChildren = Array.from(clientEl.children);
-  return serverChildren.map((sc, i) => ({ serverEl: sc, clientEl: clientChildren[i] ?? null, depth: depth + 1 }));
+  return serverChildren.map(() => undefined);
 }
 
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: Cannot read properties of undefined (reading 'serverEl')

[Killed] LogicalOperator
packages/core/src/index.ts:282:67
   // Return children in forward order (consistent left-to-right DFS for both sync & async)
   const serverChildren = Array.from(serverEl.children);
   const clientChildren = Array.from(clientEl.children);
-  return serverChildren.map((sc, i) => ({ serverEl: sc, clientEl: clientChildren[i] ?? null, depth: depth + 1 }));
+  return serverChildren.map((sc, i) => ({ serverEl: sc, clientEl: clientChildren[i] && null, depth: depth + 1 }));
 }
 
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
packages/core/src/index.ts:290:15
   serverHTML: string,
   clientDoc: Document,
   options: DetectOptions = {}
-): Mismatch[] {
-  const opts: Required<DetectOptions> = {
-    maxDepth: options.maxDepth ?? Infinity,
-    similarityThreshold: options.similarityThreshold ?? 0.6,
-    securityOnly: options.securityOnly ?? false,
-  };
-
-  const parser = new DOMParser();
-  const serverDoc = parser.parseFromString(serverHTML, "text/html");
-  const mismatches: Mismatch[] = [];
-
-  function walk(serverEl: Element, clientEl: Element | null, depth: number) {
-    const children = processNode(serverEl, clientEl, depth, opts, (m) => mismatches.push(m));
-    for (const child of children) walk(child.serverEl, child.clientEl, child.depth);
-  }
-
-  walk(serverDoc.documentElement, clientDoc.documentElement, 0);
-  return mismatches;
-}
+): Mismatch[] {}
 
 // ── ASYNC YIELDING DETECTOR ───────────────────────────────────────────────────
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: Cannot read properties of undefined (reading 'some')

[Survived] LogicalOperator
packages/core/src/index.ts:292:15
   options: DetectOptions = {}
 ): Mismatch[] {
   const opts: Required<DetectOptions> = {
-    maxDepth: options.maxDepth ?? Infinity,
+    maxDepth: options.maxDepth && Infinity,
     similarityThreshold: options.similarityThreshold ?? 0.6,
     securityOnly: options.securityOnly ?? false,

[Killed] LogicalOperator
packages/core/src/index.ts:293:26
 ): Mismatch[] {
   const opts: Required<DetectOptions> = {
     maxDepth: options.maxDepth ?? Infinity,
-    similarityThreshold: options.similarityThreshold ?? 0.6,
+    similarityThreshold: options.similarityThreshold && 0.6,
     securityOnly: options.securityOnly ?? false,
   };
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
packages/core/src/index.ts:294:19
   const opts: Required<DetectOptions> = {
     maxDepth: options.maxDepth ?? Infinity,
     similarityThreshold: options.similarityThreshold ?? 0.6,
-    securityOnly: options.securityOnly ?? false,
+    securityOnly: options.securityOnly && false,
   };
 
killedBy: detectMismatches (integration) respects securityOnly option — skips non-security findings
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
packages/core/src/index.ts:294:43
   const opts: Required<DetectOptions> = {
     maxDepth: options.maxDepth ?? Infinity,
     similarityThreshold: options.similarityThreshold ?? 0.6,
-    securityOnly: options.securityOnly ?? false,
+    securityOnly: options.securityOnly ?? true,
   };
 
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
packages/core/src/index.ts:298:56
   };
 
   const parser = new DOMParser();
-  const serverDoc = parser.parseFromString(serverHTML, "text/html");
+  const serverDoc = parser.parseFromString(serverHTML, "");
   const mismatches: Mismatch[] = [];
 
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: Failed to execute 'parseFromString' on 'DOMParser': parameter 2 '' is not a valid enumeration value for SupportedType

[Killed] BlockStatement
packages/core/src/index.ts:301:77
   const serverDoc = parser.parseFromString(serverHTML, "text/html");
   const mismatches: Mismatch[] = [];
 
-  function walk(serverEl: Element, clientEl: Element | null, depth: number) {
-    const children = processNode(serverEl, clientEl, depth, opts, (m) => mismatches.push(m));
-    for (const child of children) walk(child.serverEl, child.clientEl, child.depth);
-  }
+  function walk(serverEl: Element, clientEl: Element | null, depth: number) {}
 
   walk(serverDoc.documentElement, clientDoc.documentElement, 0);
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
packages/core/src/index.ts:302:67
   const mismatches: Mismatch[] = [];
 
   function walk(serverEl: Element, clientEl: Element | null, depth: number) {
-    const children = processNode(serverEl, clientEl, depth, opts, (m) => mismatches.push(m));
+    const children = processNode(serverEl, clientEl, depth, opts, () => undefined);
     for (const child of children) walk(child.serverEl, child.clientEl, child.depth);
   }
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
packages/core/src/index.ts:316:41
   clientDoc: Document,
   options: DetectOptions = {}
 ): Promise<Mismatch[]> {
-  const opts: Required<DetectOptions> = {
-    maxDepth: options.maxDepth ?? Infinity,
-    similarityThreshold: options.similarityThreshold ?? 0.6,
-    securityOnly: options.securityOnly ?? false,
-  };
+  const opts: Required<DetectOptions> = {};
 
   const parser = new DOMParser();
killedBy: detectMismatches (integration) sync and async detectors return the same results in the same order
statusReason: expected [ …(3) ] to deeply equal [ Array(1) ]

[Killed] ArrayDeclaration
packages/core/src/index.ts:324:34
 
   const parser = new DOMParser();
   const serverDoc = parser.parseFromString(serverHTML, "text/html");
-  const mismatches: Mismatch[] = [];
+  const mismatches: Mismatch[] = ["Stryker was here"];
 
   // Stack stores work items; children are pushed in reverse so pop() gives left-to-right order
killedBy: detectMismatches (integration) sync and async detectors return the same results in the same order
statusReason: expected [ …(3) ] to deeply equal [ undefined, …(3) ]

[Survived] ArithmeticOperator
packages/core/src/index.ts:335:9
 
   while (stack.length > 0) {
     // Yield before processing each node so the threshold applies per-node, not per-batch
-    if (performance.now() - lastYield > 15) {
+    if (performance.now() + lastYield > 15) {
       await new Promise<void>((r) => setTimeout(r, 0));
       lastYield = performance.now();

[Survived] EqualityOperator
packages/core/src/index.ts:335:9
 
   while (stack.length > 0) {
     // Yield before processing each node so the threshold applies per-node, not per-batch
-    if (performance.now() - lastYield > 15) {
+    if (performance.now() - lastYield >= 15) {
       await new Promise<void>((r) => setTimeout(r, 0));
       lastYield = performance.now();

[NoCoverage] ArrowFunction
packages/core/src/index.ts:336:31
   while (stack.length > 0) {
     // Yield before processing each node so the threshold applies per-node, not per-batch
     if (performance.now() - lastYield > 15) {
-      await new Promise<void>((r) => setTimeout(r, 0));
+      await new Promise<void>(() => undefined);
       lastYield = performance.now();
     }

[Killed] ArrowFunction
packages/core/src/index.ts:341:91
     }
 
     const current = stack.pop()!;
-    const children = processNode(current.serverEl, current.clientEl, current.depth, opts, (m) =>
-      mismatches.push(m)
+    const children = processNode(current.serverEl, current.clientEl, current.depth, opts, () => undefined
     );
 
killedBy: detectMismatches (integration) sync and async detectors return the same results in the same order
statusReason: expected [ …(3) ] to deeply equal []

[Killed] EqualityOperator
packages/core/src/index.ts:346:39
     );
 
     // Push in reverse so that stack.pop() processes left-to-right (same order as sync walk)
-    for (let i = children.length - 1; i >= 0; i--) {
+    for (let i = children.length - 1; i > 0; i--) {
       stack.push(children[i]);
     }
killedBy: detectMismatches (integration) sync and async detectors return the same results in the same order
statusReason: expected [ …(3) ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
packages/core/src/index.ts:346:39
     );
 
     // Push in reverse so that stack.pop() processes left-to-right (same order as sync walk)
-    for (let i = children.length - 1; i >= 0; i--) {
+    for (let i = children.length - 1; false; i--) {
       stack.push(children[i]);
     }
killedBy: detectMismatches (integration) sync and async detectors return the same results in the same order
statusReason: expected [ …(3) ] to deeply equal []
