[NoCoverage] EqualityOperator
packages/core/src/test-setup.ts:2:35
 // Polyfill CSS.escape which jsdom doesn't implement
-if (typeof CSS === 'undefined' || typeof CSS.escape === 'undefined') {
+if (typeof CSS === 'undefined' || typeof CSS.escape !== 'undefined') {
   // @ts-expect-error - polyfilling missing jsdom global
   globalThis.CSS = {

[NoCoverage] EqualityOperator
packages/core/src/test-setup.ts:2:5
 // Polyfill CSS.escape which jsdom doesn't implement
-if (typeof CSS === 'undefined' || typeof CSS.escape === 'undefined') {
+if (typeof CSS !== 'undefined' || typeof CSS.escape === 'undefined') {
   // @ts-expect-error - polyfilling missing jsdom global
   globalThis.CSS = {

[NoCoverage] ArrowFunction
packages/core/src/test-setup.ts:5:13
 if (typeof CSS === 'undefined' || typeof CSS.escape === 'undefined') {
   // @ts-expect-error - polyfilling missing jsdom global
   globalThis.CSS = {
-    escape: (value: string) =>
-      value.replace(/([^\w-])/g, '\\$1'),
+    escape: () => undefined,
   };
 }

[NoCoverage] Regex
packages/core/src/test-setup.ts:6:21
   // @ts-expect-error - polyfilling missing jsdom global
   globalThis.CSS = {
     escape: (value: string) =>
-      value.replace(/([^\w-])/g, '\\$1'),
+      value.replace(/([\w-])/g, '\\$1'),
   };
 }
