[NoCoverage] StringLiteral
extension/src/devtools/devtools.ts:2:3
 chrome.devtools.panels.create(
-  "HydraLens",
+  "",
   "/icon16.png",
   "/src/devtools/panel.html",

[NoCoverage] StringLiteral
extension/src/devtools/devtools.ts:4:3
 chrome.devtools.panels.create(
   "HydraLens",
   "/icon16.png",
-  "/src/devtools/panel.html",
+  "",
   (panel) => { console.log("HydraLens panel created."); }
 );

[NoCoverage] BlockStatement
extension/src/devtools/devtools.ts:5:14
   "HydraLens",
   "/icon16.png",
   "/src/devtools/panel.html",
-  (panel) => { console.log("HydraLens panel created."); }
+  (panel) => {}
 );
 
