[NoCoverage] BlockStatement
extension/src/popup/popup.ts:3:49
 const toggle = document.getElementById("autoScanToggle") as HTMLInputElement;
 
-chrome.storage.local.get(["autoScan"], (res) => {
-  toggle.checked = res.autoScan !== false;
-});
+chrome.storage.local.get(["autoScan"], (res) => {});
 
 toggle.addEventListener("change", (e) => {

[NoCoverage] StringLiteral
extension/src/popup/popup.ts:3:27
 const toggle = document.getElementById("autoScanToggle") as HTMLInputElement;
 
-chrome.storage.local.get(["autoScan"], (res) => {
+chrome.storage.local.get([""], (res) => {
   toggle.checked = res.autoScan !== false;
 });

[NoCoverage] EqualityOperator
extension/src/popup/popup.ts:4:20
 const toggle = document.getElementById("autoScanToggle") as HTMLInputElement;
 
 chrome.storage.local.get(["autoScan"], (res) => {
-  toggle.checked = res.autoScan !== false;
+  toggle.checked = res.autoScan === false;
 });
 

[NoCoverage] ConditionalExpression
extension/src/popup/popup.ts:4:20
 const toggle = document.getElementById("autoScanToggle") as HTMLInputElement;
 
 chrome.storage.local.get(["autoScan"], (res) => {
-  toggle.checked = res.autoScan !== false;
+  toggle.checked = true;
 });
 

[NoCoverage] BlockStatement
extension/src/popup/popup.ts:7:42
   toggle.checked = res.autoScan !== false;
 });
 
-toggle.addEventListener("change", (e) => {
-  const enabled = (e.target as HTMLInputElement).checked;
-  chrome.runtime.sendMessage({ type: "HYDRALENS_SET_AUTOSCAN", enabled });
-});
+toggle.addEventListener("change", (e) => {});
 
 document.getElementById("scanNowBtn")?.addEventListener("click", () => {

[NoCoverage] StringLiteral
extension/src/popup/popup.ts:7:25
   toggle.checked = res.autoScan !== false;
 });
 
-toggle.addEventListener("change", (e) => {
+toggle.addEventListener("", (e) => {
   const enabled = (e.target as HTMLInputElement).checked;
   chrome.runtime.sendMessage({ type: "HYDRALENS_SET_AUTOSCAN", enabled });

[NoCoverage] StringLiteral
extension/src/popup/popup.ts:9:38
 
 toggle.addEventListener("change", (e) => {
   const enabled = (e.target as HTMLInputElement).checked;
-  chrome.runtime.sendMessage({ type: "HYDRALENS_SET_AUTOSCAN", enabled });
+  chrome.runtime.sendMessage({ type: "", enabled });
 });
 

[NoCoverage] OptionalChaining
extension/src/popup/popup.ts:12:1
   chrome.runtime.sendMessage({ type: "HYDRALENS_SET_AUTOSCAN", enabled });
 });
 
-document.getElementById("scanNowBtn")?.addEventListener("click", () => {
+document.getElementById("scanNowBtn").addEventListener("click", () => {
   chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
     if (tabs[0]?.id) {

[NoCoverage] BlockStatement
extension/src/popup/popup.ts:12:72
   chrome.runtime.sendMessage({ type: "HYDRALENS_SET_AUTOSCAN", enabled });
 });
 
-document.getElementById("scanNowBtn")?.addEventListener("click", () => {
-  chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
-    if (tabs[0]?.id) {
-      chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });
-      window.close();
-    }
-  });
-});
+document.getElementById("scanNowBtn")?.addEventListener("click", () => {});
 

[NoCoverage] BooleanLiteral
extension/src/popup/popup.ts:13:52
 });
 
 document.getElementById("scanNowBtn")?.addEventListener("click", () => {
-  chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
+  chrome.tabs.query({ active: true, currentWindow: false }, (tabs) => {
     if (tabs[0]?.id) {
       chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });

[NoCoverage] BooleanLiteral
extension/src/popup/popup.ts:13:31
 });
 
 document.getElementById("scanNowBtn")?.addEventListener("click", () => {
-  chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
+  chrome.tabs.query({ active: false, currentWindow: true }, (tabs) => {
     if (tabs[0]?.id) {
       chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });

[NoCoverage] ConditionalExpression
extension/src/popup/popup.ts:14:9
 
 document.getElementById("scanNowBtn")?.addEventListener("click", () => {
   chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
-    if (tabs[0]?.id) {
+    if (false) {
       chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });
       window.close();

[NoCoverage] BlockStatement
extension/src/popup/popup.ts:14:22
 
 document.getElementById("scanNowBtn")?.addEventListener("click", () => {
   chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
-    if (tabs[0]?.id) {
-      chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });
-      window.close();
-    }
+    if (tabs[0]?.id) {}
   });
 });

[NoCoverage] StringLiteral
extension/src/popup/popup.ts:15:51
 document.getElementById("scanNowBtn")?.addEventListener("click", () => {
   chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
     if (tabs[0]?.id) {
-      chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });
+      chrome.tabs.sendMessage(tabs[0].id, { type: "" });
       window.close();
     }
