[NoCoverage] StringLiteral
extension/src/scripts/background.ts:1:14
-﻿console.log("[HydraLens] Background worker started.");
+﻿console.log("");
 
 function shouldAutoScan(): Promise<boolean> {

[NoCoverage] BlockStatement
extension/src/scripts/background.ts:3:45
 ﻿console.log("[HydraLens] Background worker started.");
 
-function shouldAutoScan(): Promise<boolean> {
-  return new Promise((resolve) => {
-    chrome.storage.local.get(["autoScan"], (res) => resolve(res.autoScan !== false));
-  });
-}
+function shouldAutoScan(): Promise<boolean> {}
 
 // SPA navigations

[NoCoverage] BlockStatement
extension/src/scripts/background.ts:4:35
 ﻿console.log("[HydraLens] Background worker started.");
 
 function shouldAutoScan(): Promise<boolean> {
-  return new Promise((resolve) => {
-    chrome.storage.local.get(["autoScan"], (res) => resolve(res.autoScan !== false));
-  });
+  return new Promise((resolve) => {});
 }
 

[NoCoverage] ArrowFunction
extension/src/scripts/background.ts:5:44
 
 function shouldAutoScan(): Promise<boolean> {
   return new Promise((resolve) => {
-    chrome.storage.local.get(["autoScan"], (res) => resolve(res.autoScan !== false));
+    chrome.storage.local.get(["autoScan"], () => undefined);
   });
 }

[NoCoverage] EqualityOperator
extension/src/scripts/background.ts:5:61
 
 function shouldAutoScan(): Promise<boolean> {
   return new Promise((resolve) => {
-    chrome.storage.local.get(["autoScan"], (res) => resolve(res.autoScan !== false));
+    chrome.storage.local.get(["autoScan"], (res) => resolve(res.autoScan === false));
   });
 }

[NoCoverage] BlockStatement
extension/src/scripts/background.ts:10:75
 }
 
 // SPA navigations
-chrome.webNavigation.onHistoryStateUpdated.addListener(async (details) => {
-  if (!(await shouldAutoScan())) return;
-  setTimeout(() => {
-    chrome.tabs.sendMessage(details.tabId, { type: "HYDRALENS_RUN" }).catch(() => {});
-  }, 1000);
-});
+chrome.webNavigation.onHistoryStateUpdated.addListener(async (details) => {});
 
 // Full page loads (main frame only)

[NoCoverage] BooleanLiteral
extension/src/scripts/background.ts:11:7
 
 // SPA navigations
 chrome.webNavigation.onHistoryStateUpdated.addListener(async (details) => {
-  if (!(await shouldAutoScan())) return;
+  if (await shouldAutoScan()) return;
   setTimeout(() => {
     chrome.tabs.sendMessage(details.tabId, { type: "HYDRALENS_RUN" }).catch(() => {});

[NoCoverage] ConditionalExpression
extension/src/scripts/background.ts:11:7
 
 // SPA navigations
 chrome.webNavigation.onHistoryStateUpdated.addListener(async (details) => {
-  if (!(await shouldAutoScan())) return;
+  if (false) return;
   setTimeout(() => {
     chrome.tabs.sendMessage(details.tabId, { type: "HYDRALENS_RUN" }).catch(() => {});

[NoCoverage] BlockStatement
extension/src/scripts/background.ts:12:20
 // SPA navigations
 chrome.webNavigation.onHistoryStateUpdated.addListener(async (details) => {
   if (!(await shouldAutoScan())) return;
-  setTimeout(() => {
-    chrome.tabs.sendMessage(details.tabId, { type: "HYDRALENS_RUN" }).catch(() => {});
-  }, 1000);
+  setTimeout(() => {}, 1000);
 });
 

[NoCoverage] ObjectLiteral
extension/src/scripts/background.ts:13:44
 chrome.webNavigation.onHistoryStateUpdated.addListener(async (details) => {
   if (!(await shouldAutoScan())) return;
   setTimeout(() => {
-    chrome.tabs.sendMessage(details.tabId, { type: "HYDRALENS_RUN" }).catch(() => {});
+    chrome.tabs.sendMessage(details.tabId, {}).catch(() => {});
   }, 1000);
 });

[NoCoverage] StringLiteral
extension/src/scripts/background.ts:13:52
 chrome.webNavigation.onHistoryStateUpdated.addListener(async (details) => {
   if (!(await shouldAutoScan())) return;
   setTimeout(() => {
-    chrome.tabs.sendMessage(details.tabId, { type: "HYDRALENS_RUN" }).catch(() => {});
+    chrome.tabs.sendMessage(details.tabId, { type: "" }).catch(() => {});
   }, 1000);
 });

[NoCoverage] BlockStatement
extension/src/scripts/background.ts:18:65
 });
 
 // Full page loads (main frame only)
-chrome.webNavigation.onCompleted.addListener(async (details) => {
-  if (details.frameId !== 0) return;
-  if (!(await shouldAutoScan())) return;
-  setTimeout(() => {
-    chrome.tabs.sendMessage(details.tabId, { type: "HYDRALENS_RUN" }).catch(() => {});
-  }, 1500);
-});
+chrome.webNavigation.onCompleted.addListener(async (details) => {});
 
 // Q: keyboard shortcut (Alt+Shift+H defined in manifest commands)

[NoCoverage] EqualityOperator
extension/src/scripts/background.ts:19:7
 
 // Full page loads (main frame only)
 chrome.webNavigation.onCompleted.addListener(async (details) => {
-  if (details.frameId !== 0) return;
+  if (details.frameId === 0) return;
   if (!(await shouldAutoScan())) return;
   setTimeout(() => {

[NoCoverage] ConditionalExpression
extension/src/scripts/background.ts:19:7
 
 // Full page loads (main frame only)
 chrome.webNavigation.onCompleted.addListener(async (details) => {
-  if (details.frameId !== 0) return;
+  if (true) return;
   if (!(await shouldAutoScan())) return;
   setTimeout(() => {

[NoCoverage] BooleanLiteral
extension/src/scripts/background.ts:20:7
 // Full page loads (main frame only)
 chrome.webNavigation.onCompleted.addListener(async (details) => {
   if (details.frameId !== 0) return;
-  if (!(await shouldAutoScan())) return;
+  if (await shouldAutoScan()) return;
   setTimeout(() => {
     chrome.tabs.sendMessage(details.tabId, { type: "HYDRALENS_RUN" }).catch(() => {});

[NoCoverage] ConditionalExpression
extension/src/scripts/background.ts:20:7
 // Full page loads (main frame only)
 chrome.webNavigation.onCompleted.addListener(async (details) => {
   if (details.frameId !== 0) return;
-  if (!(await shouldAutoScan())) return;
+  if (false) return;
   setTimeout(() => {
     chrome.tabs.sendMessage(details.tabId, { type: "HYDRALENS_RUN" }).catch(() => {});

[NoCoverage] BlockStatement
extension/src/scripts/background.ts:21:20
 chrome.webNavigation.onCompleted.addListener(async (details) => {
   if (details.frameId !== 0) return;
   if (!(await shouldAutoScan())) return;
-  setTimeout(() => {
-    chrome.tabs.sendMessage(details.tabId, { type: "HYDRALENS_RUN" }).catch(() => {});
-  }, 1500);
+  setTimeout(() => {}, 1500);
 });
 

[NoCoverage] BlockStatement
extension/src/scripts/background.ts:27:52
 });
 
 // Q: keyboard shortcut (Alt+Shift+H defined in manifest commands)
-chrome.commands.onCommand.addListener((command) => {
-  if (command === "trigger-scan") {
-    chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
-      const tabId = tabs[0]?.id;
-      if (tabId) chrome.tabs.sendMessage(tabId, { type: "HYDRALENS_RUN" }).catch(() => {});
-    });
-  }
-});
+chrome.commands.onCommand.addListener((command) => {});
 
 // Auto-scan toggle message from popup

[NoCoverage] BlockStatement
extension/src/scripts/background.ts:28:35
 
 // Q: keyboard shortcut (Alt+Shift+H defined in manifest commands)
 chrome.commands.onCommand.addListener((command) => {
-  if (command === "trigger-scan") {
-    chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
-      const tabId = tabs[0]?.id;
-      if (tabId) chrome.tabs.sendMessage(tabId, { type: "HYDRALENS_RUN" }).catch(() => {});
-    });
-  }
+  if (command === "trigger-scan") {}
 });
 

[NoCoverage] ConditionalExpression
extension/src/scripts/background.ts:28:7
 
 // Q: keyboard shortcut (Alt+Shift+H defined in manifest commands)
 chrome.commands.onCommand.addListener((command) => {
-  if (command === "trigger-scan") {
+  if (false) {
     chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
       const tabId = tabs[0]?.id;

[NoCoverage] BooleanLiteral
extension/src/scripts/background.ts:29:33
 // Q: keyboard shortcut (Alt+Shift+H defined in manifest commands)
 chrome.commands.onCommand.addListener((command) => {
   if (command === "trigger-scan") {
-    chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
+    chrome.tabs.query({ active: false, currentWindow: true }, (tabs) => {
       const tabId = tabs[0]?.id;
       if (tabId) chrome.tabs.sendMessage(tabId, { type: "HYDRALENS_RUN" }).catch(() => {});

[NoCoverage] BlockStatement
extension/src/scripts/background.ts:29:72
 // Q: keyboard shortcut (Alt+Shift+H defined in manifest commands)
 chrome.commands.onCommand.addListener((command) => {
   if (command === "trigger-scan") {
-    chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
-      const tabId = tabs[0]?.id;
-      if (tabId) chrome.tabs.sendMessage(tabId, { type: "HYDRALENS_RUN" }).catch(() => {});
-    });
+    chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {});
   }
 });

[NoCoverage] OptionalChaining
extension/src/scripts/background.ts:30:21
 chrome.commands.onCommand.addListener((command) => {
   if (command === "trigger-scan") {
     chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
-      const tabId = tabs[0]?.id;
+      const tabId = tabs[0].id;
       if (tabId) chrome.tabs.sendMessage(tabId, { type: "HYDRALENS_RUN" }).catch(() => {});
     });

[NoCoverage] ConditionalExpression
extension/src/scripts/background.ts:31:11
   if (command === "trigger-scan") {
     chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
       const tabId = tabs[0]?.id;
-      if (tabId) chrome.tabs.sendMessage(tabId, { type: "HYDRALENS_RUN" }).catch(() => {});
+      if (false) chrome.tabs.sendMessage(tabId, { type: "HYDRALENS_RUN" }).catch(() => {});
     });
   }

[NoCoverage] ConditionalExpression
extension/src/scripts/background.ts:31:11
   if (command === "trigger-scan") {
     chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
       const tabId = tabs[0]?.id;
-      if (tabId) chrome.tabs.sendMessage(tabId, { type: "HYDRALENS_RUN" }).catch(() => {});
+      if (true) chrome.tabs.sendMessage(tabId, { type: "HYDRALENS_RUN" }).catch(() => {});
     });
   }

[NoCoverage] BlockStatement
extension/src/scripts/background.ts:37:47
 });
 
 // Auto-scan toggle message from popup
-chrome.runtime.onMessage.addListener((msg) => {
-  if (msg.type === "HYDRALENS_SET_AUTOSCAN") {
-    chrome.storage.local.set({ autoScan: msg.enabled });
-  }
-});
+chrome.runtime.onMessage.addListener((msg) => {});
 

[NoCoverage] EqualityOperator
extension/src/scripts/background.ts:38:7
 
 // Auto-scan toggle message from popup
 chrome.runtime.onMessage.addListener((msg) => {
-  if (msg.type === "HYDRALENS_SET_AUTOSCAN") {
+  if (msg.type !== "HYDRALENS_SET_AUTOSCAN") {
     chrome.storage.local.set({ autoScan: msg.enabled });
   }

[NoCoverage] ConditionalExpression
extension/src/scripts/background.ts:38:7
 
 // Auto-scan toggle message from popup
 chrome.runtime.onMessage.addListener((msg) => {
-  if (msg.type === "HYDRALENS_SET_AUTOSCAN") {
+  if (true) {
     chrome.storage.local.set({ autoScan: msg.enabled });
   }
