[NoCoverage] BlockStatement
extension/src/scripts/content.ts:7:38
 const HOST_ID = "hydra-lens-host";
 let shadowRoot: ShadowRoot | null = null;
 
-function getShadowRoot(): ShadowRoot {
-  // FIX: always re-use an existing host+shadow instead of creating a duplicate
-  let host = document.getElementById(HOST_ID) as HTMLElement | null;
-  if (host) {
-    if (!shadowRoot) {
-      // Host exists but our module-level reference was lost (e.g. after a soft nav).
-      // shadowRoot on the host is permanent once attached, so we can recover it.
-      shadowRoot = host.shadowRoot;
-    }
-    return shadowRoot as ShadowRoot;
-  }
-  host = document.createElement("div");
-  host.id = HOST_ID;
-  host.style.cssText =
-    "position:fixed;top:0;left:0;width:0;height:0;z-index:2147483647;pointer-events:none;";
-  document.documentElement.appendChild(host);
-  shadowRoot = host.attachShadow({ mode: "open" });
-  return shadowRoot;
-}
+function getShadowRoot(): ShadowRoot {}
 
 // ── OVERLAY STATE ─────────────────────────────────────────────────────────────

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:10:7
 function getShadowRoot(): ShadowRoot {
   // FIX: always re-use an existing host+shadow instead of creating a duplicate
   let host = document.getElementById(HOST_ID) as HTMLElement | null;
-  if (host) {
+  if (true) {
     if (!shadowRoot) {
       // Host exists but our module-level reference was lost (e.g. after a soft nav).

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:10:7
 function getShadowRoot(): ShadowRoot {
   // FIX: always re-use an existing host+shadow instead of creating a duplicate
   let host = document.getElementById(HOST_ID) as HTMLElement | null;
-  if (host) {
+  if (false) {
     if (!shadowRoot) {
       // Host exists but our module-level reference was lost (e.g. after a soft nav).

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:11:9
   // FIX: always re-use an existing host+shadow instead of creating a duplicate
   let host = document.getElementById(HOST_ID) as HTMLElement | null;
   if (host) {
-    if (!shadowRoot) {
+    if (false) {
       // Host exists but our module-level reference was lost (e.g. after a soft nav).
       // shadowRoot on the host is permanent once attached, so we can recover it.

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:11:9
   // FIX: always re-use an existing host+shadow instead of creating a duplicate
   let host = document.getElementById(HOST_ID) as HTMLElement | null;
   if (host) {
-    if (!shadowRoot) {
+    if (true) {
       // Host exists but our module-level reference was lost (e.g. after a soft nav).
       // shadowRoot on the host is permanent once attached, so we can recover it.

[NoCoverage] StringLiteral
extension/src/scripts/content.ts:21:5
   host = document.createElement("div");
   host.id = HOST_ID;
   host.style.cssText =
-    "position:fixed;top:0;left:0;width:0;height:0;z-index:2147483647;pointer-events:none;";
+    "";
   document.documentElement.appendChild(host);
   shadowRoot = host.attachShadow({ mode: "open" });

[NoCoverage] StringLiteral
extension/src/scripts/content.ts:23:42
   host.style.cssText =
     "position:fixed;top:0;left:0;width:0;height:0;z-index:2147483647;pointer-events:none;";
   document.documentElement.appendChild(host);
-  shadowRoot = host.attachShadow({ mode: "open" });
+  shadowRoot = host.attachShadow({ mode: "" });
   return shadowRoot;
 }

[NoCoverage] ArrayDeclaration
extension/src/scripts/content.ts:29:43
 
 // ── OVERLAY STATE ─────────────────────────────────────────────────────────────
 const overlayElements: HTMLElement[] = [];
-const resizeObservers: ResizeObserver[] = [];
+const resizeObservers: ResizeObserver[] = ["Stryker was here"];
 // FIX: keep references to scroll/resize handlers so we can remove them on clear
 type ReposHandler = () => void;

[NoCoverage] BooleanLiteral
extension/src/scripts/content.ts:36:18
 
 // FIX: isScanning is set to true only inside the try block so a pre-try throw
 //      never permanently locks the extension
-let isScanning = false;
+let isScanning = true;
 
 function clearOverlays(): void {

[NoCoverage] BlockStatement
extension/src/scripts/content.ts:38:32
 //      never permanently locks the extension
 let isScanning = false;
 
-function clearOverlays(): void {
-  // Remove per-overlay window listeners before clearing elements
-  for (const { scroll, resize } of windowListeners) {
-    window.removeEventListener("scroll", scroll);
-    window.removeEventListener("resize", resize);
-  }
-  windowListeners.length = 0;
-
-  overlayElements.forEach((el) => el.remove());
-  overlayElements.length = 0;
-
-  resizeObservers.forEach((ro) => ro.disconnect());
-  resizeObservers.length = 0;
-
-  const host = document.getElementById(HOST_ID);
-  if (host) host.remove();
-  shadowRoot = null;
-}
+function clearOverlays(): void {}
 
 const SEVERITY_STYLE: Record<Severity, { border: string; bg: string; label: string }> = {

[NoCoverage] BlockStatement
extension/src/scripts/content.ts:40:53
 
 function clearOverlays(): void {
   // Remove per-overlay window listeners before clearing elements
-  for (const { scroll, resize } of windowListeners) {
-    window.removeEventListener("scroll", scroll);
-    window.removeEventListener("resize", resize);
-  }
+  for (const { scroll, resize } of windowListeners) {}
   windowListeners.length = 0;
 

[NoCoverage] StringLiteral
extension/src/scripts/content.ts:41:32
 function clearOverlays(): void {
   // Remove per-overlay window listeners before clearing elements
   for (const { scroll, resize } of windowListeners) {
-    window.removeEventListener("scroll", scroll);
+    window.removeEventListener("", scroll);
     window.removeEventListener("resize", resize);
   }

[NoCoverage] StringLiteral
extension/src/scripts/content.ts:42:32
   // Remove per-overlay window listeners before clearing elements
   for (const { scroll, resize } of windowListeners) {
     window.removeEventListener("scroll", scroll);
-    window.removeEventListener("resize", resize);
+    window.removeEventListener("", resize);
   }
   windowListeners.length = 0;

[NoCoverage] ArrowFunction
extension/src/scripts/content.ts:46:27
   }
   windowListeners.length = 0;
 
-  overlayElements.forEach((el) => el.remove());
+  overlayElements.forEach(() => undefined);
   overlayElements.length = 0;
 

[NoCoverage] ArrowFunction
extension/src/scripts/content.ts:49:27
   overlayElements.forEach((el) => el.remove());
   overlayElements.length = 0;
 
-  resizeObservers.forEach((ro) => ro.disconnect());
+  resizeObservers.forEach(() => undefined);
   resizeObservers.length = 0;
 

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:53:7
   resizeObservers.length = 0;
 
   const host = document.getElementById(HOST_ID);
-  if (host) host.remove();
+  if (true) host.remove();
   shadowRoot = null;
 }

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:53:7
   resizeObservers.length = 0;
 
   const host = document.getElementById(HOST_ID);
-  if (host) host.remove();
+  if (false) host.remove();
   shadowRoot = null;
 }

[NoCoverage] StringLiteral
extension/src/scripts/content.ts:58:70
 }
 
 const SEVERITY_STYLE: Record<Severity, { border: string; bg: string; label: string }> = {
-  security: { border: "#ef4444", bg: "rgba(239,68,68,0.20)",  label: "SECURITY" },
+  security: { border: "#ef4444", bg: "rgba(239,68,68,0.20)",  label: "" },
   critical: { border: "#f97316", bg: "rgba(249,115,22,0.15)", label: "CRITICAL" },
   warning:  { border: "#eab308", bg: "rgba(234,179,8,0.15)",  label: "WARNING"  },

[NoCoverage] ObjectLiteral
extension/src/scripts/content.ts:59:13
 
 const SEVERITY_STYLE: Record<Severity, { border: string; bg: string; label: string }> = {
   security: { border: "#ef4444", bg: "rgba(239,68,68,0.20)",  label: "SECURITY" },
-  critical: { border: "#f97316", bg: "rgba(249,115,22,0.15)", label: "CRITICAL" },
+  critical: {},
   warning:  { border: "#eab308", bg: "rgba(234,179,8,0.15)",  label: "WARNING"  },
   info:     { border: "#3b82f6", bg: "rgba(59,130,246,0.15)", label: "INFO"     },

[NoCoverage] StringLiteral
extension/src/scripts/content.ts:60:38
 const SEVERITY_STYLE: Record<Severity, { border: string; bg: string; label: string }> = {
   security: { border: "#ef4444", bg: "rgba(239,68,68,0.20)",  label: "SECURITY" },
   critical: { border: "#f97316", bg: "rgba(249,115,22,0.15)", label: "CRITICAL" },
-  warning:  { border: "#eab308", bg: "rgba(234,179,8,0.15)",  label: "WARNING"  },
+  warning:  { border: "#eab308", bg: "",  label: "WARNING"  },
   info:     { border: "#3b82f6", bg: "rgba(59,130,246,0.15)", label: "INFO"     },
 };

[NoCoverage] ObjectLiteral
extension/src/scripts/content.ts:61:13
   security: { border: "#ef4444", bg: "rgba(239,68,68,0.20)",  label: "SECURITY" },
   critical: { border: "#f97316", bg: "rgba(249,115,22,0.15)", label: "CRITICAL" },
   warning:  { border: "#eab308", bg: "rgba(234,179,8,0.15)",  label: "WARNING"  },
-  info:     { border: "#3b82f6", bg: "rgba(59,130,246,0.15)", label: "INFO"     },
+  info:     {},
 };
 

[NoCoverage] StringLiteral
extension/src/scripts/content.ts:68:42
   const root = getShadowRoot();
   const style = SEVERITY_STYLE[mismatch.severity];
 
-  const overlay = document.createElement("div");
+  const overlay = document.createElement("");
   overlay.style.cssText = `
     position:fixed;pointer-events:none;

[NoCoverage] StringLiteral
extension/src/scripts/content.ts:69:27
   const style = SEVERITY_STYLE[mismatch.severity];
 
   const overlay = document.createElement("div");
-  overlay.style.cssText = `
-    position:fixed;pointer-events:none;
-    border:2px dashed ${style.border};background:${style.bg};
-    box-sizing:border-box;transition:top 0.1s,left 0.1s,width 0.1s,height 0.1s;
-  `;
+  overlay.style.cssText = ``;
 
   const tooltip = document.createElement("div");

[NoCoverage] StringLiteral
extension/src/scripts/content.ts:75:42
     box-sizing:border-box;transition:top 0.1s,left 0.1s,width 0.1s,height 0.1s;
   `;
 
-  const tooltip = document.createElement("div");
+  const tooltip = document.createElement("");
   tooltip.style.cssText = `
     position:absolute;bottom:calc(100% + 4px);left:0;

[NoCoverage] LogicalOperator
extension/src/scripts/content.ts:82:46
     font-size:11px;font-family:monospace;white-space:nowrap;
     border-left:3px solid ${style.border};border-radius:0 3px 3px 0;
   `;
-  tooltip.textContent = `[${style.label}] <${mismatch.componentName || "element"}>`;
+  tooltip.textContent = `[${style.label}] <${mismatch.componentName && "element"}>`;
   overlay.appendChild(tooltip);
   root.appendChild(overlay);

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:82:46
     font-size:11px;font-family:monospace;white-space:nowrap;
     border-left:3px solid ${style.border};border-radius:0 3px 3px 0;
   `;
-  tooltip.textContent = `[${style.label}] <${mismatch.componentName || "element"}>`;
+  tooltip.textContent = `[${style.label}] <${true}>`;
   overlay.appendChild(tooltip);
   root.appendChild(overlay);

[NoCoverage] BlockStatement
extension/src/scripts/content.ts:87:31
   root.appendChild(overlay);
   overlayElements.push(overlay);
 
-  function reposition(): void {
-    const rect = element.getBoundingClientRect();
-    overlay.style.top    = `${rect.top    - 2}px`;
-    overlay.style.left   = `${rect.left   - 2}px`;
-    overlay.style.width  = `${rect.width  + 4}px`;
-    overlay.style.height = `${rect.height + 4}px`;
-  }
+  function reposition(): void {}
   reposition();
 

[NoCoverage] ArithmeticOperator
extension/src/scripts/content.ts:89:31
 
   function reposition(): void {
     const rect = element.getBoundingClientRect();
-    overlay.style.top    = `${rect.top    - 2}px`;
+    overlay.style.top    = `${rect.top + 2}px`;
     overlay.style.left   = `${rect.left   - 2}px`;
     overlay.style.width  = `${rect.width  + 4}px`;

[NoCoverage] ArithmeticOperator
extension/src/scripts/content.ts:90:31
   function reposition(): void {
     const rect = element.getBoundingClientRect();
     overlay.style.top    = `${rect.top    - 2}px`;
-    overlay.style.left   = `${rect.left   - 2}px`;
+    overlay.style.left   = `${rect.left + 2}px`;
     overlay.style.width  = `${rect.width  + 4}px`;
     overlay.style.height = `${rect.height + 4}px`;

[NoCoverage] ArithmeticOperator
extension/src/scripts/content.ts:91:31
     const rect = element.getBoundingClientRect();
     overlay.style.top    = `${rect.top    - 2}px`;
     overlay.style.left   = `${rect.left   - 2}px`;
-    overlay.style.width  = `${rect.width  + 4}px`;
+    overlay.style.width  = `${rect.width - 4}px`;
     overlay.style.height = `${rect.height + 4}px`;
   }

[NoCoverage] ArithmeticOperator
extension/src/scripts/content.ts:92:31
     overlay.style.top    = `${rect.top    - 2}px`;
     overlay.style.left   = `${rect.left   - 2}px`;
     overlay.style.width  = `${rect.width  + 4}px`;
-    overlay.style.height = `${rect.height + 4}px`;
+    overlay.style.height = `${rect.height - 4}px`;
   }
   reposition();

[NoCoverage] BooleanLiteral
extension/src/scripts/content.ts:97:60
   reposition();
 
   // FIX: store handler references so clearOverlays() can remove them
-  window.addEventListener("scroll", reposition, { passive: true });
+  window.addEventListener("scroll", reposition, { passive: false });
   window.addEventListener("resize", reposition, { passive: true });
   windowListeners.push({ scroll: reposition, resize: reposition });

[NoCoverage] StringLiteral
extension/src/scripts/content.ts:97:27
   reposition();
 
   // FIX: store handler references so clearOverlays() can remove them
-  window.addEventListener("scroll", reposition, { passive: true });
+  window.addEventListener("", reposition, { passive: true });
   window.addEventListener("resize", reposition, { passive: true });
   windowListeners.push({ scroll: reposition, resize: reposition });

[NoCoverage] BooleanLiteral
extension/src/scripts/content.ts:98:60
 
   // FIX: store handler references so clearOverlays() can remove them
   window.addEventListener("scroll", reposition, { passive: true });
-  window.addEventListener("resize", reposition, { passive: true });
+  window.addEventListener("resize", reposition, { passive: false });
   windowListeners.push({ scroll: reposition, resize: reposition });
 

[NoCoverage] ObjectLiteral
extension/src/scripts/content.ts:98:49
 
   // FIX: store handler references so clearOverlays() can remove them
   window.addEventListener("scroll", reposition, { passive: true });
-  window.addEventListener("resize", reposition, { passive: true });
+  window.addEventListener("resize", reposition, {});
   windowListeners.push({ scroll: reposition, resize: reposition });
 

[NoCoverage] BlockStatement
extension/src/scripts/content.ts:108:19
 
 async function runHydraLens(): Promise<void> {
   // FIX: guard is checked before any async work; flag is set only after clearOverlays succeeds
-  if (isScanning) {
-    console.log("[HydraLens] Scan already in progress.");
-    return;
-  }
+  if (isScanning) {}
 
   clearOverlays(); // synchronous — if this throws, isScanning stays false (correct)

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:108:7
 
 async function runHydraLens(): Promise<void> {
   // FIX: guard is checked before any async work; flag is set only after clearOverlays succeeds
-  if (isScanning) {
+  if (false) {
     console.log("[HydraLens] Scan already in progress.");
     return;

[NoCoverage] BooleanLiteral
extension/src/scripts/content.ts:114:16
   }
 
   clearOverlays(); // synchronous — if this throws, isScanning stays false (correct)
-  isScanning = true;
+  isScanning = false;
 
   const controller = new AbortController();

[NoCoverage] ArrowFunction
extension/src/scripts/content.ts:117:33
   isScanning = true;
 
   const controller = new AbortController();
-  const timeoutId  = setTimeout(() => controller.abort(), 6000);
+  const timeoutId  = setTimeout(() => undefined, 6000);
 
   try {

[NoCoverage] ArrowFunction
extension/src/scripts/content.ts:127:23
     const serverHTML = await response.text();
     clearTimeout(timeoutId);
 
-    await new Promise((resolve) => setTimeout(resolve, 800));
+    await new Promise(() => undefined);
 
     const allMismatches = await detectMismatchesAsync(serverHTML, document);

[NoCoverage] BlockStatement
extension/src/scripts/content.ts:131:61
 
     const allMismatches = await detectMismatchesAsync(serverHTML, document);
 
-    chrome.storage.local.get(["ignoredSelectors"], (res) => {
-      const ignored: string[] = res.ignoredSelectors ?? [];
-      const activeMismatches  = allMismatches.filter((m) => !ignored.includes(m.selector));
-
-      chrome.runtime.sendMessage({
-        type: "HYDRALENS_RESULTS",
-        payload: { mismatches: activeMismatches, totalFound: allMismatches.length },
-      }).catch(() => {});
-
-      activeMismatches.forEach((mismatch) => {
-        const clientEl = document.querySelector(mismatch.selector) as HTMLElement | null;
-        if (clientEl) drawOverlay(clientEl, mismatch);
-      });
-    });
+    chrome.storage.local.get(["ignoredSelectors"], (res) => {});
   } catch (error: any) {
     const message =

[NoCoverage] ArrayDeclaration
extension/src/scripts/content.ts:131:30
 
     const allMismatches = await detectMismatchesAsync(serverHTML, document);
 
-    chrome.storage.local.get(["ignoredSelectors"], (res) => {
+    chrome.storage.local.get([], (res) => {
       const ignored: string[] = res.ignoredSelectors ?? [];
       const activeMismatches  = allMismatches.filter((m) => !ignored.includes(m.selector));

[NoCoverage] LogicalOperator
extension/src/scripts/content.ts:132:33
     const allMismatches = await detectMismatchesAsync(serverHTML, document);
 
     chrome.storage.local.get(["ignoredSelectors"], (res) => {
-      const ignored: string[] = res.ignoredSelectors ?? [];
+      const ignored: string[] = res.ignoredSelectors && [];
       const activeMismatches  = allMismatches.filter((m) => !ignored.includes(m.selector));
 

[NoCoverage] ArrowFunction
extension/src/scripts/content.ts:133:54
 
     chrome.storage.local.get(["ignoredSelectors"], (res) => {
       const ignored: string[] = res.ignoredSelectors ?? [];
-      const activeMismatches  = allMismatches.filter((m) => !ignored.includes(m.selector));
+      const activeMismatches  = allMismatches.filter(() => undefined);
 
       chrome.runtime.sendMessage({

[NoCoverage] BooleanLiteral
extension/src/scripts/content.ts:133:61
 
     chrome.storage.local.get(["ignoredSelectors"], (res) => {
       const ignored: string[] = res.ignoredSelectors ?? [];
-      const activeMismatches  = allMismatches.filter((m) => !ignored.includes(m.selector));
+      const activeMismatches  = allMismatches.filter((m) => ignored.includes(m.selector));
 
       chrome.runtime.sendMessage({

[NoCoverage] ObjectLiteral
extension/src/scripts/content.ts:135:34
       const ignored: string[] = res.ignoredSelectors ?? [];
       const activeMismatches  = allMismatches.filter((m) => !ignored.includes(m.selector));
 
-      chrome.runtime.sendMessage({
-        type: "HYDRALENS_RESULTS",
-        payload: { mismatches: activeMismatches, totalFound: allMismatches.length },
-      }).catch(() => {});
+      chrome.runtime.sendMessage({}).catch(() => {});
 
       activeMismatches.forEach((mismatch) => {

[NoCoverage] ObjectLiteral
extension/src/scripts/content.ts:137:18
 
       chrome.runtime.sendMessage({
         type: "HYDRALENS_RESULTS",
-        payload: { mismatches: activeMismatches, totalFound: allMismatches.length },
+        payload: {},
       }).catch(() => {});
 

[NoCoverage] BlockStatement
extension/src/scripts/content.ts:140:46
         payload: { mismatches: activeMismatches, totalFound: allMismatches.length },
       }).catch(() => {});
 
-      activeMismatches.forEach((mismatch) => {
-        const clientEl = document.querySelector(mismatch.selector) as HTMLElement | null;
-        if (clientEl) drawOverlay(clientEl, mismatch);
-      });
+      activeMismatches.forEach((mismatch) => {});
     });
   } catch (error: any) {

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:142:13
 
       activeMismatches.forEach((mismatch) => {
         const clientEl = document.querySelector(mismatch.selector) as HTMLElement | null;
-        if (clientEl) drawOverlay(clientEl, mismatch);
+        if (false) drawOverlay(clientEl, mismatch);
       });
     });

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:142:13
 
       activeMismatches.forEach((mismatch) => {
         const clientEl = document.querySelector(mismatch.selector) as HTMLElement | null;
-        if (clientEl) drawOverlay(clientEl, mismatch);
+        if (true) drawOverlay(clientEl, mismatch);
       });
     });

[NoCoverage] BlockStatement
extension/src/scripts/content.ts:145:24
         if (clientEl) drawOverlay(clientEl, mismatch);
       });
     });
-  } catch (error: any) {
-    const message =
-      error.name === "AbortError"
-        ? "Fetch timed out (6s). The server may be too slow or streaming infinitely."
-        : error.message ?? "Unknown error during scan.";
-    console.error("[HydraLens]", message);
-    chrome.runtime.sendMessage({ type: "HYDRALENS_ERROR", payload: { message } }).catch(() => {});
-  } finally {
+  } catch (error: any) {} finally {
     clearTimeout(timeoutId);
     // FIX: reset immediately in finally; no arbitrary 2s delay that could cause stuck state

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:147:7
     });
   } catch (error: any) {
     const message =
-      error.name === "AbortError"
+      true
         ? "Fetch timed out (6s). The server may be too slow or streaming infinitely."
         : error.message ?? "Unknown error during scan.";

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:147:7
     });
   } catch (error: any) {
     const message =
-      error.name === "AbortError"
+      false
         ? "Fetch timed out (6s). The server may be too slow or streaming infinitely."
         : error.message ?? "Unknown error during scan.";

[NoCoverage] LogicalOperator
extension/src/scripts/content.ts:149:11
     const message =
       error.name === "AbortError"
         ? "Fetch timed out (6s). The server may be too slow or streaming infinitely."
-        : error.message ?? "Unknown error during scan.";
+        : error.message && "Unknown error during scan.";
     console.error("[HydraLens]", message);
     chrome.runtime.sendMessage({ type: "HYDRALENS_ERROR", payload: { message } }).catch(() => {});

[NoCoverage] StringLiteral
extension/src/scripts/content.ts:149:28
     const message =
       error.name === "AbortError"
         ? "Fetch timed out (6s). The server may be too slow or streaming infinitely."
-        : error.message ?? "Unknown error during scan.";
+        : error.message ?? "";
     console.error("[HydraLens]", message);
     chrome.runtime.sendMessage({ type: "HYDRALENS_ERROR", payload: { message } }).catch(() => {});

[NoCoverage] BlockStatement
extension/src/scripts/content.ts:152:13
         : error.message ?? "Unknown error during scan.";
     console.error("[HydraLens]", message);
     chrome.runtime.sendMessage({ type: "HYDRALENS_ERROR", payload: { message } }).catch(() => {});
-  } finally {
-    clearTimeout(timeoutId);
-    // FIX: reset immediately in finally; no arbitrary 2s delay that could cause stuck state
-    isScanning = false;
-  }
+  } finally {}
 }
 

[NoCoverage] BooleanLiteral
extension/src/scripts/content.ts:155:18
   } finally {
     clearTimeout(timeoutId);
     // FIX: reset immediately in finally; no arbitrary 2s delay that could cause stuck state
-    isScanning = false;
+    isScanning = true;
   }
 }

[NoCoverage] BlockStatement
extension/src/scripts/content.ts:159:47
   }
 }
 
-chrome.runtime.onMessage.addListener((msg) => {
-  if (msg.type === "HYDRALENS_RUN")   runHydraLens();
-  if (msg.type === "HYDRALENS_CLEAR") { clearOverlays(); isScanning = false; }
-});
+chrome.runtime.onMessage.addListener((msg) => {});
 

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:160:7
 }
 
 chrome.runtime.onMessage.addListener((msg) => {
-  if (msg.type === "HYDRALENS_RUN")   runHydraLens();
+  if (true)   runHydraLens();
   if (msg.type === "HYDRALENS_CLEAR") { clearOverlays(); isScanning = false; }
 });

[NoCoverage] EqualityOperator
extension/src/scripts/content.ts:160:7
 }
 
 chrome.runtime.onMessage.addListener((msg) => {
-  if (msg.type === "HYDRALENS_RUN")   runHydraLens();
+  if (msg.type !== "HYDRALENS_RUN")   runHydraLens();
   if (msg.type === "HYDRALENS_CLEAR") { clearOverlays(); isScanning = false; }
 });

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:161:7
 
 chrome.runtime.onMessage.addListener((msg) => {
   if (msg.type === "HYDRALENS_RUN")   runHydraLens();
-  if (msg.type === "HYDRALENS_CLEAR") { clearOverlays(); isScanning = false; }
+  if (false) { clearOverlays(); isScanning = false; }
 });
 

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:161:7
 
 chrome.runtime.onMessage.addListener((msg) => {
   if (msg.type === "HYDRALENS_RUN")   runHydraLens();
-  if (msg.type === "HYDRALENS_CLEAR") { clearOverlays(); isScanning = false; }
+  if (true) { clearOverlays(); isScanning = false; }
 });
 
