[Timeout] ObjectLiteral
packages/core/src/index.ts:25:19
 
 // ── ADVICE DATABASE ───────────────────────────────────────────────────────────
 const ADVICE_DATABASE: Record<string, Record<string, { advice: string; snippet: string }>> = {
-  ReactComponent: {
-    "text-mismatch": {
-      advice:
-        "State mismatch detected. Use 'useEffect' to set initial client state only AFTER mounting.",
-      snippet:
-        "const [isClient, setIsClient] = useState(false);\nuseEffect(() => setIsClient(true), []);\nreturn <div>{isClient ? clientValue : serverValue}</div>;",
-    },
-    "attribute-mismatch": {
-      advice: "Use 'suppressHydrationWarning' if this dynamic attribute is intentional.",
-      snippet: "<div suppressHydrationWarning={true} className={dynamicClass} />",
-    },
-  },
+  ReactComponent: {},
   VueComponent: {
     "text-mismatch": {

[Timeout] ObjectLiteral
packages/core/src/index.ts:26:22
 // ── ADVICE DATABASE ───────────────────────────────────────────────────────────
 const ADVICE_DATABASE: Record<string, Record<string, { advice: string; snippet: string }>> = {
   ReactComponent: {
-    "text-mismatch": {
-      advice:
-        "State mismatch detected. Use 'useEffect' to set initial client state only AFTER mounting.",
-      snippet:
-        "const [isClient, setIsClient] = useState(false);\nuseEffect(() => setIsClient(true), []);\nreturn <div>{isClient ? clientValue : serverValue}</div>;",
-    },
+    "text-mismatch": {},
     "attribute-mismatch": {
       advice: "Use 'suppressHydrationWarning' if this dynamic attribute is intentional.",

[Timeout] ObjectLiteral
packages/core/src/index.ts:44:27
       snippet:
         "const value = ref('');\nonMounted(() => { value.value = localStorage.getItem('key') ?? ''; });",
     },
-    "attribute-mismatch": {
-      advice: "Use v-if with a client-only flag to prevent SSR/CSR attribute mismatches.",
-      snippet: "const isClient = ref(false);\nonMounted(() => { isClient.value = true; });",
-    },
+    "attribute-mismatch": {},
   },
   SvelteComponent: {

[Timeout] StringLiteral
packages/core/src/index.ts:46:16
     },
     "attribute-mismatch": {
       advice: "Use v-if with a client-only flag to prevent SSR/CSR attribute mismatches.",
-      snippet: "const isClient = ref(false);\nonMounted(() => { isClient.value = true; });",
+      snippet: "",
     },
   },

[Timeout] StringLiteral
packages/core/src/index.ts:51:15
   },
   SvelteComponent: {
     "text-mismatch": {
-      advice: "Use onMount() to defer browser-only logic and avoid SSR mismatches.",
+      advice: "",
       snippet:
         "import { onMount } from 'svelte';\nlet value = '';\nonMount(() => { value = localStorage.getItem('key') ?? ''; });",

[Timeout] ObjectLiteral
packages/core/src/index.ts:55:27
       snippet:
         "import { onMount } from 'svelte';\nlet value = '';\nonMount(() => { value = localStorage.getItem('key') ?? ''; });",
     },
-    "attribute-mismatch": {
-      advice: "Use a mounted flag to suppress SSR attribute differences.",
-      snippet: "let mounted = false;\nonMount(() => { mounted = true; });",
-    },
+    "attribute-mismatch": {},
   },
   SolidComponent: {

[Timeout] StringLiteral
packages/core/src/index.ts:57:16
     },
     "attribute-mismatch": {
       advice: "Use a mounted flag to suppress SSR attribute differences.",
-      snippet: "let mounted = false;\nonMount(() => { mounted = true; });",
+      snippet: "",
     },
   },

[Timeout] ObjectLiteral
packages/core/src/index.ts:71:21
       snippet: "createEffect(() => { el.setAttribute('data-val', computedValue()); });",
     },
   },
-  AngularComponent: {
-    "text-mismatch": {
-      advice: "Use isPlatformBrowser() to guard browser-only code and avoid SSR mismatches.",
-      snippet:
-        "constructor(@Inject(PLATFORM_ID) private platformId: Object) {}\nngOnInit() { if (isPlatformBrowser(this.platformId)) { /* client only */ } }",
-    },
-    "attribute-mismatch": {
-      advice: "Move dynamic bindings into ngAfterViewInit or use TransferState to sync SSR data.",
-      snippet: "// Use TransferState to pass server data to the client without re-fetching.",
-    },
-  },
+  AngularComponent: {},
   NextComponent: {
     "text-mismatch": {

[Timeout] StringLiteral
packages/core/src/index.ts:79:16
     },
     "attribute-mismatch": {
       advice: "Move dynamic bindings into ngAfterViewInit or use TransferState to sync SSR data.",
-      snippet: "// Use TransferState to pass server data to the client without re-fetching.",
+      snippet: "",
     },
   },

[Timeout] StringLiteral
packages/core/src/index.ts:87:9
       advice:
         "Use `suppressHydrationWarning` on the element or move dynamic content into a `useEffect` to avoid Next.js SSR/CSR mismatches.",
       snippet:
-        "const [mounted, setMounted] = useState(false);\nuseEffect(() => setMounted(true), []);\nif (!mounted) return <div>{serverFallback}</div>;",
+        "",
     },
     "attribute-mismatch": {

[Timeout] StringLiteral
packages/core/src/index.ts:90:15
         "const [mounted, setMounted] = useState(false);\nuseEffect(() => setMounted(true), []);\nif (!mounted) return <div>{serverFallback}</div>;",
     },
     "attribute-mismatch": {
-      advice: "Wrap dynamic attributes with `suppressHydrationWarning` or defer them via `useEffect`.",
+      advice: "",
       snippet: "<div suppressHydrationWarning data-dynamic={clientValue} />",
     },

[Timeout] StringLiteral
packages/core/src/index.ts:91:16
     },
     "attribute-mismatch": {
       advice: "Wrap dynamic attributes with `suppressHydrationWarning` or defer them via `useEffect`.",
-      snippet: "<div suppressHydrationWarning data-dynamic={clientValue} />",
+      snippet: "",
     },
   },

[Timeout] StringLiteral
packages/core/src/index.ts:97:9
   NuxtComponent: {
     "text-mismatch": {
       advice:
-        "Use `<ClientOnly>` wrapper or check `process.client` to prevent Nuxt SSR/CSR text mismatches.",
+        "",
       snippet:
         "<ClientOnly>\n  <template #default>{{ clientValue }}</template>\n  <template #fallback>{{ serverFallback }}</template>\n</ClientOnly>",

[Timeout] StringLiteral
packages/core/src/index.ts:99:9
       advice:
         "Use `<ClientOnly>` wrapper or check `process.client` to prevent Nuxt SSR/CSR text mismatches.",
       snippet:
-        "<ClientOnly>\n  <template #default>{{ clientValue }}</template>\n  <template #fallback>{{ serverFallback }}</template>\n</ClientOnly>",
+        "",
     },
     "attribute-mismatch": {

[Timeout] StringLiteral
packages/core/src/index.ts:103:16
     },
     "attribute-mismatch": {
       advice: "Use `<ClientOnly>` or a `mounted` ref to suppress Nuxt attribute mismatches.",
-      snippet: "const mounted = ref(false);\nonMounted(() => { mounted.value = true; });",
+      snippet: "",
     },
   },

[Timeout] StringLiteral
packages/core/src/index.ts:110:16
     "text-mismatch": {
       advice:
         "Text content differs between server and client. Check for dates, locales, or random values rendered at build time.",
-      snippet: "// Ensure dynamic values are deferred to client-side or made deterministic.",
+      snippet: "",
     },
     "attribute-mismatch": {

[Timeout] StringLiteral
packages/core/src/index.ts:114:9
     },
     "attribute-mismatch": {
       advice:
-        "An attribute value differs between SSR and CSR. Common causes: timestamps, nonces, or session-based values.",
+        "",
       snippet:
         "// Review initialization logic and defer non-deterministic attributes to client mount.",

[Timeout] StringLiteral
packages/core/src/index.ts:116:9
       advice:
         "An attribute value differs between SSR and CSR. Common causes: timestamps, nonces, or session-based values.",
       snippet:
-        "// Review initialization logic and defer non-deterministic attributes to client mount.",
+        "",
     },
   },

[Killed] BlockStatement
packages/core/src/index.ts:124:40
 export function getFix(
   componentName: string | null,
   reason: string
-): { advice: string; snippet: string } {
-  const key = componentName ?? "Unknown";
-  const db = ADVICE_DATABASE[key] ?? ADVICE_DATABASE["Unknown"];
-  const type = reason.toLowerCase().includes("text") ? "text-mismatch" : "attribute-mismatch";
-  return (
-    db[type] ?? {
-      advice: "Review your initialization logic.",
-      snippet: "// No specific snippet available.",
-    }
-  );
-}
+): { advice: string; snippet: string } {}
 
 // ── SECRET PATTERNS ───────────────────────────────────────────────────────────
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: Cannot read properties of undefined (reading 'advice')

[Survived] LogicalOperator
packages/core/src/index.ts:125:15
   componentName: string | null,
   reason: string
 ): { advice: string; snippet: string } {
-  const key = componentName ?? "Unknown";
+  const key = componentName && "Unknown";
   const db = ADVICE_DATABASE[key] ?? ADVICE_DATABASE["Unknown"];
   const type = reason.toLowerCase().includes("text") ? "text-mismatch" : "attribute-mismatch";

[Survived] LogicalOperator
packages/core/src/index.ts:129:5
   const db = ADVICE_DATABASE[key] ?? ADVICE_DATABASE["Unknown"];
   const type = reason.toLowerCase().includes("text") ? "text-mismatch" : "attribute-mismatch";
   return (
-    db[type] ?? {
-      advice: "Review your initialization logic.",
-      snippet: "// No specific snippet available.",
-    }
+    db[type] && {
+  advice: "Review your initialization logic.",
+  snippet: "// No specific snippet available."
+}
   );
 }

[NoCoverage] StringLiteral
packages/core/src/index.ts:131:16
   return (
     db[type] ?? {
       advice: "Review your initialization logic.",
-      snippet: "// No specific snippet available.",
+      snippet: "",
     }
   );

[Killed] ArrayDeclaration
packages/core/src/index.ts:139:63
 // ── SECRET PATTERNS ───────────────────────────────────────────────────────────
 // NOTE: The catch-all high-entropy pattern is intentionally removed — it produced
 // massive false-positive noise on base64 image data, font hashes, and minified JS.
-const SECRET_PATTERNS: { pattern: RegExp; label: string }[] = [
-  { pattern: /eyJ[a-zA-Z0-9_-]{10,}\.[a-zA-Z0-9_-]{10,}/, label: "JWT Token" },
-  { pattern: /AKIA[0-9A-Z]{16}/, label: "AWS Access Key" },
-  { pattern: /sk_(live|test)_[a-zA-Z0-9]{24,}/, label: "Stripe Secret Key" },
-  { pattern: /ghp_[a-zA-Z0-9]{36}/, label: "GitHub Personal Access Token" },
-  { pattern: /AIza[0-9A-Za-z_-]{35}/, label: "Google API Key" },
-  { pattern: /xox[baprs]-[0-9A-Za-z-]{10,}/, label: "Slack Token" },
-  { pattern: /AC[a-z0-9]{32}/, label: "Twilio Account SID" },
-  { pattern: /SK[a-z0-9]{32}/, label: "SendGrid API Key" },
-  { pattern: /-----BEGIN (RSA |EC |DSA )?PRIVATE KEY-----/, label: "Private Key (PEM)" },
-];
+const SECRET_PATTERNS: { pattern: RegExp; label: string }[] = [];
 
 // ── TIMESTAMP / DATE PATTERNS TO AUTO-IGNORE ─────────────────────────────────
killedBy: Heuristics: classifyAttributeMismatch should detect exposed AWS keys as security severity
statusReason: expected 'warning' to be 'security' // Object.is equality

[Killed] ObjectLiteral
packages/core/src/index.ts:140:3
 // NOTE: The catch-all high-entropy pattern is intentionally removed — it produced
 // massive false-positive noise on base64 image data, font hashes, and minified JS.
 const SECRET_PATTERNS: { pattern: RegExp; label: string }[] = [
-  { pattern: /eyJ[a-zA-Z0-9_-]{10,}\.[a-zA-Z0-9_-]{10,}/, label: "JWT Token" },
+  {},
   { pattern: /AKIA[0-9A-Z]{16}/, label: "AWS Access Key" },
   { pattern: /sk_(live|test)_[a-zA-Z0-9]{24,}/, label: "Stripe Secret Key" },
killedBy: Heuristics: classifyAttributeMismatch should detect exposed AWS keys as security severity
statusReason: Cannot read properties of undefined (reading 'test')

[Killed] StringLiteral
packages/core/src/index.ts:140:66
 // NOTE: The catch-all high-entropy pattern is intentionally removed — it produced
 // massive false-positive noise on base64 image data, font hashes, and minified JS.
 const SECRET_PATTERNS: { pattern: RegExp; label: string }[] = [
-  { pattern: /eyJ[a-zA-Z0-9_-]{10,}\.[a-zA-Z0-9_-]{10,}/, label: "JWT Token" },
+  { pattern: /eyJ[a-zA-Z0-9_-]{10,}\.[a-zA-Z0-9_-]{10,}/, label: "" },
   { pattern: /AKIA[0-9A-Z]{16}/, label: "AWS Access Key" },
   { pattern: /sk_(live|test)_[a-zA-Z0-9]{24,}/, label: "Stripe Secret Key" },
killedBy: Heuristics: classifyAttributeMismatch should detect exposed JWT tokens as security severity
statusReason: expected 'Potential  exposed in attribute' to contain 'JWT Token'

[Timeout] Regex
packages/core/src/index.ts:141:14
 // massive false-positive noise on base64 image data, font hashes, and minified JS.
 const SECRET_PATTERNS: { pattern: RegExp; label: string }[] = [
   { pattern: /eyJ[a-zA-Z0-9_-]{10,}\.[a-zA-Z0-9_-]{10,}/, label: "JWT Token" },
-  { pattern: /AKIA[0-9A-Z]{16}/, label: "AWS Access Key" },
+  { pattern: /AKIA[0-9A-Z]/, label: "AWS Access Key" },
   { pattern: /sk_(live|test)_[a-zA-Z0-9]{24,}/, label: "Stripe Secret Key" },
   { pattern: /ghp_[a-zA-Z0-9]{36}/, label: "GitHub Personal Access Token" },

[Timeout] Regex
packages/core/src/index.ts:142:14
 const SECRET_PATTERNS: { pattern: RegExp; label: string }[] = [
   { pattern: /eyJ[a-zA-Z0-9_-]{10,}\.[a-zA-Z0-9_-]{10,}/, label: "JWT Token" },
   { pattern: /AKIA[0-9A-Z]{16}/, label: "AWS Access Key" },
-  { pattern: /sk_(live|test)_[a-zA-Z0-9]{24,}/, label: "Stripe Secret Key" },
+  { pattern: /sk_(live|test)_[^a-zA-Z0-9]{24,}/, label: "Stripe Secret Key" },
   { pattern: /ghp_[a-zA-Z0-9]{36}/, label: "GitHub Personal Access Token" },
   { pattern: /AIza[0-9A-Za-z_-]{35}/, label: "Google API Key" },

[Timeout] Regex
packages/core/src/index.ts:142:14
 const SECRET_PATTERNS: { pattern: RegExp; label: string }[] = [
   { pattern: /eyJ[a-zA-Z0-9_-]{10,}\.[a-zA-Z0-9_-]{10,}/, label: "JWT Token" },
   { pattern: /AKIA[0-9A-Z]{16}/, label: "AWS Access Key" },
-  { pattern: /sk_(live|test)_[a-zA-Z0-9]{24,}/, label: "Stripe Secret Key" },
+  { pattern: /sk_(live|test)_[a-zA-Z0-9]/, label: "Stripe Secret Key" },
   { pattern: /ghp_[a-zA-Z0-9]{36}/, label: "GitHub Personal Access Token" },
   { pattern: /AIza[0-9A-Za-z_-]{35}/, label: "Google API Key" },

[Timeout] StringLiteral
packages/core/src/index.ts:143:44
   { pattern: /eyJ[a-zA-Z0-9_-]{10,}\.[a-zA-Z0-9_-]{10,}/, label: "JWT Token" },
   { pattern: /AKIA[0-9A-Z]{16}/, label: "AWS Access Key" },
   { pattern: /sk_(live|test)_[a-zA-Z0-9]{24,}/, label: "Stripe Secret Key" },
-  { pattern: /ghp_[a-zA-Z0-9]{36}/, label: "GitHub Personal Access Token" },
+  { pattern: /ghp_[a-zA-Z0-9]{36}/, label: "" },
   { pattern: /AIza[0-9A-Za-z_-]{35}/, label: "Google API Key" },
   { pattern: /xox[baprs]-[0-9A-Za-z-]{10,}/, label: "Slack Token" },

[Killed] ObjectLiteral
packages/core/src/index.ts:144:3
   { pattern: /AKIA[0-9A-Z]{16}/, label: "AWS Access Key" },
   { pattern: /sk_(live|test)_[a-zA-Z0-9]{24,}/, label: "Stripe Secret Key" },
   { pattern: /ghp_[a-zA-Z0-9]{36}/, label: "GitHub Personal Access Token" },
-  { pattern: /AIza[0-9A-Za-z_-]{35}/, label: "Google API Key" },
+  {},
   { pattern: /xox[baprs]-[0-9A-Za-z-]{10,}/, label: "Slack Token" },
   { pattern: /AC[a-z0-9]{32}/, label: "Twilio Account SID" },
killedBy: Heuristics: classifyAttributeMismatch should classify ARIA attribute mismatches as critical
statusReason: Cannot read properties of undefined (reading 'test')

[Timeout] Regex
packages/core/src/index.ts:144:14
   { pattern: /AKIA[0-9A-Z]{16}/, label: "AWS Access Key" },
   { pattern: /sk_(live|test)_[a-zA-Z0-9]{24,}/, label: "Stripe Secret Key" },
   { pattern: /ghp_[a-zA-Z0-9]{36}/, label: "GitHub Personal Access Token" },
-  { pattern: /AIza[0-9A-Za-z_-]{35}/, label: "Google API Key" },
+  { pattern: /AIza[0-9A-Za-z_-]/, label: "Google API Key" },
   { pattern: /xox[baprs]-[0-9A-Za-z-]{10,}/, label: "Slack Token" },
   { pattern: /AC[a-z0-9]{32}/, label: "Twilio Account SID" },

[Timeout] Regex
packages/core/src/index.ts:145:14
   { pattern: /sk_(live|test)_[a-zA-Z0-9]{24,}/, label: "Stripe Secret Key" },
   { pattern: /ghp_[a-zA-Z0-9]{36}/, label: "GitHub Personal Access Token" },
   { pattern: /AIza[0-9A-Za-z_-]{35}/, label: "Google API Key" },
-  { pattern: /xox[baprs]-[0-9A-Za-z-]{10,}/, label: "Slack Token" },
+  { pattern: /xox[baprs]-[0-9A-Za-z-]/, label: "Slack Token" },
   { pattern: /AC[a-z0-9]{32}/, label: "Twilio Account SID" },
   { pattern: /SK[a-z0-9]{32}/, label: "SendGrid API Key" },

[Timeout] StringLiteral
packages/core/src/index.ts:146:39
   { pattern: /ghp_[a-zA-Z0-9]{36}/, label: "GitHub Personal Access Token" },
   { pattern: /AIza[0-9A-Za-z_-]{35}/, label: "Google API Key" },
   { pattern: /xox[baprs]-[0-9A-Za-z-]{10,}/, label: "Slack Token" },
-  { pattern: /AC[a-z0-9]{32}/, label: "Twilio Account SID" },
+  { pattern: /AC[a-z0-9]{32}/, label: "" },
   { pattern: /SK[a-z0-9]{32}/, label: "SendGrid API Key" },
   { pattern: /-----BEGIN (RSA |EC |DSA )?PRIVATE KEY-----/, label: "Private Key (PEM)" },

[Timeout] Regex
packages/core/src/index.ts:148:14
   { pattern: /xox[baprs]-[0-9A-Za-z-]{10,}/, label: "Slack Token" },
   { pattern: /AC[a-z0-9]{32}/, label: "Twilio Account SID" },
   { pattern: /SK[a-z0-9]{32}/, label: "SendGrid API Key" },
-  { pattern: /-----BEGIN (RSA |EC |DSA )?PRIVATE KEY-----/, label: "Private Key (PEM)" },
+  { pattern: /-----BEGIN (RSA |EC |DSA )PRIVATE KEY-----/, label: "Private Key (PEM)" },
 ];
 

[Timeout] Regex
packages/core/src/index.ts:153:3
 
 // ── TIMESTAMP / DATE PATTERNS TO AUTO-IGNORE ─────────────────────────────────
 const TIMESTAMP_PATTERNS: RegExp[] = [
-  /^\d{4}-\d{2}-\d{2}(T\d{2}:\d{2}(:\d{2}(\.\d+)?)?(Z|[+-]\d{2}:?\d{2})?)?$/,
+  /^\d{4}-\d{2}-\d{2}(T\D{2}:\d{2}(:\d{2}(\.\d+)?)?(Z|[+-]\d{2}:?\d{2})?)?$/,
   /^\d{10,13}$/,
   /^(Mon|Tue|Wed|Thu|Fri|Sat|Sun),\s/i,

[Timeout] Regex
packages/core/src/index.ts:153:3
 
 // ── TIMESTAMP / DATE PATTERNS TO AUTO-IGNORE ─────────────────────────────────
 const TIMESTAMP_PATTERNS: RegExp[] = [
-  /^\d{4}-\d{2}-\d{2}(T\d{2}:\d{2}(:\d{2}(\.\d+)?)?(Z|[+-]\d{2}:?\d{2})?)?$/,
+  /^\d{4}-\d{2}-\d{2}(T\d{2}:\d{2}(:\d{2}(\.\d+)?)?(Z|[^+-]\d{2}:?\d{2})?)?$/,
   /^\d{10,13}$/,
   /^(Mon|Tue|Wed|Thu|Fri|Sat|Sun),\s/i,

[Timeout] Regex
packages/core/src/index.ts:154:3
 // ── TIMESTAMP / DATE PATTERNS TO AUTO-IGNORE ─────────────────────────────────
 const TIMESTAMP_PATTERNS: RegExp[] = [
   /^\d{4}-\d{2}-\d{2}(T\d{2}:\d{2}(:\d{2}(\.\d+)?)?(Z|[+-]\d{2}:?\d{2})?)?$/,
-  /^\d{10,13}$/,
+  /^\d$/,
   /^(Mon|Tue|Wed|Thu|Fri|Sat|Sun),\s/i,
 ];

[Survived] MethodExpression
packages/core/src/index.ts:159:10
 ];
 
 function isTimestampValue(val: string): boolean {
-  return TIMESTAMP_PATTERNS.some((p) => p.test(val.trim()));
+  return TIMESTAMP_PATTERNS.every(p => p.test(val.trim()));
 }
 

[Killed] StringLiteral
packages/core/src/index.ts:166:3
 const IGNORED_ATTR_PREFIXES = [
   "data-reactid",
   "data-nextjs-",
-  "data-n-head",
+  "",
   "data-hid",
   "data-server-rendered",
killedBy: detectMismatches (integration) flags an attribute mismatch
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
packages/core/src/index.ts:170:3
   "data-hid",
   "data-server-rendered",
   "data-react-",
-  "data-v-",
+  "",
   "data-sveltekit-",
   "data-n-",
killedBy: detectMismatches (integration) flags an attribute mismatch
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
packages/core/src/index.ts:182:53
 }
 
 // ── FUZZY SIMILARITY (Levenshtein-based) ─────────────────────────────────────
-function editDistance(a: string, b: string): number {
-  const m = a.length,
-    n = b.length;
-  const dp: number[][] = Array.from({ length: m + 1 }, (_, i) =>
-    Array.from({ length: n + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
-  );
-  for (let i = 1; i <= m; i++)
-    for (let j = 1; j <= n; j++)
-      dp[i][j] =
-        a[i - 1] === b[j - 1]
-          ? dp[i - 1][j - 1]
-          : 1 + Math.min(dp[i - 1][j], dp[i][j - 1], dp[i - 1][j - 1]);
-  return dp[m][n];
-}
+function editDistance(a: string, b: string): number {}
 
 function similarityScore(a: string, b: string): number {
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
packages/core/src/index.ts:185:56
 function editDistance(a: string, b: string): number {
   const m = a.length,
     n = b.length;
-  const dp: number[][] = Array.from({ length: m + 1 }, (_, i) =>
-    Array.from({ length: n + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
+  const dp: number[][] = Array.from({ length: m + 1 }, () => undefined
   );
   for (let i = 1; i <= m; i++)
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArithmeticOperator
packages/core/src/index.ts:185:47
 function editDistance(a: string, b: string): number {
   const m = a.length,
     n = b.length;
-  const dp: number[][] = Array.from({ length: m + 1 }, (_, i) =>
+  const dp: number[][] = Array.from({ length: m - 1 }, (_, i) =>
     Array.from({ length: n + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
   );
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
packages/core/src/index.ts:188:19
   const dp: number[][] = Array.from({ length: m + 1 }, (_, i) =>
     Array.from({ length: n + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
   );
-  for (let i = 1; i <= m; i++)
+  for (let i = 1; false; i++)
     for (let j = 1; j <= n; j++)
       dp[i][j] =
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
packages/core/src/index.ts:189:21
     Array.from({ length: n + 1 }, (_, j) => (i === 0 ? j : j === 0 ? i : 0))
   );
   for (let i = 1; i <= m; i++)
-    for (let j = 1; j <= n; j++)
+    for (let j = 1; j > n; j++)
       dp[i][j] =
         a[i - 1] === b[j - 1]
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:191:9
   for (let i = 1; i <= m; i++)
     for (let j = 1; j <= n; j++)
       dp[i][j] =
-        a[i - 1] === b[j - 1]
+        true
           ? dp[i - 1][j - 1]
           : 1 + Math.min(dp[i - 1][j], dp[i][j - 1], dp[i - 1][j - 1]);
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
packages/core/src/index.ts:191:9
   for (let i = 1; i <= m; i++)
     for (let j = 1; j <= n; j++)
       dp[i][j] =
-        a[i - 1] === b[j - 1]
+        a[i - 1] !== b[j - 1]
           ? dp[i - 1][j - 1]
           : 1 + Math.min(dp[i - 1][j], dp[i][j - 1], dp[i - 1][j - 1]);
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
packages/core/src/index.ts:192:16
     for (let j = 1; j <= n; j++)
       dp[i][j] =
         a[i - 1] === b[j - 1]
-          ? dp[i - 1][j - 1]
+          ? dp[i + 1][j - 1]
           : 1 + Math.min(dp[i - 1][j], dp[i][j - 1], dp[i - 1][j - 1]);
   return dp[m][n];
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
packages/core/src/index.ts:192:23
     for (let j = 1; j <= n; j++)
       dp[i][j] =
         a[i - 1] === b[j - 1]
-          ? dp[i - 1][j - 1]
+          ? dp[i - 1][j + 1]
           : 1 + Math.min(dp[i - 1][j], dp[i][j - 1], dp[i - 1][j - 1]);
   return dp[m][n];

[Survived] EqualityOperator
packages/core/src/index.ts:199:7
 
 function similarityScore(a: string, b: string): number {
   if (!a && !b) return 1;
-  if (a.length > 1500 || b.length > 1500) return a === b ? 1 : 0;
+  if (a.length >= 1500 || b.length > 1500) return a === b ? 1 : 0;
   const maxLen = Math.max(a.length, b.length);
   if (maxLen === 0) return 1;

[Killed] BlockStatement
packages/core/src/index.ts:206:62
 }
 
 // ── FRAMEWORK DETECTION ───────────────────────────────────────────────────────
-export function getComponentName(el: Element): string | null {
-  if (el.hasAttribute("data-reactroot") || el.closest("[data-reactroot]")) return "ReactComponent";
-  const keys = Object.keys(el as any);
-  if (keys.some((k) => k.startsWith("__reactFiber") || k.startsWith("__reactInternalInstance")))
-    return "ReactComponent";
-  if ((el as any).__vue_app__ || keys.some((k) => k.startsWith("__vue"))) return "VueComponent";
-  if ((el as any).__ngContext__ || el.hasAttribute("ng-version") || el.closest("[ng-version]"))
-    return "AngularComponent";
-  // Svelte: components leave a __svelte property on the DOM node
-  if (keys.some((k) => k.startsWith("__svelte"))) return "SvelteComponent";
-  // SolidJS: leaves _$owner on reactive nodes
-  if ((el as any)._$owner !== undefined) return "SolidComponent";
-  // Next.js: sets __NEXT_DATA__ on window and data-nextjs-* attributes
-  if (el.closest("[data-nextjs-scroll-focus-boundary]") || (typeof window !== "undefined" && (window as any).__NEXT_DATA__))
-    return "NextComponent";
-  // Nuxt: sets __nuxt on window and data-server-rendered on root
-  if (el.hasAttribute("data-server-rendered") || (typeof window !== "undefined" && (window as any).__nuxt))
-    return "NuxtComponent";
-  return null;
-}
+export function getComponentName(el: Element): string | null {}
 
 export function getCssPath(el: Element): string {
killedBy: Heuristics: getComponentName (Framework Detection) should detect React roots
statusReason: expected undefined to be 'ReactComponent' // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:209:7
 export function getComponentName(el: Element): string | null {
   if (el.hasAttribute("data-reactroot") || el.closest("[data-reactroot]")) return "ReactComponent";
   const keys = Object.keys(el as any);
-  if (keys.some((k) => k.startsWith("__reactFiber") || k.startsWith("__reactInternalInstance")))
+  if (false)
     return "ReactComponent";
   if ((el as any).__vue_app__ || keys.some((k) => k.startsWith("__vue"))) return "VueComponent";
killedBy: Heuristics: getComponentName (Framework Detection) should detect React internal fibers
statusReason: expected null to be 'ReactComponent' // Object.is equality

[Killed] ArrowFunction
packages/core/src/index.ts:209:17
 export function getComponentName(el: Element): string | null {
   if (el.hasAttribute("data-reactroot") || el.closest("[data-reactroot]")) return "ReactComponent";
   const keys = Object.keys(el as any);
-  if (keys.some((k) => k.startsWith("__reactFiber") || k.startsWith("__reactInternalInstance")))
+  if (keys.some(() => undefined))
     return "ReactComponent";
   if ((el as any).__vue_app__ || keys.some((k) => k.startsWith("__vue"))) return "VueComponent";
killedBy: Heuristics: getComponentName (Framework Detection) should detect React internal fibers
statusReason: expected null to be 'ReactComponent' // Object.is equality

[Killed] StringLiteral
packages/core/src/index.ts:210:12
   if (el.hasAttribute("data-reactroot") || el.closest("[data-reactroot]")) return "ReactComponent";
   const keys = Object.keys(el as any);
   if (keys.some((k) => k.startsWith("__reactFiber") || k.startsWith("__reactInternalInstance")))
-    return "ReactComponent";
+    return "";
   if ((el as any).__vue_app__ || keys.some((k) => k.startsWith("__vue"))) return "VueComponent";
   if ((el as any).__ngContext__ || el.hasAttribute("ng-version") || el.closest("[ng-version]"))
killedBy: Heuristics: getComponentName (Framework Detection) should detect React internal fibers
statusReason: expected '' to be 'ReactComponent' // Object.is equality

[Killed] MethodExpression
packages/core/src/index.ts:211:34
   const keys = Object.keys(el as any);
   if (keys.some((k) => k.startsWith("__reactFiber") || k.startsWith("__reactInternalInstance")))
     return "ReactComponent";
-  if ((el as any).__vue_app__ || keys.some((k) => k.startsWith("__vue"))) return "VueComponent";
+  if ((el as any).__vue_app__ || keys.every(k => k.startsWith("__vue"))) return "VueComponent";
   if ((el as any).__ngContext__ || el.hasAttribute("ng-version") || el.closest("[ng-version]"))
     return "AngularComponent";
killedBy: Heuristics: getComponentName (Framework Detection) should detect Angular contexts
statusReason: expected 'VueComponent' to be 'AngularComponent' // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:211:7
   const keys = Object.keys(el as any);
   if (keys.some((k) => k.startsWith("__reactFiber") || k.startsWith("__reactInternalInstance")))
     return "ReactComponent";
-  if ((el as any).__vue_app__ || keys.some((k) => k.startsWith("__vue"))) return "VueComponent";
+  if (false) return "VueComponent";
   if ((el as any).__ngContext__ || el.hasAttribute("ng-version") || el.closest("[ng-version]"))
     return "AngularComponent";
killedBy: Heuristics: getComponentName (Framework Detection) should detect Vue applications
statusReason: expected null to be 'VueComponent' // Object.is equality
