[Killed] ConditionalExpression
packages/core/src/index.ts:212:7
   if (keys.some((k) => k.startsWith("__reactFiber") || k.startsWith("__reactInternalInstance")))
     return "ReactComponent";
   if ((el as any).__vue_app__ || keys.some((k) => k.startsWith("__vue"))) return "VueComponent";
-  if ((el as any).__ngContext__ || el.hasAttribute("ng-version") || el.closest("[ng-version]"))
+  if (true)
     return "AngularComponent";
   // Svelte: components leave a __svelte property on the DOM node
killedBy: Heuristics: getComponentName (Framework Detection) should detect Svelte components
statusReason: expected 'AngularComponent' to be 'SvelteComponent' // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:212:7
   if (keys.some((k) => k.startsWith("__reactFiber") || k.startsWith("__reactInternalInstance")))
     return "ReactComponent";
   if ((el as any).__vue_app__ || keys.some((k) => k.startsWith("__vue"))) return "VueComponent";
-  if ((el as any).__ngContext__ || el.hasAttribute("ng-version") || el.closest("[ng-version]"))
+  if (false)
     return "AngularComponent";
   // Svelte: components leave a __svelte property on the DOM node
killedBy: Heuristics: getComponentName (Framework Detection) should detect Angular contexts
statusReason: expected null to be 'AngularComponent' // Object.is equality

[Killed] StringLiteral
packages/core/src/index.ts:213:12
     return "ReactComponent";
   if ((el as any).__vue_app__ || keys.some((k) => k.startsWith("__vue"))) return "VueComponent";
   if ((el as any).__ngContext__ || el.hasAttribute("ng-version") || el.closest("[ng-version]"))
-    return "AngularComponent";
+    return "";
   // Svelte: components leave a __svelte property on the DOM node
   if (keys.some((k) => k.startsWith("__svelte"))) return "SvelteComponent";
killedBy: Heuristics: getComponentName (Framework Detection) should detect Angular contexts
statusReason: expected '' to be 'AngularComponent' // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:217:7
   // Svelte: components leave a __svelte property on the DOM node
   if (keys.some((k) => k.startsWith("__svelte"))) return "SvelteComponent";
   // SolidJS: leaves _$owner on reactive nodes
-  if ((el as any)._$owner !== undefined) return "SolidComponent";
+  if (false) return "SolidComponent";
   // Next.js: sets __NEXT_DATA__ on window and data-nextjs-* attributes
   if (el.closest("[data-nextjs-scroll-focus-boundary]") || (typeof window !== "undefined" && (window as any).__NEXT_DATA__))
killedBy: Heuristics: getComponentName (Framework Detection) should detect SolidJS components
statusReason: expected null to be 'SolidComponent' // Object.is equality

[Killed] LogicalOperator
packages/core/src/index.ts:219:61
   // SolidJS: leaves _$owner on reactive nodes
   if ((el as any)._$owner !== undefined) return "SolidComponent";
   // Next.js: sets __NEXT_DATA__ on window and data-nextjs-* attributes
-  if (el.closest("[data-nextjs-scroll-focus-boundary]") || (typeof window !== "undefined" && (window as any).__NEXT_DATA__))
+  if (el.closest("[data-nextjs-scroll-focus-boundary]") || (typeof window !== "undefined" || (window as any).__NEXT_DATA__))
     return "NextComponent";
   // Nuxt: sets __nuxt on window and data-server-rendered on root
killedBy: Heuristics: getComponentName (Framework Detection) should return null for vanilla elements
statusReason: expected 'NextComponent' to be null

[Killed] ConditionalExpression
packages/core/src/index.ts:219:7
   // SolidJS: leaves _$owner on reactive nodes
   if ((el as any)._$owner !== undefined) return "SolidComponent";
   // Next.js: sets __NEXT_DATA__ on window and data-nextjs-* attributes
-  if (el.closest("[data-nextjs-scroll-focus-boundary]") || (typeof window !== "undefined" && (window as any).__NEXT_DATA__))
+  if (true)
     return "NextComponent";
   // Nuxt: sets __nuxt on window and data-server-rendered on root
killedBy: Heuristics: getComponentName (Framework Detection) should return null for vanilla elements
statusReason: expected 'NextComponent' to be null

[NoCoverage] StringLiteral
packages/core/src/index.ts:220:12
   if ((el as any)._$owner !== undefined) return "SolidComponent";
   // Next.js: sets __NEXT_DATA__ on window and data-nextjs-* attributes
   if (el.closest("[data-nextjs-scroll-focus-boundary]") || (typeof window !== "undefined" && (window as any).__NEXT_DATA__))
-    return "NextComponent";
+    return "";
   // Nuxt: sets __nuxt on window and data-server-rendered on root
   if (el.hasAttribute("data-server-rendered") || (typeof window !== "undefined" && (window as any).__nuxt))

[Killed] LogicalOperator
packages/core/src/index.ts:222:51
   if (el.closest("[data-nextjs-scroll-focus-boundary]") || (typeof window !== "undefined" && (window as any).__NEXT_DATA__))
     return "NextComponent";
   // Nuxt: sets __nuxt on window and data-server-rendered on root
-  if (el.hasAttribute("data-server-rendered") || (typeof window !== "undefined" && (window as any).__nuxt))
+  if (el.hasAttribute("data-server-rendered") || (typeof window !== "undefined" || (window as any).__nuxt))
     return "NuxtComponent";
   return null;
killedBy: Heuristics: getComponentName (Framework Detection) should return null for vanilla elements
statusReason: expected 'NuxtComponent' to be null

[Killed] ConditionalExpression
packages/core/src/index.ts:222:7
   if (el.closest("[data-nextjs-scroll-focus-boundary]") || (typeof window !== "undefined" && (window as any).__NEXT_DATA__))
     return "NextComponent";
   // Nuxt: sets __nuxt on window and data-server-rendered on root
-  if (el.hasAttribute("data-server-rendered") || (typeof window !== "undefined" && (window as any).__nuxt))
+  if (true)
     return "NuxtComponent";
   return null;
killedBy: Heuristics: getComponentName (Framework Detection) should return null for vanilla elements
statusReason: expected 'NuxtComponent' to be null

[Survived] BooleanLiteral
packages/core/src/index.ts:231:7
   if (el.hasAttribute("data-testid")) return `[data-testid="${el.getAttribute("data-testid")}"]`;
   if (el.id) return `#${el.id}`;
   const parent = el.parentElement;
-  if (!parent) return el.tagName.toLowerCase();
+  if (parent) return el.tagName.toLowerCase();
   const siblings = Array.from(parent.children);
   const index = siblings.indexOf(el) + 1;

[Survived] StringLiteral
packages/core/src/index.ts:234:10
   if (!parent) return el.tagName.toLowerCase();
   const siblings = Array.from(parent.children);
   const index = siblings.indexOf(el) + 1;
-  return `${getCssPath(parent)} > ${el.tagName.toLowerCase()}:nth-child(${index})`;
+  return ``;
 }
 

[Killed] LogicalOperator
packages/core/src/index.ts:243:9
   clientVal: string
 ): { severity: Severity; reason: string } {
   for (const { pattern, label } of SECRET_PATTERNS) {
-    if (pattern.test(serverVal) || pattern.test(clientVal)) {
+    if (pattern.test(serverVal) && pattern.test(clientVal)) {
       return { severity: "security", reason: `Potential ${label} exposed in attribute` };
     }
killedBy: Heuristics: classifyAttributeMismatch should detect exposed AWS keys as security severity
statusReason: expected 'warning' to be 'security' // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:243:9
   clientVal: string
 ): { severity: Severity; reason: string } {
   for (const { pattern, label } of SECRET_PATTERNS) {
-    if (pattern.test(serverVal) || pattern.test(clientVal)) {
+    if (true) {
       return { severity: "security", reason: `Potential ${label} exposed in attribute` };
     }
killedBy: Heuristics: classifyAttributeMismatch should detect exposed AWS keys as security severity
statusReason: expected 'Potential JWT Token exposed in attrib…' to contain 'AWS Access Key'

[Killed] StringLiteral
packages/core/src/index.ts:244:26
 ): { severity: Severity; reason: string } {
   for (const { pattern, label } of SECRET_PATTERNS) {
     if (pattern.test(serverVal) || pattern.test(clientVal)) {
-      return { severity: "security", reason: `Potential ${label} exposed in attribute` };
+      return { severity: "", reason: `Potential ${label} exposed in attribute` };
     }
   }
killedBy: Heuristics: classifyAttributeMismatch should detect exposed AWS keys as security severity
statusReason: expected '' to be 'security' // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:247:7
       return { severity: "security", reason: `Potential ${label} exposed in attribute` };
     }
   }
-  if (attrName.startsWith("aria-") || attrName === "role") {
+  if (false) {
     return {
       severity: "critical",
killedBy: Heuristics: classifyAttributeMismatch should classify ARIA attribute mismatches as critical
statusReason: expected 'warning' to be 'critical' // Object.is equality

[Killed] LogicalOperator
packages/core/src/index.ts:253:7
       reason: "Accessibility attribute mismatch may break screen readers",
     };
   }
-  if (attrName === "src" || attrName === "href") {
+  if (attrName === "src" && attrName === "href") {
     const isCacheBust =
       /[?&](v|version|hash|t|ts|cb)=/.test(serverVal) ||
killedBy: Heuristics: classifyAttributeMismatch should ignore cache-busting timestamps on src attributes (info severity)
statusReason: expected 'warning' to be 'info' // Object.is equality

[Killed] ConditionalExpression
packages/core/src/index.ts:255:7
   }
   if (attrName === "src" || attrName === "href") {
     const isCacheBust =
-      /[?&](v|version|hash|t|ts|cb)=/.test(serverVal) ||
-      /[?&](v|version|hash|t|ts|cb)=/.test(clientVal);
+      false;
     if (isCacheBust)
       return { severity: "info", reason: "Cache-busting parameter differs (expected)" };
killedBy: Heuristics: classifyAttributeMismatch should ignore cache-busting timestamps on src attributes (info severity)
statusReason: expected 'warning' to be 'info' // Object.is equality

[Survived] ConditionalExpression
packages/core/src/index.ts:255:7
   }
   if (attrName === "src" || attrName === "href") {
     const isCacheBust =
-      /[?&](v|version|hash|t|ts|cb)=/.test(serverVal) ||
-      /[?&](v|version|hash|t|ts|cb)=/.test(clientVal);
+      true;
     if (isCacheBust)
       return { severity: "info", reason: "Cache-busting parameter differs (expected)" };

[Killed] ConditionalExpression
packages/core/src/index.ts:257:9
     const isCacheBust =
       /[?&](v|version|hash|t|ts|cb)=/.test(serverVal) ||
       /[?&](v|version|hash|t|ts|cb)=/.test(clientVal);
-    if (isCacheBust)
+    if (false)
       return { severity: "info", reason: "Cache-busting parameter differs (expected)" };
   }
killedBy: Heuristics: classifyAttributeMismatch should ignore cache-busting timestamps on src attributes (info severity)
statusReason: expected 'warning' to be 'info' // Object.is equality

[Survived] ConditionalExpression
packages/core/src/index.ts:257:9
     const isCacheBust =
       /[?&](v|version|hash|t|ts|cb)=/.test(serverVal) ||
       /[?&](v|version|hash|t|ts|cb)=/.test(clientVal);
-    if (isCacheBust)
+    if (true)
       return { severity: "info", reason: "Cache-busting parameter differs (expected)" };
   }

[NoCoverage] BlockStatement
packages/core/src/index.ts:260:67
     if (isCacheBust)
       return { severity: "info", reason: "Cache-busting parameter differs (expected)" };
   }
-  if (isTimestampValue(serverVal) || isTimestampValue(clientVal)) {
-    return {
-      severity: "info",
-      reason: "Timestamp or date value differs between SSR and CSR (expected)",
-    };
-  }
+  if (isTimestampValue(serverVal) || isTimestampValue(clientVal)) {}
   return { severity: "warning", reason: `Attribute '${attrName}' differs between SSR and CSR` };
 }

[NoCoverage] ObjectLiteral
packages/core/src/index.ts:261:12
       return { severity: "info", reason: "Cache-busting parameter differs (expected)" };
   }
   if (isTimestampValue(serverVal) || isTimestampValue(clientVal)) {
-    return {
-      severity: "info",
-      reason: "Timestamp or date value differs between SSR and CSR (expected)",
-    };
+    return {};
   }
   return { severity: "warning", reason: `Attribute '${attrName}' differs between SSR and CSR` };

[NoCoverage] StringLiteral
packages/core/src/index.ts:262:17
   }
   if (isTimestampValue(serverVal) || isTimestampValue(clientVal)) {
     return {
-      severity: "info",
+      severity: "",
       reason: "Timestamp or date value differs between SSR and CSR (expected)",
     };

[Killed] ObjectLiteral
packages/core/src/index.ts:266:10
       reason: "Timestamp or date value differs between SSR and CSR (expected)",
     };
   }
-  return { severity: "warning", reason: `Attribute '${attrName}' differs between SSR and CSR` };
+  return {};
 }
 
killedBy: Heuristics: classifyAttributeMismatch should classify generic attribute mismatches as warning
statusReason: expected undefined to be 'warning' // Object.is equality

[Survived] StringLiteral
packages/core/src/index.ts:266:41
       reason: "Timestamp or date value differs between SSR and CSR (expected)",
     };
   }
-  return { severity: "warning", reason: `Attribute '${attrName}' differs between SSR and CSR` };
+  return { severity: "warning", reason: `` };
 }
 

[Timeout] ArrayDeclaration
packages/core/src/index.ts:269:30
   return { severity: "warning", reason: `Attribute '${attrName}' differs between SSR and CSR` };
 }
 
-const IGNORED_TAGS = new Set(["script", "style", "noscript", "link"]);
+const IGNORED_TAGS = new Set([]);
 const IGNORED_SRC_PATTERNS = [/_next\/static/, /__webpack/, /chunk\.[a-z0-9]+\.js/];
 

[Timeout] StringLiteral
packages/core/src/index.ts:269:31
   return { severity: "warning", reason: `Attribute '${attrName}' differs between SSR and CSR` };
 }
 
-const IGNORED_TAGS = new Set(["script", "style", "noscript", "link"]);
+const IGNORED_TAGS = new Set(["", "style", "noscript", "link"]);
 const IGNORED_SRC_PATTERNS = [/_next\/static/, /__webpack/, /chunk\.[a-z0-9]+\.js/];
 

[Timeout] Regex
packages/core/src/index.ts:270:61
 }
 
 const IGNORED_TAGS = new Set(["script", "style", "noscript", "link"]);
-const IGNORED_SRC_PATTERNS = [/_next\/static/, /__webpack/, /chunk\.[a-z0-9]+\.js/];
+const IGNORED_SRC_PATTERNS = [/_next\/static/, /__webpack/, /chunk\.[^a-z0-9]+\.js/];
 
 // ── SHARED NODE PROCESSOR ─────────────────────────────────────────────────────

[Killed] EqualityOperator
packages/core/src/index.ts:282:20
   options: Required<DetectOptions>,
   push: (m: Mismatch) => void
 ): Array<{ serverEl: Element; clientEl: Element | null; depth: number }> {
-  if (!clientEl || depth > options.maxDepth || IGNORED_TAGS.has(serverEl.tagName.toLowerCase()))
+  if (!clientEl || depth <= options.maxDepth || IGNORED_TAGS.has(serverEl.tagName.toLowerCase()))
     return [];
 
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
packages/core/src/index.ts:282:7
   options: Required<DetectOptions>,
   push: (m: Mismatch) => void
 ): Array<{ serverEl: Element; clientEl: Element | null; depth: number }> {
-  if (!clientEl || depth > options.maxDepth || IGNORED_TAGS.has(serverEl.tagName.toLowerCase()))
+  if (clientEl || depth > options.maxDepth || IGNORED_TAGS.has(serverEl.tagName.toLowerCase()))
     return [];
 
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[NoCoverage] ArrayDeclaration
packages/core/src/index.ts:283:12
   push: (m: Mismatch) => void
 ): Array<{ serverEl: Element; clientEl: Element | null; depth: number }> {
   if (!clientEl || depth > options.maxDepth || IGNORED_TAGS.has(serverEl.tagName.toLowerCase()))
-    return [];
+    return ["Stryker was here"];
 
   const componentName = getComponentName(clientEl);

[Killed] ConditionalExpression
packages/core/src/index.ts:302:11
 
     if (serverText && clientText && serverText !== clientText) {
       const score = similarityScore(serverText, clientText);
-      if (score < options.similarityThreshold) {
+      if (false) {
         const fix = getFix(componentName, "Text content mismatch");
         push({
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
packages/core/src/index.ts:323:9
   for (const attr of Array.from(serverEl.attributes)) {
     const serverVal = attr.value;
     const clientVal = clientEl.getAttribute(attr.name);
-    if (clientVal === null || serverVal === clientVal) continue;
+    if (clientVal !== null || serverVal === clientVal) continue;
     if (isFrameworkInternalAttr(attr.name)) continue;
     if (attr.name === "src" && IGNORED_SRC_PATTERNS.some((p) => p.test(serverVal))) continue;
killedBy: detectMismatches (integration) flags an attribute mismatch
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
packages/core/src/index.ts:325:9
     const clientVal = clientEl.getAttribute(attr.name);
     if (clientVal === null || serverVal === clientVal) continue;
     if (isFrameworkInternalAttr(attr.name)) continue;
-    if (attr.name === "src" && IGNORED_SRC_PATTERNS.some((p) => p.test(serverVal))) continue;
+    if (true && IGNORED_SRC_PATTERNS.some((p) => p.test(serverVal))) continue;
 
     const { severity, reason } = classifyAttributeMismatch(attr.name, serverVal, clientVal);

[Killed] ConditionalExpression
packages/core/src/index.ts:328:9
     if (attr.name === "src" && IGNORED_SRC_PATTERNS.some((p) => p.test(serverVal))) continue;
 
     const { severity, reason } = classifyAttributeMismatch(attr.name, serverVal, clientVal);
-    if (options.securityOnly && severity !== "security") continue;
+    if (false) continue;
 
     const fix = getFix(componentName, reason);
killedBy: detectMismatches (integration) respects securityOnly option — skips non-security findings
statusReason: expected 1 to be +0 // Object.is equality

[Survived] StringLiteral
packages/core/src/index.ts:334:19
     push({
       selector: getCssPath(clientEl),
       serverText: "",
-      clientText: "",
+      clientText: "Stryker was here!",
       serverAttrValue: serverVal,
       attributeName: attr.name,

[Killed] ArrowFunction
packages/core/src/index.ts:348:29
   // Return children in forward order (consistent left-to-right DFS for both sync & async)
   const serverChildren = Array.from(serverEl.children);
   const clientChildren = Array.from(clientEl.children);
-  return serverChildren.map((sc, i) => ({
-    serverEl: sc,
-    clientEl: clientChildren[i] ?? null,
-    depth: depth + 1,
-  }));
+  return serverChildren.map(() => undefined);
 }
 
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: Cannot read properties of undefined (reading 'serverEl')

[Killed] LogicalOperator
packages/core/src/index.ts:350:15
   const clientChildren = Array.from(clientEl.children);
   return serverChildren.map((sc, i) => ({
     serverEl: sc,
-    clientEl: clientChildren[i] ?? null,
+    clientEl: clientChildren[i] && null,
     depth: depth + 1,
   }));
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
packages/core/src/index.ts:351:12
   return serverChildren.map((sc, i) => ({
     serverEl: sc,
     clientEl: clientChildren[i] ?? null,
-    depth: depth + 1,
+    depth: depth - 1,
   }));
 }

[Killed] ObjectLiteral
packages/core/src/index.ts:361:41
   clientDoc: Document,
   options: DetectOptions = {}
 ): Mismatch[] {
-  const opts: Required<DetectOptions> = {
-    maxDepth: options.maxDepth ?? Infinity,
-    similarityThreshold: options.similarityThreshold ?? 0.6,
-    securityOnly: options.securityOnly ?? false,
-  };
+  const opts: Required<DetectOptions> = {};
 
   const parser = new DOMParser();
killedBy: detectMismatches (integration) flags a text mismatch between server and client
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
packages/core/src/index.ts:405:9
 
   while (stack.length > 0) {
     // Yield before processing each node so the threshold applies per-node, not per-batch
-    if (performance.now() - lastYield > 15) {
+    if (false) {
       await new Promise<void>((r) => setTimeout(r, 0));
       lastYield = performance.now();

[NoCoverage] BlockStatement
packages/core/src/index.ts:405:45
 
   while (stack.length > 0) {
     // Yield before processing each node so the threshold applies per-node, not per-batch
-    if (performance.now() - lastYield > 15) {
-      await new Promise<void>((r) => setTimeout(r, 0));
-      lastYield = performance.now();
-    }
+    if (performance.now() - lastYield > 15) {}
 
     const current = stack.pop()!;

[Killed] BlockStatement
packages/core/src/index.ts:416:52
     );
 
     // Push in reverse so that stack.pop() processes left-to-right (same order as sync walk)
-    for (let i = children.length - 1; i >= 0; i--) {
-      stack.push(children[i]);
-    }
+    for (let i = children.length - 1; i >= 0; i--) {}
   }
 
killedBy: detectMismatches (integration) sync and async detectors return the same results in the same order
statusReason: expected [ …(3) ] to deeply equal []
