[NoCoverage] BlockStatement
extension/src/devtools/devtools.ts:1:99
-chrome.devtools.panels.create("HydraLens", "/icon16.png", "/src/devtools/panel.html", (_panel) => {
-  console.log("HydraLens panel created.");
-});
+chrome.devtools.panels.create("HydraLens", "/icon16.png", "/src/devtools/panel.html", (_panel) => {});
 

[NoCoverage] StringLiteral
extension/src/devtools/devtools.ts:1:44
-chrome.devtools.panels.create("HydraLens", "/icon16.png", "/src/devtools/panel.html", (_panel) => {
+chrome.devtools.panels.create("HydraLens", "", "/src/devtools/panel.html", (_panel) => {
   console.log("HydraLens panel created.");
 });

[NoCoverage] StringLiteral
extension/src/devtools/devtools.ts:2:15
 chrome.devtools.panels.create("HydraLens", "/icon16.png", "/src/devtools/panel.html", (_panel) => {
-  console.log("HydraLens panel created.");
+  console.log("");
 });
 
