[NoCoverage] BooleanLiteral
extension/src/popup/popup.ts:14:37
 const toggle = document.getElementById("autoScanToggle") as HTMLInputElement;
 
 chrome.storage.local.get(["autoScan"], (res) => {
-  toggle.checked = res.autoScan !== false;
+  toggle.checked = res.autoScan !== true;
 });
 

[NoCoverage] ObjectLiteral
extension/src/popup/popup.ts:19:30
 
 toggle.addEventListener("change", (e) => {
   const enabled = (e.target as HTMLInputElement).checked;
-  chrome.runtime.sendMessage({ type: "HYDRALENS_SET_AUTOSCAN", enabled });
+  chrome.runtime.sendMessage({});
 });
 

[NoCoverage] BlockStatement
extension/src/popup/popup.ts:23:70
 });
 
 document.getElementById("scanNowBtn")?.addEventListener("click", () => {
-  chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
-    if (tabs[0]?.id) {
-      chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });
-      window.close();
-    }
-  });
+  chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {});
 });
 

[NoCoverage] ConditionalExpression
extension/src/popup/popup.ts:24:9
 
 document.getElementById("scanNowBtn")?.addEventListener("click", () => {
   chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
-    if (tabs[0]?.id) {
+    if (true) {
       chrome.tabs.sendMessage(tabs[0].id, { type: "HYDRALENS_RUN" });
       window.close();

[NoCoverage] BlockStatement
extension/src/popup/popup.ts:31:69
   });
 });
 
-function getLatestMismatches(cb: (mismatches: any[]) => void): void {
-  chrome.storage.session.get(["hydralens_last_results"], (res) => {
-    cb((res.hydralens_last_results as any[]) ?? []);
-  });
-}
+function getLatestMismatches(cb: (mismatches: any[]) => void): void {}
 
 document.getElementById("exportJson")?.addEventListener("click", () => {

[NoCoverage] BlockStatement
extension/src/popup/popup.ts:32:67
 });
 
 function getLatestMismatches(cb: (mismatches: any[]) => void): void {
-  chrome.storage.session.get(["hydralens_last_results"], (res) => {
-    cb((res.hydralens_last_results as any[]) ?? []);
-  });
+  chrome.storage.session.get(["hydralens_last_results"], (res) => {});
 }
 

[NoCoverage] LogicalOperator
extension/src/popup/popup.ts:33:8
 
 function getLatestMismatches(cb: (mismatches: any[]) => void): void {
   chrome.storage.session.get(["hydralens_last_results"], (res) => {
-    cb((res.hydralens_last_results as any[]) ?? []);
+    cb(res.hydralens_last_results as any[] && []);
   });
 }

[NoCoverage] ArrayDeclaration
extension/src/popup/popup.ts:33:49
 
 function getLatestMismatches(cb: (mismatches: any[]) => void): void {
   chrome.storage.session.get(["hydralens_last_results"], (res) => {
-    cb((res.hydralens_last_results as any[]) ?? []);
+    cb((res.hydralens_last_results as any[]) ?? ["Stryker was here"]);
   });
 }

[NoCoverage] BlockStatement
extension/src/popup/popup.ts:37:72
   });
 }
 
-document.getElementById("exportJson")?.addEventListener("click", () => {
-  getLatestMismatches((mismatches) => {
-    const blob = new Blob([JSON.stringify(mismatches, null, 2)], { type: "application/json" });
-    const url = URL.createObjectURL(blob);
-    const a = document.createElement("a");
-    a.href = url; a.download = "hydralens-report.json"; a.click();
-    URL.revokeObjectURL(url);
-  });
-});
+document.getElementById("exportJson")?.addEventListener("click", () => {});
 
 document.getElementById("exportMd")?.addEventListener("click", () => {

[NoCoverage] OptionalChaining
extension/src/popup/popup.ts:37:1
   });
 }
 
-document.getElementById("exportJson")?.addEventListener("click", () => {
+document.getElementById("exportJson").addEventListener("click", () => {
   getLatestMismatches((mismatches) => {
     const blob = new Blob([JSON.stringify(mismatches, null, 2)], { type: "application/json" });

[NoCoverage] BlockStatement
extension/src/popup/popup.ts:38:39
 }
 
 document.getElementById("exportJson")?.addEventListener("click", () => {
-  getLatestMismatches((mismatches) => {
-    const blob = new Blob([JSON.stringify(mismatches, null, 2)], { type: "application/json" });
-    const url = URL.createObjectURL(blob);
-    const a = document.createElement("a");
-    a.href = url; a.download = "hydralens-report.json"; a.click();
-    URL.revokeObjectURL(url);
-  });
+  getLatestMismatches((mismatches) => {});
 });
 

[NoCoverage] ObjectLiteral
extension/src/popup/popup.ts:39:66
 
 document.getElementById("exportJson")?.addEventListener("click", () => {
   getLatestMismatches((mismatches) => {
-    const blob = new Blob([JSON.stringify(mismatches, null, 2)], { type: "application/json" });
+    const blob = new Blob([JSON.stringify(mismatches, null, 2)], {});
     const url = URL.createObjectURL(blob);
     const a = document.createElement("a");

[NoCoverage] BlockStatement
extension/src/popup/popup.ts:47:70
   });
 });
 
-document.getElementById("exportMd")?.addEventListener("click", () => {
-  getLatestMismatches((mismatches) => {
-    const lines = ["# HydraLens Report\n", "| Severity | Component | Selector | Reason |", "|---|---|---|---|"];
-    for (const m of mismatches)
-      lines.push(`| ${m.severity} | ${m.componentName ?? "Unknown"} | \`${m.selector}\` | ${m.severityReason} |`);
-    const blob = new Blob([lines.join("\n")], { type: "text/markdown" });
-    const url = URL.createObjectURL(blob);
-    const a = document.createElement("a"); a.href = url; a.download = "hydralens-report.md"; a.click();
-    URL.revokeObjectURL(url);
-  });
-});
+document.getElementById("exportMd")?.addEventListener("click", () => {});
 
 document.getElementById("exportJira")?.addEventListener("click", () => {

[NoCoverage] OptionalChaining
extension/src/popup/popup.ts:47:1
   });
 });
 
-document.getElementById("exportMd")?.addEventListener("click", () => {
+document.getElementById("exportMd").addEventListener("click", () => {
   getLatestMismatches((mismatches) => {
     const lines = ["# HydraLens Report\n", "| Severity | Component | Selector | Reason |", "|---|---|---|---|"];

[NoCoverage] BlockStatement
extension/src/popup/popup.ts:48:39
 });
 
 document.getElementById("exportMd")?.addEventListener("click", () => {
-  getLatestMismatches((mismatches) => {
-    const lines = ["# HydraLens Report\n", "| Severity | Component | Selector | Reason |", "|---|---|---|---|"];
-    for (const m of mismatches)
-      lines.push(`| ${m.severity} | ${m.componentName ?? "Unknown"} | \`${m.selector}\` | ${m.severityReason} |`);
-    const blob = new Blob([lines.join("\n")], { type: "text/markdown" });
-    const url = URL.createObjectURL(blob);
-    const a = document.createElement("a"); a.href = url; a.download = "hydralens-report.md"; a.click();
-    URL.revokeObjectURL(url);
-  });
+  getLatestMismatches((mismatches) => {});
 });
 

[NoCoverage] LogicalOperator
extension/src/popup/popup.ts:51:39
   getLatestMismatches((mismatches) => {
     const lines = ["# HydraLens Report\n", "| Severity | Component | Selector | Reason |", "|---|---|---|---|"];
     for (const m of mismatches)
-      lines.push(`| ${m.severity} | ${m.componentName ?? "Unknown"} | \`${m.selector}\` | ${m.severityReason} |`);
+      lines.push(`| ${m.severity} | ${m.componentName && "Unknown"} | \`${m.selector}\` | ${m.severityReason} |`);
     const blob = new Blob([lines.join("\n")], { type: "text/markdown" });
     const url = URL.createObjectURL(blob);

[NoCoverage] OptionalChaining
extension/src/popup/popup.ts:59:1
   });
 });
 
-document.getElementById("exportJira")?.addEventListener("click", () => {
+document.getElementById("exportJira").addEventListener("click", () => {
   getLatestMismatches((mismatches) => {
     const lines = ["h2. HydraLens Report\n", "||Severity||Component||Selector||Reason||"];

[NoCoverage] BlockStatement
extension/src/popup/popup.ts:59:72
   });
 });
 
-document.getElementById("exportJira")?.addEventListener("click", () => {
-  getLatestMismatches((mismatches) => {
-    const lines = ["h2. HydraLens Report\n", "||Severity||Component||Selector||Reason||"];
-    for (const m of mismatches)
-      lines.push(`|${m.severity}|${m.componentName ?? "Unknown"}|{{${m.selector}}}|${m.severityReason}|`);
-    navigator.clipboard.writeText(lines.join("\n")).then(() => alert("Jira table copied to clipboard!"));
-  });
-});
+document.getElementById("exportJira")?.addEventListener("click", () => {});
 
 function renderHistory(): void {

[NoCoverage] BlockStatement
extension/src/popup/popup.ts:60:39
 });
 
 document.getElementById("exportJira")?.addEventListener("click", () => {
-  getLatestMismatches((mismatches) => {
-    const lines = ["h2. HydraLens Report\n", "||Severity||Component||Selector||Reason||"];
-    for (const m of mismatches)
-      lines.push(`|${m.severity}|${m.componentName ?? "Unknown"}|{{${m.selector}}}|${m.severityReason}|`);
-    navigator.clipboard.writeText(lines.join("\n")).then(() => alert("Jira table copied to clipboard!"));
-  });
+  getLatestMismatches((mismatches) => {});
 });
 

[NoCoverage] StringLiteral
extension/src/popup/popup.ts:61:46
 
 document.getElementById("exportJira")?.addEventListener("click", () => {
   getLatestMismatches((mismatches) => {
-    const lines = ["h2. HydraLens Report\n", "||Severity||Component||Selector||Reason||"];
+    const lines = ["h2. HydraLens Report\n", ""];
     for (const m of mismatches)
       lines.push(`|${m.severity}|${m.componentName ?? "Unknown"}|{{${m.selector}}}|${m.severityReason}|`);

[NoCoverage] LogicalOperator
extension/src/popup/popup.ts:63:36
   getLatestMismatches((mismatches) => {
     const lines = ["h2. HydraLens Report\n", "||Severity||Component||Selector||Reason||"];
     for (const m of mismatches)
-      lines.push(`|${m.severity}|${m.componentName ?? "Unknown"}|{{${m.selector}}}|${m.severityReason}|`);
+      lines.push(`|${m.severity}|${m.componentName && "Unknown"}|{{${m.selector}}}|${m.severityReason}|`);
     navigator.clipboard.writeText(lines.join("\n")).then(() => alert("Jira table copied to clipboard!"));
   });

[NoCoverage] ArrowFunction
extension/src/popup/popup.ts:64:58
     const lines = ["h2. HydraLens Report\n", "||Severity||Component||Selector||Reason||"];
     for (const m of mismatches)
       lines.push(`|${m.severity}|${m.componentName ?? "Unknown"}|{{${m.selector}}}|${m.severityReason}|`);
-    navigator.clipboard.writeText(lines.join("\n")).then(() => alert("Jira table copied to clipboard!"));
+    navigator.clipboard.writeText(lines.join("\n")).then(() => undefined);
   });
 });

[NoCoverage] BlockStatement
extension/src/popup/popup.ts:68:32
   });
 });
 
-function renderHistory(): void {
-  chrome.storage.local.get([HISTORY_KEY], (res) => {
-    const history: ScanRecord[] = (res[HISTORY_KEY] as ScanRecord[]) ?? [];
-    const list = document.getElementById("historyList")!;
-    list.innerHTML = "";
-    if (history.length === 0) {
-      list.innerHTML = '<div id="noHistory">No scans yet.</div>';
-      return;
-    }
-    for (const rec of history.slice().reverse()) {
-      const item = document.createElement("div");
-      item.className = "history-item";
-      const urlSpan = document.createElement("span");
-      urlSpan.style.cssText = "flex:1;overflow:hidden;text-overflow:ellipsis;white-space:nowrap;color:#ccc";
-      urlSpan.textContent = rec.url.replace(/^https?:\/\//, "").slice(0, 35);
-      const meta = document.createElement("span");
-      meta.textContent = `${rec.total} issues`;
-      item.appendChild(urlSpan);
-      item.appendChild(meta);
-      list.appendChild(item);
-    }
-  });
-}
+function renderHistory(): void {}
 
 chrome.runtime.onMessage.addListener((msg) => {

[NoCoverage] BlockStatement
extension/src/popup/popup.ts:69:52
 });
 
 function renderHistory(): void {
-  chrome.storage.local.get([HISTORY_KEY], (res) => {
-    const history: ScanRecord[] = (res[HISTORY_KEY] as ScanRecord[]) ?? [];
-    const list = document.getElementById("historyList")!;
-    list.innerHTML = "";
-    if (history.length === 0) {
-      list.innerHTML = '<div id="noHistory">No scans yet.</div>';
-      return;
-    }
-    for (const rec of history.slice().reverse()) {
-      const item = document.createElement("div");
-      item.className = "history-item";
-      const urlSpan = document.createElement("span");
-      urlSpan.style.cssText = "flex:1;overflow:hidden;text-overflow:ellipsis;white-space:nowrap;color:#ccc";
-      urlSpan.textContent = rec.url.replace(/^https?:\/\//, "").slice(0, 35);
-      const meta = document.createElement("span");
-      meta.textContent = `${rec.total} issues`;
-      item.appendChild(urlSpan);
-      item.appendChild(meta);
-      list.appendChild(item);
-    }
-  });
+  chrome.storage.local.get([HISTORY_KEY], (res) => {});
 }
 

[NoCoverage] LogicalOperator
extension/src/popup/popup.ts:70:35
 
 function renderHistory(): void {
   chrome.storage.local.get([HISTORY_KEY], (res) => {
-    const history: ScanRecord[] = (res[HISTORY_KEY] as ScanRecord[]) ?? [];
+    const history: ScanRecord[] = res[HISTORY_KEY] as ScanRecord[] && [];
     const list = document.getElementById("historyList")!;
     list.innerHTML = "";

[NoCoverage] StringLiteral
extension/src/popup/popup.ts:71:42
 function renderHistory(): void {
   chrome.storage.local.get([HISTORY_KEY], (res) => {
     const history: ScanRecord[] = (res[HISTORY_KEY] as ScanRecord[]) ?? [];
-    const list = document.getElementById("historyList")!;
+    const list = document.getElementById("")!;
     list.innerHTML = "";
     if (history.length === 0) {

[NoCoverage] StringLiteral
extension/src/popup/popup.ts:72:22
   chrome.storage.local.get([HISTORY_KEY], (res) => {
     const history: ScanRecord[] = (res[HISTORY_KEY] as ScanRecord[]) ?? [];
     const list = document.getElementById("historyList")!;
-    list.innerHTML = "";
+    list.innerHTML = "Stryker was here!";
     if (history.length === 0) {
       list.innerHTML = '<div id="noHistory">No scans yet.</div>';

[NoCoverage] ConditionalExpression
extension/src/popup/popup.ts:73:9
     const history: ScanRecord[] = (res[HISTORY_KEY] as ScanRecord[]) ?? [];
     const list = document.getElementById("historyList")!;
     list.innerHTML = "";
-    if (history.length === 0) {
+    if (false) {
       list.innerHTML = '<div id="noHistory">No scans yet.</div>';
       return;

[NoCoverage] ConditionalExpression
extension/src/popup/popup.ts:73:9
     const history: ScanRecord[] = (res[HISTORY_KEY] as ScanRecord[]) ?? [];
     const list = document.getElementById("historyList")!;
     list.innerHTML = "";
-    if (history.length === 0) {
+    if (true) {
       list.innerHTML = '<div id="noHistory">No scans yet.</div>';
       return;

[NoCoverage] MethodExpression
extension/src/popup/popup.ts:77:23
       list.innerHTML = '<div id="noHistory">No scans yet.</div>';
       return;
     }
-    for (const rec of history.slice().reverse()) {
+    for (const rec of history.slice()) {
       const item = document.createElement("div");
       item.className = "history-item";

[NoCoverage] MethodExpression
extension/src/popup/popup.ts:77:23
       list.innerHTML = '<div id="noHistory">No scans yet.</div>';
       return;
     }
-    for (const rec of history.slice().reverse()) {
+    for (const rec of history.reverse()) {
       const item = document.createElement("div");
       item.className = "history-item";

[NoCoverage] StringLiteral
extension/src/popup/popup.ts:78:43
       return;
     }
     for (const rec of history.slice().reverse()) {
-      const item = document.createElement("div");
+      const item = document.createElement("");
       item.className = "history-item";
       const urlSpan = document.createElement("span");

[NoCoverage] StringLiteral
extension/src/popup/popup.ts:79:24
     }
     for (const rec of history.slice().reverse()) {
       const item = document.createElement("div");
-      item.className = "history-item";
+      item.className = "";
       const urlSpan = document.createElement("span");
       urlSpan.style.cssText = "flex:1;overflow:hidden;text-overflow:ellipsis;white-space:nowrap;color:#ccc";

[NoCoverage] MethodExpression
extension/src/popup/popup.ts:82:29
       item.className = "history-item";
       const urlSpan = document.createElement("span");
       urlSpan.style.cssText = "flex:1;overflow:hidden;text-overflow:ellipsis;white-space:nowrap;color:#ccc";
-      urlSpan.textContent = rec.url.replace(/^https?:\/\//, "").slice(0, 35);
+      urlSpan.textContent = rec.url.replace(/^https?:\/\//, "");
       const meta = document.createElement("span");
       meta.textContent = `${rec.total} issues`;

[NoCoverage] Regex
extension/src/popup/popup.ts:82:45
       item.className = "history-item";
       const urlSpan = document.createElement("span");
       urlSpan.style.cssText = "flex:1;overflow:hidden;text-overflow:ellipsis;white-space:nowrap;color:#ccc";
-      urlSpan.textContent = rec.url.replace(/^https?:\/\//, "").slice(0, 35);
+      urlSpan.textContent = rec.url.replace(/^https:\/\//, "").slice(0, 35);
       const meta = document.createElement("span");
       meta.textContent = `${rec.total} issues`;

[NoCoverage] BlockStatement
extension/src/popup/popup.ts:92:47
   });
 }
 
-chrome.runtime.onMessage.addListener((msg) => {
-  if (msg.type === "HYDRALENS_RESULTS") {
-    chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
-      const url = tabs[0]?.url ?? "unknown";
-      chrome.storage.local.get([HISTORY_KEY], (res) => {
-        const history: ScanRecord[] = (res[HISTORY_KEY] as ScanRecord[]) ?? [];
-        history.push({ url, ts: Date.now(), total: msg.payload.mismatches.length, mismatches: msg.payload.mismatches });
-        if (history.length > MAX_HISTORY) history.splice(0, history.length - MAX_HISTORY);
-        chrome.storage.local.set({ [HISTORY_KEY]: history }, renderHistory);
-      });
-    });
-  }
-});
+chrome.runtime.onMessage.addListener((msg) => {});
 
 renderHistory();

[NoCoverage] EqualityOperator
extension/src/popup/popup.ts:93:7
 }
 
 chrome.runtime.onMessage.addListener((msg) => {
-  if (msg.type === "HYDRALENS_RESULTS") {
+  if (msg.type !== "HYDRALENS_RESULTS") {
     chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
       const url = tabs[0]?.url ?? "unknown";

[NoCoverage] BlockStatement
extension/src/popup/popup.ts:93:41
 }
 
 chrome.runtime.onMessage.addListener((msg) => {
-  if (msg.type === "HYDRALENS_RESULTS") {
-    chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
-      const url = tabs[0]?.url ?? "unknown";
-      chrome.storage.local.get([HISTORY_KEY], (res) => {
-        const history: ScanRecord[] = (res[HISTORY_KEY] as ScanRecord[]) ?? [];
-        history.push({ url, ts: Date.now(), total: msg.payload.mismatches.length, mismatches: msg.payload.mismatches });
-        if (history.length > MAX_HISTORY) history.splice(0, history.length - MAX_HISTORY);
-        chrome.storage.local.set({ [HISTORY_KEY]: history }, renderHistory);
-      });
-    });
-  }
+  if (msg.type === "HYDRALENS_RESULTS") {}
 });
 

[NoCoverage] BooleanLiteral
extension/src/popup/popup.ts:94:33
 
 chrome.runtime.onMessage.addListener((msg) => {
   if (msg.type === "HYDRALENS_RESULTS") {
-    chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
+    chrome.tabs.query({ active: false, currentWindow: true }, (tabs) => {
       const url = tabs[0]?.url ?? "unknown";
       chrome.storage.local.get([HISTORY_KEY], (res) => {

[NoCoverage] BooleanLiteral
extension/src/popup/popup.ts:94:54
 
 chrome.runtime.onMessage.addListener((msg) => {
   if (msg.type === "HYDRALENS_RESULTS") {
-    chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
+    chrome.tabs.query({ active: true, currentWindow: false }, (tabs) => {
       const url = tabs[0]?.url ?? "unknown";
       chrome.storage.local.get([HISTORY_KEY], (res) => {

[NoCoverage] OptionalChaining
extension/src/popup/popup.ts:95:19
 chrome.runtime.onMessage.addListener((msg) => {
   if (msg.type === "HYDRALENS_RESULTS") {
     chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
-      const url = tabs[0]?.url ?? "unknown";
+      const url = tabs[0].url ?? "unknown";
       chrome.storage.local.get([HISTORY_KEY], (res) => {
         const history: ScanRecord[] = (res[HISTORY_KEY] as ScanRecord[]) ?? [];

[NoCoverage] LogicalOperator
extension/src/popup/popup.ts:95:19
 chrome.runtime.onMessage.addListener((msg) => {
   if (msg.type === "HYDRALENS_RESULTS") {
     chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
-      const url = tabs[0]?.url ?? "unknown";
+      const url = tabs[0]?.url && "unknown";
       chrome.storage.local.get([HISTORY_KEY], (res) => {
         const history: ScanRecord[] = (res[HISTORY_KEY] as ScanRecord[]) ?? [];

[NoCoverage] BlockStatement
extension/src/popup/popup.ts:96:56
   if (msg.type === "HYDRALENS_RESULTS") {
     chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
       const url = tabs[0]?.url ?? "unknown";
-      chrome.storage.local.get([HISTORY_KEY], (res) => {
-        const history: ScanRecord[] = (res[HISTORY_KEY] as ScanRecord[]) ?? [];
-        history.push({ url, ts: Date.now(), total: msg.payload.mismatches.length, mismatches: msg.payload.mismatches });
-        if (history.length > MAX_HISTORY) history.splice(0, history.length - MAX_HISTORY);
-        chrome.storage.local.set({ [HISTORY_KEY]: history }, renderHistory);
-      });
+      chrome.storage.local.get([HISTORY_KEY], (res) => {});
     });
   }

[NoCoverage] ArrayDeclaration
extension/src/popup/popup.ts:97:77
     chrome.tabs.query({ active: true, currentWindow: true }, (tabs) => {
       const url = tabs[0]?.url ?? "unknown";
       chrome.storage.local.get([HISTORY_KEY], (res) => {
-        const history: ScanRecord[] = (res[HISTORY_KEY] as ScanRecord[]) ?? [];
+        const history: ScanRecord[] = (res[HISTORY_KEY] as ScanRecord[]) ?? ["Stryker was here"];
         history.push({ url, ts: Date.now(), total: msg.payload.mismatches.length, mismatches: msg.payload.mismatches });
         if (history.length > MAX_HISTORY) history.splice(0, history.length - MAX_HISTORY);

[NoCoverage] EqualityOperator
extension/src/popup/popup.ts:99:13
       chrome.storage.local.get([HISTORY_KEY], (res) => {
         const history: ScanRecord[] = (res[HISTORY_KEY] as ScanRecord[]) ?? [];
         history.push({ url, ts: Date.now(), total: msg.payload.mismatches.length, mismatches: msg.payload.mismatches });
-        if (history.length > MAX_HISTORY) history.splice(0, history.length - MAX_HISTORY);
+        if (history.length >= MAX_HISTORY) history.splice(0, history.length - MAX_HISTORY);
         chrome.storage.local.set({ [HISTORY_KEY]: history }, renderHistory);
       });

[NoCoverage] ArithmeticOperator
extension/src/popup/popup.ts:99:61
       chrome.storage.local.get([HISTORY_KEY], (res) => {
         const history: ScanRecord[] = (res[HISTORY_KEY] as ScanRecord[]) ?? [];
         history.push({ url, ts: Date.now(), total: msg.payload.mismatches.length, mismatches: msg.payload.mismatches });
-        if (history.length > MAX_HISTORY) history.splice(0, history.length - MAX_HISTORY);
+        if (history.length > MAX_HISTORY) history.splice(0, history.length + MAX_HISTORY);
         chrome.storage.local.set({ [HISTORY_KEY]: history }, renderHistory);
       });
