[NoCoverage] ObjectLiteral
extension/src/scripts/content.ts:60:12
 const SEVERITY_STYLE: Record<Severity, { border: string; bg: string; label: string }> = {
   security: { border: "#ef4444", bg: "rgba(239,68,68,0.20)", label: "SECURITY" },
   critical: { border: "#f97316", bg: "rgba(249,115,22,0.15)", label: "CRITICAL" },
-  warning: { border: "#eab308", bg: "rgba(234,179,8,0.15)", label: "WARNING" },
+  warning: {},
   info: { border: "#3b82f6", bg: "rgba(59,130,246,0.15)", label: "INFO" },
 };

[NoCoverage] StringLiteral
extension/src/scripts/content.ts:60:22
 const SEVERITY_STYLE: Record<Severity, { border: string; bg: string; label: string }> = {
   security: { border: "#ef4444", bg: "rgba(239,68,68,0.20)", label: "SECURITY" },
   critical: { border: "#f97316", bg: "rgba(249,115,22,0.15)", label: "CRITICAL" },
-  warning: { border: "#eab308", bg: "rgba(234,179,8,0.15)", label: "WARNING" },
+  warning: { border: "", bg: "rgba(234,179,8,0.15)", label: "WARNING" },
   info: { border: "#3b82f6", bg: "rgba(59,130,246,0.15)", label: "INFO" },
 };

[NoCoverage] StringLiteral
extension/src/scripts/content.ts:89:25
 
   function reposition(): void {
     const rect = element.getBoundingClientRect();
-    overlay.style.top = `${rect.top - 2}px`;
+    overlay.style.top = ``;
     overlay.style.left = `${rect.left - 2}px`;
     overlay.style.width = `${rect.width + 4}px`;

[NoCoverage] StringLiteral
extension/src/scripts/content.ts:91:27
     const rect = element.getBoundingClientRect();
     overlay.style.top = `${rect.top - 2}px`;
     overlay.style.left = `${rect.left - 2}px`;
-    overlay.style.width = `${rect.width + 4}px`;
+    overlay.style.width = ``;
     overlay.style.height = `${rect.height + 4}px`;
   }

[NoCoverage] BlockStatement
extension/src/scripts/content.ts:113:47
     return;
   }
 
-  function sendProgress(status: string): void {
-    chrome.runtime.sendMessage({ type: "HYDRALENS_PROGRESS", payload: { status } }).catch(() => {});
-  }
+  function sendProgress(status: string): void {}
 
   clearOverlays(); // synchronous ן¿½ if this throws, isScanning stays false (correct)

[NoCoverage] StringLiteral
extension/src/scripts/content.ts:114:40
   }
 
   function sendProgress(status: string): void {
-    chrome.runtime.sendMessage({ type: "HYDRALENS_PROGRESS", payload: { status } }).catch(() => {});
+    chrome.runtime.sendMessage({ type: "", payload: { status } }).catch(() => {});
   }
 

[NoCoverage] BooleanLiteral
extension/src/scripts/content.ts:118:16
   }
 
   clearOverlays(); // synchronous ן¿½ if this throws, isScanning stays false (correct)
-  isScanning = true;
+  isScanning = false;
 
   const controller = new AbortController();

[NoCoverage] ObjectLiteral
extension/src/scripts/content.ts:125:56
 
   try {
     sendProgress("Fetching server HTML...");
-    const response = await fetch(window.location.href, {
-      cache: "no-store",
-      signal: controller.signal,
-    });
+    const response = await fetch(window.location.href, {});
 
     // Auth-redirect guard: if the server redirected us to a different URL

[NoCoverage] EqualityOperator
extension/src/scripts/content.ts:132:25
 
     // Auth-redirect guard: if the server redirected us to a different URL
     // (e.g. a login page), the fetched HTML is not the real SSR output.
-    if (response.url && response.url !== window.location.href) {
+    if (response.url && response.url === window.location.href) {
       throw new Error(
         `Server redirected to ${response.url} — page may require authentication. Scan aborted to avoid false positives.`

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:132:25
 
     // Auth-redirect guard: if the server redirected us to a different URL
     // (e.g. a login page), the fetched HTML is not the real SSR output.
-    if (response.url && response.url !== window.location.href) {
+    if (response.url && true) {
       throw new Error(
         `Server redirected to ${response.url} — page may require authentication. Scan aborted to avoid false positives.`

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:141:9
     const serverHTML = await response.text();
 
     // Secondary guard: detect a login form in the fetched HTML
-    if (/<input[^>]+type=["\x27]password["\x27]/i.test(serverHTML)) {
+    if (false) {
       throw new Error(
         "Fetched HTML appears to be a login page. Scan aborted — authenticate first or use the CLI with --auth-state."

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:141:9
     const serverHTML = await response.text();
 
     // Secondary guard: detect a login form in the fetched HTML
-    if (/<input[^>]+type=["\x27]password["\x27]/i.test(serverHTML)) {
+    if (true) {
       throw new Error(
         "Fetched HTML appears to be a login page. Scan aborted — authenticate first or use the CLI with --auth-state."

[NoCoverage] StringLiteral
extension/src/scripts/content.ts:143:9
     // Secondary guard: detect a login form in the fetched HTML
     if (/<input[^>]+type=["\x27]password["\x27]/i.test(serverHTML)) {
       throw new Error(
-        "Fetched HTML appears to be a login page. Scan aborted — authenticate first or use the CLI with --auth-state."
+        ""
       );
     }

[NoCoverage] ArrowFunction
extension/src/scripts/content.ts:149:23
     clearTimeout(timeoutId);
 
     sendProgress("Waiting for client render...");
-    await new Promise((resolve) => setTimeout(resolve, 800));
+    await new Promise(() => undefined);
 
     sendProgress("Analysing DOM for mismatches...");

[NoCoverage] BlockStatement
extension/src/scripts/content.ts:154:61
     sendProgress("Analysing DOM for mismatches...");
     const allMismatches = await detectMismatchesAsync(serverHTML, document);
 
-    chrome.storage.local.get(["ignoredSelectors"], (res) => {
-      const ignored: string[] = (res.ignoredSelectors as string[]) ?? [];
-      const activeMismatches = allMismatches.filter((m) => !ignored.includes(m.selector));
-
-      chrome.runtime
-        .sendMessage({
-          type: "HYDRALENS_RESULTS",
-          payload: { mismatches: activeMismatches, totalFound: allMismatches.length },
-        })
-        .catch(() => {});
-
-      activeMismatches.forEach((mismatch) => {
-        const clientEl = document.querySelector(mismatch.selector) as HTMLElement | null;
-        if (clientEl) drawOverlay(clientEl, mismatch);
-      });
-    });
+    chrome.storage.local.get(["ignoredSelectors"], (res) => {});
   } catch (error: any) {
     const message =

[NoCoverage] LogicalOperator
extension/src/scripts/content.ts:155:33
     const allMismatches = await detectMismatchesAsync(serverHTML, document);
 
     chrome.storage.local.get(["ignoredSelectors"], (res) => {
-      const ignored: string[] = (res.ignoredSelectors as string[]) ?? [];
+      const ignored: string[] = res.ignoredSelectors as string[] && [];
       const activeMismatches = allMismatches.filter((m) => !ignored.includes(m.selector));
 

[NoCoverage] ArrowFunction
extension/src/scripts/content.ts:156:53
 
     chrome.storage.local.get(["ignoredSelectors"], (res) => {
       const ignored: string[] = (res.ignoredSelectors as string[]) ?? [];
-      const activeMismatches = allMismatches.filter((m) => !ignored.includes(m.selector));
+      const activeMismatches = allMismatches.filter(() => undefined);
 
       chrome.runtime

[NoCoverage] MethodExpression
extension/src/scripts/content.ts:156:32
 
     chrome.storage.local.get(["ignoredSelectors"], (res) => {
       const ignored: string[] = (res.ignoredSelectors as string[]) ?? [];
-      const activeMismatches = allMismatches.filter((m) => !ignored.includes(m.selector));
+      const activeMismatches = allMismatches;
 
       chrome.runtime

[NoCoverage] StringLiteral
extension/src/scripts/content.ts:160:17
 
       chrome.runtime
         .sendMessage({
-          type: "HYDRALENS_RESULTS",
+          type: "",
           payload: { mismatches: activeMismatches, totalFound: allMismatches.length },
         })

[NoCoverage] BlockStatement
extension/src/scripts/content.ts:170:24
         if (clientEl) drawOverlay(clientEl, mismatch);
       });
     });
-  } catch (error: any) {
-    const message =
-      error.name === "AbortError"
-        ? "Fetch timed out (6s). The server may be too slow or streaming infinitely."
-        : (error.message ?? "Unknown error during scan.");
-    console.error("[HydraLens]", message);
-    chrome.runtime.sendMessage({ type: "HYDRALENS_ERROR", payload: { message } }).catch(() => {});
-  } finally {
+  } catch (error: any) {} finally {
     clearTimeout(timeoutId);
     // FIX: reset immediately in finally; no arbitrary 2s delay that could cause stuck state

[NoCoverage] EqualityOperator
extension/src/scripts/content.ts:172:7
     });
   } catch (error: any) {
     const message =
-      error.name === "AbortError"
+      error.name !== "AbortError"
         ? "Fetch timed out (6s). The server may be too slow or streaming infinitely."
         : (error.message ?? "Unknown error during scan.");

[NoCoverage] StringLiteral
extension/src/scripts/content.ts:173:11
   } catch (error: any) {
     const message =
       error.name === "AbortError"
-        ? "Fetch timed out (6s). The server may be too slow or streaming infinitely."
+        ? ""
         : (error.message ?? "Unknown error during scan.");
     console.error("[HydraLens]", message);

[NoCoverage] LogicalOperator
extension/src/scripts/content.ts:174:12
     const message =
       error.name === "AbortError"
         ? "Fetch timed out (6s). The server may be too slow or streaming infinitely."
-        : (error.message ?? "Unknown error during scan.");
+        : (error.message && "Unknown error during scan.");
     console.error("[HydraLens]", message);
     chrome.runtime.sendMessage({ type: "HYDRALENS_ERROR", payload: { message } }).catch(() => {});

[NoCoverage] StringLiteral
extension/src/scripts/content.ts:174:29
     const message =
       error.name === "AbortError"
         ? "Fetch timed out (6s). The server may be too slow or streaming infinitely."
-        : (error.message ?? "Unknown error during scan.");
+        : (error.message ?? "");
     console.error("[HydraLens]", message);
     chrome.runtime.sendMessage({ type: "HYDRALENS_ERROR", payload: { message } }).catch(() => {});

[NoCoverage] BlockStatement
extension/src/scripts/content.ts:184:47
   }
 }
 
-chrome.runtime.onMessage.addListener((msg) => {
-  if (msg.type === "HYDRALENS_RUN") runHydraLens();
-  if (msg.type === "HYDRALENS_CLEAR") {
-    clearOverlays();
-    isScanning = false;
-  }
-});
+chrome.runtime.onMessage.addListener((msg) => {});
 
 

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:185:7
 }
 
 chrome.runtime.onMessage.addListener((msg) => {
-  if (msg.type === "HYDRALENS_RUN") runHydraLens();
+  if (false) runHydraLens();
   if (msg.type === "HYDRALENS_CLEAR") {
     clearOverlays();

[NoCoverage] ConditionalExpression
extension/src/scripts/content.ts:186:7
 
 chrome.runtime.onMessage.addListener((msg) => {
   if (msg.type === "HYDRALENS_RUN") runHydraLens();
-  if (msg.type === "HYDRALENS_CLEAR") {
+  if (true) {
     clearOverlays();
     isScanning = false;

[NoCoverage] BlockStatement
extension/src/scripts/content.ts:186:39
 
 chrome.runtime.onMessage.addListener((msg) => {
   if (msg.type === "HYDRALENS_RUN") runHydraLens();
-  if (msg.type === "HYDRALENS_CLEAR") {
-    clearOverlays();
-    isScanning = false;
-  }
+  if (msg.type === "HYDRALENS_CLEAR") {}
 });
 

[NoCoverage] BooleanLiteral
extension/src/scripts/content.ts:188:18
   if (msg.type === "HYDRALENS_RUN") runHydraLens();
   if (msg.type === "HYDRALENS_CLEAR") {
     clearOverlays();
-    isScanning = false;
+    isScanning = true;
   }
 });
